
#Область СлужебныеПроцедурыИФункции

&Вместо("ЗаполнитьЗначенияПустыхСвойств")
Процедура ТБ_ЗаполнитьЗначенияПустыхСвойств(Приемник, Источник, СписокСвойств, ИсключаяСвойства)
	
	Если ИсключаяСвойства = Неопределено Тогда
		ИсключаяСвойстваМассив = Новый Массив;
	ИначеЕсли ТипЗнч(ИсключаяСвойства) = Тип("Строка") Тогда	
		ИсключаяСвойстваМассив = СтрРазделить(ИсключаяСвойства, ",");
	Иначе
		ИсключаяСвойстваМассив = ИсключаяСвойства;
	КонецЕсли;
		
	Если СписокСвойств = Неопределено Тогда
		
		Для каждого КлючЗначение Из Источник Цикл
			Если ИсключаяСвойстваМассив.Найти(КлючЗначение.Ключ) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
//#Вставка
			// ошибка типовой, процедура вызывается для объекта
			Если ТипЗнч(Приемник) = Тип("СправочникОбъект.Номенклатура") Тогда
				
				Если ((ТипЗнч(Приемник[КлючЗначение.Ключ]) = Тип("Булево")
							И Не Приемник[КлючЗначение.Ключ])
						Или Не ЗначениеЗаполнено(Приемник[КлючЗначение.Ключ])) Тогда
					Приемник[КлючЗначение.Ключ] = КлючЗначение.Значение;
				КонецЕсли;
				Продолжить;
				
			КонецЕсли;
//#КонецВставки
			Если Приемник.Свойство(КлючЗначение.Ключ)
				И ((ТипЗнч(Приемник[КлючЗначение.Ключ]) = Тип("Булево")
						И Не Приемник[КлючЗначение.Ключ])
					Или Не ЗначениеЗаполнено(Приемник[КлючЗначение.Ключ])) Тогда
				Приемник[КлючЗначение.Ключ] = КлючЗначение.Значение;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Если ТипЗнч(СписокСвойств) = Тип("Строка") Тогда	
			СписокСвойствМассив = СтрРазделить(СписокСвойств, ",");
		Иначе
			СписокСвойствМассив = СписокСвойств;
		КонецЕсли;
		
		Для каждого СтрМас Из СписокСвойствМассив Цикл
			Если ИсключаяСвойстваМассив.Найти(СтрМас) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если (ТипЗнч(Приемник[СтрМас]) = Тип("Булево")
						И Не Приемник[СтрМас])
					Или Не ЗначениеЗаполнено(Приемник[СтрМас]) Тогда
			Приемник[СтрМас] = Источник[СтрМас];
		КонецЕсли;
		
	КонецЦикла;
	
КонецЕсли;

КонецПроцедуры

#КонецОбласти
