
#Область ПрограммныйИнтерфейс

// Возвращает доступные пользователю настройки загрузки объектов для формы списка.
//
// Параметры:
//  ИмяФормы - Строка - имя формы списка, для которой отбираются настройки.
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.ТБ_НастройкиЗагрузкиОбъектов - настройки загрузки.
//
Функция НастройкиЗагрузки(Знач ИмяФормы) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	&Пользователь КАК Пользователь
	|ПОМЕСТИТЬ ПользователиИГруппы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГруппыПользователейСостав.Ссылка
	|ИЗ
	|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|ГДЕ
	|	ГруппыПользователейСостав.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиЗагрузкиОбъектов.Ссылка КАК НастройкаЗагрузки,
	|	НастройкиЗагрузкиОбъектов.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ТБ_НастройкиЗагрузкиОбъектов КАК НастройкиЗагрузкиОбъектов
	|ГДЕ
	|	НастройкиЗагрузкиОбъектов.ИмяФормыСписка = &ИмяФормы
	|	И &ПолныеПрава
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НастройкиЗагрузкиОбъектов.Ссылка,
	|	НастройкиЗагрузкиОбъектов.Наименование
	|ИЗ
	|	Справочник.ТБ_НастройкиЗагрузкиОбъектов КАК НастройкиЗагрузкиОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТБ_ДоступностьНастроекЗагрузкиОбъектов КАК ДоступностьНастроекЗагрузкиОбъектов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступа
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПользователиИГруппы КАК ПользователиИГруппы
	|				ПО ГруппыДоступа.Пользователь = ПользователиИГруппы.Пользователь
	|			ПО ДоступностьНастроекЗагрузкиОбъектов.ГруппаДоступа = ГруппыДоступа.Ссылка
	|		ПО НастройкиЗагрузкиОбъектов.Ссылка = ДоступностьНастроекЗагрузкиОбъектов.НастройкаЗагрузкиОбъекта
	|ГДЕ
	|	НастройкиЗагрузкиОбъектов.ИмяФормыСписка = &ИмяФормы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование");
	
	Запрос.УстановитьПараметр("ИмяФормы",     ИмяФормы);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("ПолныеПрава",  Пользователи.ЭтоПолноправныйПользователь());
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("НастройкаЗагрузки");
	
КонецФункции

// Загружает объект и возвращает описание ошибок загрузки.
//
// Параметры:
//  Объект - СправочникСсылка, ДокументСсылка - загружаемый объект.
//
// Возвращаемое значение:
//  Массив из Структура - описание ошибок загрузки.
//
Функция ЗагрузитьОбъект(Знач Объект) Экспорт
	
	ОписаниеОшибок = ТБ_СопоставлениеОбъектов.НовоеОписаниеОшибок();
	
	ТБ_СопоставлениеОбъектов.ЗагрузитьОбъект(Объект, ОписаниеОшибок);
	
	Возврат ОписаниеОшибок;
	
КонецФункции

#КонецОбласти
