
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборСопоставленоПриИзменении(Элемент)
	
	Если ОтборСопоставлено = "Сопоставлено" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "Объект", , ВидСравненияКомпоновкиДанных.Заполнено, , Истина);
		
	ИначеЕсли ОтборСопоставлено = "НеСопоставлено" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "Объект", , ВидСравненияКомпоновкиДанных.НеЗаполнено, , Истина);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "Объект", , ВидСравненияКомпоновкиДанных.Равно, , Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Оповестить("Удаление_СоответствияОбъектов");
	
КонецПроцедуры

#КонецОбласти
