
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает имена свойств источника данных, имеющих тип "Дата".
//
// Параметры:
//  ИсточникДанных - СправочникСсылка.ТБ_ИсточникиДанных - источник данных.
//
// Возвращаемое значение:
//  Массив из Строка - имена свойств.
//
Функция ИменаСвойствСоЗначениямиДата(Знач ИсточникДанных) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Свойства.Имя КАК Имя
	|ИЗ
	|	Справочник.ТБ_ИсточникиДанных.Свойства КАК Свойства
	|ГДЕ
	|	Свойства.Ссылка = &ИсточникДанных
	|	И Свойства.Тип = ""Дата""");
	
	Запрос.УстановитьПараметр("ИсточникДанных", ИсточникДанных);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Имя");
	
КонецФункции

#КонецОбласти

#КонецЕсли
