
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ТипИсточника <> Перечисления.ТБ_ТипыИсточниковДанных.ВнешнийИсточник Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ИмяТаблицыВнешнегоИсточника");
	КонецЕсли;
	
	Если ТипИсточника <> Перечисления.ТБ_ТипыИсточниковДанных.COM1C Тогда
		МассивНепроверяемыхРеквизитов.Добавить("НастройкаПодключения");
	КонецЕсли;
	
	Если ТипИсточника <> Перечисления.ТБ_ТипыИсточниковДанных.COM1C
		Или Не ИспользуетсяПланОбмена Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("КодУзлаПланаОбмена");
		МассивНепроверяемыхРеквизитов.Добавить("ИмяОбъектаПланаОбмена");
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	//
	
	Имена = Новый Массив;
	
	Для каждого СтрокаТаблицы Из Свойства Цикл
		
		АдресОшибки = СтрШаблон(НСтр("ru = ' в строке %1 списка ""Свойства""'"), СтрокаТаблицы.НомерСтроки);
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Имя) Тогда
			
			ИмяПоПравилам = ТБ_СопоставлениеОбъектов.ИдентификаторДляФормул(СтрокаТаблицы.Имя);
			
			Если ВРег(СтрокаТаблицы.Имя) <> ВРег(ИмяПоПравилам) Тогда
				
				ТекстОшибки = НСтр("ru = 'Имя не соответствует правилам именования переменных'");
				ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки + АдресОшибки,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Свойства", СтрокаТаблицы.НомерСтроки, "Имя"),
					,
					Отказ);
				
			ИначеЕсли Имена.Найти(СтрокаТаблицы.Имя) <> Неопределено Тогда
				
				ТекстОшибки = НСтр("ru = 'Имя не уникально'");
				ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки + АдресОшибки,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Свойства", СтрокаТаблицы.НомерСтроки, "Имя"),
					,
					Отказ);
				
			Иначе
				Имена.Добавить(СтрокаТаблицы.Имя);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
