
#Область ОбработчикиСобытийЭлементовТаблицыФормыЭтапы

&НаКлиенте
Процедура ЭтапыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущиеДанные.ВариантЗагрузки = ПредопределенноеЗначение("Перечисление.ТБ_ВариантыЗагрузкиОбъектов.Все");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВсеЭтапы(Команда)
	
	ТБ_СопоставлениеОбъектовКлиент.УстановитьПометки(
		Объект.Этапы,
		Элементы.Этапы,
		Истина,
		,
		Модифицированность);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьВсеЭтапы(Команда)
	
	ТБ_СопоставлениеОбъектовКлиент.УстановитьПометки(
		Объект.Этапы,
		Элементы.Этапы,
		Ложь,
		,
		Модифицированность);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВариантЗагрузки(Команда)
	
	ВыделенныеСтроки = Элементы.Этапы.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'В таблице отсутствуют выделенные строки. Выделите строки для заполнения варианта заполнения.'"));
		Возврат;
		
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьВариантЗагрузкиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Перечисление.ТБ_ВариантыЗагрузкиОбъектов.ФормаВыбора",
		, ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьВариантЗагрузкиЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		
		Модифицированность = Истина;
		
		Для каждого Идентификатор Из ДополнительныеПараметры.ВыделенныеСтроки Цикл
			
			СтрокаТаблицы = Объект.Этапы.НайтиПоИдентификатору(Идентификатор);
			СтрокаТаблицы.ВариантЗагрузки = РезультатЗакрытия;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
