
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекстОшибки = "";
	
	Если Не ПроверитьСценарий(ПараметрКоманды, ТекстОшибки) Тогда
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ПоказатьПредупреждение(, ТекстОшибки);
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Сценарий", ПараметрКоманды);
	
	Форма = ПолучитьФорму("Справочник.ТБ_СценарииЗагрузкиОбъектов.Форма.ФормаЗагрузки",
		ПараметрыФормы, , ПараметрКоманды);
	
	Если Форма.Открыта() Тогда
		Форма.Активизировать();
	Иначе
		
		Форма.Открыть();
		
		ДополнительныеПараметры = Новый Структура("Форма", Форма);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Выполняется загрузка объектов'");
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.Интервал = 2;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			НачатьЗагрузкуОбъектов(ПараметрКоманды, Форма.УникальныйИдентификатор),
			Новый ОписаниеОповещения("ЗагрузитьОбъектыЗавершение", ЭтотОбъект, ДополнительныеПараметры),
			ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьСценарий(Знач Сценарий, ТекстОшибки)
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сценарий, "ЭтоГруппа,Статус");
	
	Если ЗначенияРеквизитов.ЭтоГруппа Тогда
		
		ТекстОшибки = НСтр("ru = 'Команда недоступна для группы.'");
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ЗначенияРеквизитов.Статус <> Перечисления.ТБ_СтатусыСценариевЗагрузки.Действует Тогда
		
		ТекстОшибки = НСтр("ru = 'Сценарий не действует.'");
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция НачатьЗагрузкуОбъектов(Знач Сценарий, Знач УникальныйИдентификатор)
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор),
		"ТБ_ЗагрузкаОбъектов.ВыполнитьСценарийЗагрузки",
		Сценарий);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьОбъектыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Форма.Закрыть();
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Сценарий выполнен'"),
		,
		НСтр("ru = 'Сценарий загрузки выполнен.'"),
		БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

#КонецОбласти
