
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	// 2024.01.26 Заменили список выбора, справочником, для использования иерархии
	//ТБ_СопоставлениеОбъектов.ЗаполнитьСписокВыбораОбъекта(Элементы.ИмяОбъекта.СписокВыбора);
	
	Если ЗначениеЗаполнено(Объект.ИмяОбъекта) Тогда
		ТБ_СопоставлениеОбъектов.ЗаполнитьСписокВыбораИмяОбъекта(Объект.ИмяОбъекта, Элементы.ИмяОбъекта.СписокВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяОбъектаПриИзменении(Элемент)
	
	Объект.ПредставлениеОбъекта     = ТБ_СопоставлениеОбъектовКлиент.ПредставлениеЗначения(Объект.ИмяОбъекта, Элементы.ИмяОбъекта.СписокВыбора);
	Объект.ИмяФормыСписка           = "";
	Объект.ПредставлениеФормыСписка = "";
	
	Объект.ПоляСписка.Очистить();
	Объект.ТабличныеЧасти.Очистить();
	
	ИмяОбъектаПриИзмененииНаСервере();
	
	ЗаполнитьСписокВыбораНаименования(ЭтотОбъект, Элементы.Наименование.СписокВыбора, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилоСопоставленияПриИзменении(Элемент)
	
	ЗаполнитьТаблицуПолейСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФормыСпискаПриИзменении(Элемент)
	
	Объект.ПредставлениеФормыСписка = ТБ_СопоставлениеОбъектовКлиент.ПредставлениеЗначения(Объект.ИмяФормыСписка, Элементы.ИмяФормыСписка.СписокВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяОбъектаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.ТБ_Объекты.ФормаВыбора",, Элементы.ИмяОбъекта,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ИмяОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	СтруктураВыбранногоЗначения = ИмяОбъектаОбработкаВыбораНаСервере(ВыбранноеЗначение);   
	
	ИмяОбъектаСписокВыбора = Элементы.ИмяОбъекта.СписокВыбора;
	
	ИмяОбъектаСписокВыбора.Очистить();
	
	ИмяОбъектаСписокВыбора.Добавить(СтруктураВыбранногоЗначения.ПолноеИмя, СтруктураВыбранногоЗначения.Наименование, Истина);
	
	ВыбранноеЗначение = СтруктураВыбранногоЗначения.ПолноеИмя;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабличныеЧасти

&НаКлиенте
Процедура ТабличныеЧастиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ТабличныеЧастиПравилоСопоставленияИсточникДанных Тогда
		
		ПравилоСопоставления = Элемент.ТекущиеДанные.ПравилоСопоставления;
		Если ЗначениеЗаполнено(ПравилоСопоставления) Тогда
			
			ИсточникДанных = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ПравилоСопоставления, "ИсточникДанных");
			Если ЗначениеЗаполнено(ИсточникДанных) Тогда
				ПоказатьЗначение(, ИсточникДанных);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоляСписка

&НаКлиенте
Процедура ПоляСпискаПометкаПриИзменении(Элемент)
	
	СортироватьТаблицуПолейСписка(Элементы.ПоляСписка.ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоляСписка(Команда)
	
	ЗаполнитьТаблицуПолейСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсеПоляСписка(Команда)
	
	ТБ_СопоставлениеОбъектовКлиент.УстановитьПометки(
		Объект.ПоляСписка,
		Элементы.ПоляСписка,
		Истина,
		,
		Модифицированность);
	
	СортироватьТаблицуПолейСписка(Элементы.ПоляСписка.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьВсеПоляСписка(Команда)
	
	ТБ_СопоставлениеОбъектовКлиент.УстановитьПометки(
		Объект.ПоляСписка,
		Элементы.ПоляСписка,
		Ложь,
		,
		Модифицированность);
	
	СортироватьТаблицуПолейСписка(Элементы.ПоляСписка.ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЗаполнитьСписокВыбораНаименования(ЭтотОбъект, Элементы.Наименование.СписокВыбора);
	
	ТБ_СопоставлениеОбъектов.ЗаполнитьСписокВыбораТабличнойЧасти(Элементы.ТабличныеЧастиИмяТабличнойЧасти.СписокВыбора, Объект.ИмяОбъекта);
	ТБ_СопоставлениеОбъектов.ЗаполнитьСписокВыбораФормыСписка(Элементы.ИмяФормыСписка.СписокВыбора, Объект.ИмяОбъекта);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораНаименования(Форма, СписокВыбора, Знач ЗаполнитьНаименование = Ложь)
	
	Объект = Форма.Объект;
	
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(Объект.ПредставлениеОбъекта);
	
	Если ЗаполнитьНаименование И Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Объект.ПредставлениеОбъекта;
	КонецЕсли;
	
КонецПроцедуры

#Область ПриИзмененииРеквизитов

&НаСервере
Процедура ИмяОбъектаПриИзмененииНаСервере()
	
	ТБ_СопоставлениеОбъектов.ЗаполнитьСписокВыбораТабличнойЧасти(Элементы.ТабличныеЧастиИмяТабличнойЧасти.СписокВыбора, Объект.ИмяОбъекта);
	ТБ_СопоставлениеОбъектов.ЗаполнитьСписокВыбораФормыСписка(Элементы.ИмяФормыСписка.СписокВыбора, Объект.ИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#Область ПоляСписка

&НаСервере
Процедура ЗаполнитьТаблицуПолейСписка()
	
	ТаблицаПолей = Объект.ПоляСписка.Выгрузить().СкопироватьКолонки();
	
	Если ЗначениеЗаполнено(Объект.ПравилоСопоставления) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Свойства.Имя КАК Имя,
		|	Свойства.Представление КАК Представление
		|ИЗ
		|	Справочник.ТБ_ПравилаСопоставления.СвойстваИсточника КАК СвойстваИсточника
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТБ_ИсточникиДанных.Свойства КАК Свойства
		|		ПО СвойстваИсточника.Ссылка.ИсточникДанных = Свойства.Ссылка
		|			И СвойстваИсточника.Имя = Свойства.Имя
		|ГДЕ
		|	СвойстваИсточника.Ссылка = &ПравилоСопоставления
		|	И СвойстваИсточника.Пометка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Представление");
		
		Запрос.УстановитьПараметр("ПравилоСопоставления", Объект.ПравилоСопоставления);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаПолей.Добавить(), Выборка);
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаПолей.Сортировать("Представление");
	
	//
	
	УдаляемыеСтроки = Новый Массив;
	ПараметрыОтбора = Новый Структура("Имя");
	
	Для каждого ТекущаяСтрока Из Объект.ПоляСписка Цикл
		
		Если ТекущаяСтрока.Пометка Тогда
			
			ЗаполнитьЗначенияСвойств(ПараметрыОтбора, ТекущаяСтрока);
			
			НайденныеСтроки = ТаблицаПолей.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() <> 0 Тогда
				
				ТаблицаПолей.Удалить(НайденныеСтроки[0]);
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		
		УдаляемыеСтроки.Добавить(ТекущаяСтрока);
		
	КонецЦикла;
	
	Для каждого ТекущаяСтрока Из УдаляемыеСтроки Цикл
		Объект.ПоляСписка.Удалить(ТекущаяСтрока);
	КонецЦикла;
	
	Для каждого ТекущаяСтрока Из ТаблицаПолей Цикл
		ЗаполнитьЗначенияСвойств(Объект.ПоляСписка.Добавить(), ТекущаяСтрока);
	КонецЦикла;
	
	СортироватьТаблицуПолейСписка();
	
КонецПроцедуры

&НаСервере
Процедура СортироватьТаблицуПолейСписка(ТекущаяСтрока = Неопределено)
	
	ТБ_СопоставлениеОбъектов.СортироватьТаблицуРеквизитов(Объект.ПоляСписка, Элементы.ПоляСписка.ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция ИмяОбъектаОбработкаВыбораНаСервере(ВыбранноеЗначение) 
	Возврат Новый Структура("Наименование, ПолноеИмя", ВыбранноеЗначение.Наименование, ВыбранноеЗначение.ПолноеИмя);
КонецФункции

#КонецОбласти    


