
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТБ_Объекты.Наименование КАК Наименование,
		|	ТБ_Объекты.ПолноеИмя КАК ПолноеИмя
		|ИЗ
		|	Справочник.ТБ_Объекты КАК ТБ_Объекты
		|ГДЕ
		|	ТБ_Объекты.Ссылка <> &Ссылка"; 
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	Если Выборка.НайтиСледующий(Наименование, "Наименование") Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Элемент с таким наименованием уже существует!"); 
	ИначеЕсли ПолноеИмя <> Null И Выборка.НайтиСледующий(ПолноеИмя, "ПолноеИмя") Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Элемент с таким полным именем уже существует!");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
