
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПараметрыЗапроса", ПараметрыЗапроса);
	
	Если ПустаяСтрока(ПараметрыЗапроса) Тогда
		
		ПараметрыЗапроса = 
		"//СтрокаGUID = ""a763cfbb-f94f-4c67-8e13-0e96a3a7f353"";
		|//GUID = Новый УникальныйИдентификатор(СтрокаGUID);
		|//Параметры.Вставить(""Организация"", Справочники.Организации.ПолучитьСсылку(GUID));";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
	
	Закрыть(ПараметрыЗапроса);
	
КонецПроцедуры

#КонецОбласти
