
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьСвойстваОбъектаДанных(Параметры.АдресСвойствВХранилище);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	АдресДанныхВХранилище = ЗагрузитьНаСервере();
	
	Закрыть(АдресДанныхВХранилище);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьСвойстваОбъектаДанных(АдресСвойствВХранилище)
	
	Макет = Обработки.ТБ_СопоставлениеОбъектов.ПолучитьМакет("МакетЗагрузкиДанных");
	
	ОбластьКолонка = Макет.ПолучитьОбласть("Колонка");
	
	ТаблицаСвойств = ПолучитьИзВременногоХранилища(АдресСвойствВХранилище);
	Для каждого СтрокаСвойств Из ТаблицаСвойств Цикл
		
		ЗаполнитьЗначенияСвойств(СвойстваОбъектаДанных.Добавить(), СтрокаСвойств);
		
		УстановитьПараметр(ОбластьКолонка, "Представление", СтрокаСвойств.Представление);
		ТабличныйДокумент.Присоединить(ОбластьКолонка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметр(ОбластьМакета, Знач ИмяПараметра, Знач ЗначениеПараметра)
	
	ОбластьМакета.Параметры.Заполнить(Новый Структура(ИмяПараметра, ЗначениеПараметра));
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьНаСервере()
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	Для каждого Свойство Из СвойстваОбъектаДанных Цикл
		ТаблицаДанных.Колонки.Добавить(Свойство.Имя, Новый ОписаниеТипов(Свойство.Тип));
	КонецЦикла;
	
	ОбластьЯчеек = ТабличныйДокумент.Область(1, 1, ТабличныйДокумент.ВысотаТаблицы, СвойстваОбъектаДанных.Количество());
	
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);
	
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	
	ТаблицаДаныхСтрокой = ПостроительОтчета.Результат.Выгрузить();
	
	Для каждого СтрокаТаблицы Из ТаблицаДаныхСтрокой Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(), СтрокаТаблицы);
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаДанных);
	
КонецФункции

#КонецОбласти
