
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	ЗаполнитьСписокТаблицВнешнихИсточников(Элементы.ИмяТаблицыВнешнегоИсточника.СписокВыбора);
	ЗаполнитьСписокТиповСсылки(Элементы.СвойстваТипСсылки.СписокВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипИсточникаПриИзменении(Элемент)
	
	ТипИсточникаПриИзмененииНаСервере();
	
	ЗаполнитьСписокВыбораНаименования(ЭтотОбъект, Элементы.Наименование.СписокВыбора, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяТаблицыВнешнегоИсточникаПриИзменении(Элемент)
	
	ИмяТаблицыВнешнегоИсточникаПриИзмененииНаСервере();
	
	ЗаполнитьСписокВыбораНаименования(ЭтотОбъект, Элементы.Наименование.СписокВыбора, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяПланОбменаПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСвойства

&НаКлиенте
Процедура СвойстваПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		
		ТекущиеДанные = Элементы.Свойства.ТекущиеДанные;
		ТекущиеДанные.Тип = "Строка";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваПредставлениеПриИзменении(Элемент)
	
	Если Объект.ТипИсточника = ПредопределенноеЗначение("Перечисление.ТБ_ТипыИсточниковДанных.Таблица") Тогда
		
		ТекущиеДанные = Элементы.Свойства.ТекущиеДанные;
		ТекущиеДанные.Имя = ИдентификаторДляФормул(ТекущиеДанные.Представление);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьСвойстваИсточника(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		ЗаполнитьСвойстваИсточникаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗапроса(Команда)
	
	ПараметрыФормы = Новый Структура("ПараметрыЗапроса", Объект.ПараметрыЗапроса);
	
	Оповещение = Новый ОписаниеОповещения("ПараметрыЗапросаЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ТБ_ИсточникиДанных.Форма.ПараметрыЗапроса",
		ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор, , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСвойстваИзXML(Команда)
	
	Если Объект.Свойства.Количество() <> 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьСвойстваИзXMLВопрос", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Очистить таблицу свойств источника перед загрузкой?'");
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
		
	КонецЕсли;
	
	ЗагрузитьИзXMLНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПараметрыЗапросаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		
		Объект.ПараметрыЗапроса = РезультатЗакрытия;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСвойстваИзXMLВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Объект.Свойства.Очистить();
		//Элементы.Свойства.Обновить();
		
		ЗагрузитьИзXMLНаКлиенте();
		
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		ЗагрузитьИзXMLНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзXMLНаКлиенте()
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзXMLЗавершение", ЭтотОбъект);
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Фильтр = НСтр("ru = 'Файлы XML (*.xml)|*.xml'");
	ДиалогОткрытияФайла.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзXMLЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ЗагрузитьСвойстваИзXMLНаСервере(ВыбранныеФайлы[0]);
		
		ПоказатьОповещениеПользователя(НСтр("ru = 'Свойства источника загружены (%1)'"),
			,
			НСтр("ru = 'Загрузка свойств источника завершена.'"),
			БиблиотекаКартинок.Информация32);
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСвойстваИзXMLНаСервере(ПутьКФайлу)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлу);
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если ЧтениеXML.ЛокальноеИмя = "Строка" Тогда
				ЧтениеXML.Пропустить();
			ИначеЕсли ЧтениеXML.ЛокальноеИмя = "Соответствие" Или ЧтениеXML.ЛокальноеИмя = "СоответствиеТипов" Тогда
				Продолжить;
			Иначе
				НоваяСтрока = Объект.Свойства.Добавить();
				ИмяКолонки = ЧтениеXML.ЛокальноеИмя;
			КонецЕсли;
			
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			
			НоваяСтрока.Имя = ИмяКолонки;
			НоваяСтрока.Представление = ИмяКолонки;
			НоваяСтрока.Тип = ЧтениеXML.Значение;
			
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СвойстваТип.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СвойстваИмя.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТипИсточника");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТБ_ТипыИсточниковДанных.ВнешнийИсточник;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УстановитьДоступность();
	
	ЗаполнитьСписокВыбораНаименования(ЭтотОбъект, Элементы.Наименование.СписокВыбора);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()
	
	ЭтоТаблица         = Объект.ТипИсточника = Перечисления.ТБ_ТипыИсточниковДанных.Таблица;
	ЭтоВнешнийИсточник = Объект.ТипИсточника = Перечисления.ТБ_ТипыИсточниковДанных.ВнешнийИсточник;
	ЭтоCOMСоединение   = Объект.ТипИсточника = Перечисления.ТБ_ТипыИсточниковДанных.COM1C;
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		"ИмяТаблицыВнешнегоИсточника",
		"Видимость",
		ЭтоВнешнийИсточник);
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("НастройкаПодключения");
	ИменаЭлементов.Добавить("СвойстваТипСсылки");
	ИменаЭлементов.Добавить("СтраницаЗапрос");
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		ИменаЭлементов,
		"Видимость",
		ЭтоCOMСоединение);
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		"ГруппаПланОбмена",
		"Видимость",
		Объект.ИспользуетсяПланОбмена);
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		"ЗаполнитьСвойстваИсточника",
		"Видимость",
		ЭтоВнешнийИсточник Или ЭтоCOMСоединение);
	
	Элементы.Наименование.КнопкаВыпадающегоСписка = ЭтоВнешнийИсточник;
	//Элементы.Свойства.ИзменятьСоставСтрок = ЭтоТаблица;
	Элементы.Свойства.ИзменятьСоставСтрок = ЭтоТаблица Или ЭтоCOMСоединение;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораНаименования(Форма, СписокВыбора, Знач ЗаполнитьНаименование = Ложь)
	
	Объект = Форма.Объект;
	
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(Объект.ПредставлениеТаблицыВнешнегоИсточника);
	
	Если ЗаполнитьНаименование И Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Объект.ПредставлениеТаблицыВнешнегоИсточника;
	КонецЕсли;
	
КонецПроцедуры

#Область ПриИзмененииРеквизитов

&НаСервере
Процедура ТипИсточникаПриИзмененииНаСервере()
	
	Объект.ИмяТаблицыВнешнегоИсточника = "";
	
	Если Объект.ТипИсточника = Перечисления.ТБ_ТипыИсточниковДанных.ВнешнийИсточник
		Или Объект.ТипИсточника = Перечисления.ТБ_ТипыИсточниковДанных.COM1C Тогда
		Объект.Свойства.Очистить();
	КонецЕсли;
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ИмяТаблицыВнешнегоИсточникаПриИзмененииНаСервере()
	
	Объект.ПредставлениеТаблицыВнешнегоИсточника = ПредставлениеТаблицыВнешнегоИсточника();
	
	ЗаполнитьСвойстваИсточникаНаСервере();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПредставлениеТаблицыВнешнегоИсточника()
	
	Элемент = Элементы.ИмяТаблицыВнешнегоИсточника.СписокВыбора.НайтиПоЗначению(Объект.ИмяТаблицыВнешнегоИсточника);
	
	Возврат ?(Элемент = Неопределено, Объект.ИмяТаблицыВнешнегоИсточника, Элемент.Представление);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокТаблицВнешнихИсточников(СписокВыбора)
	
	СписокВыбора.Очистить();
	
	Для каждого ВнешнийИсточник Из Метаданные.ВнешниеИсточникиДанных Цикл
		
		ПредставлениеИсточника = ВнешнийИсточник.Представление();
		
		Для каждого Таблица Из ВнешнийИсточник.Таблицы Цикл
			СписокВыбора.Добавить(Таблица.ПолноеИмя(),
				СтрШаблон("(%1) %2", ПредставлениеИсточника, Таблица.Представление()));
		КонецЦикла;
		
	КонецЦикла;
	
	СписокВыбора.СортироватьПоПредставлению();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокТиповСсылки(СписокВыбора)
	
	СписокВыбора.Очистить();
	
	Для каждого ОбъектМетаданных Из Метаданные.Справочники Цикл
		СписокВыбора.Добавить(ОбъектМетаданных.ПолноеИмя());
	КонецЦикла;
	
	Для каждого ОбъектМетаданных Из Метаданные.Документы Цикл
		СписокВыбора.Добавить(ОбъектМетаданных.ПолноеИмя());
	КонецЦикла;
	
	Для каждого ОбъектМетаданных Из Метаданные.Перечисления Цикл
		СписокВыбора.Добавить(ОбъектМетаданных.ПолноеИмя());
	КонецЦикла;
	
	Для каждого ОбъектМетаданных Из Метаданные.ПланыВидовХарактеристик Цикл
		СписокВыбора.Добавить(ОбъектМетаданных.ПолноеИмя());
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваИсточникаНаСервере()
	
	ТипыСсылок = Новый Соответствие;
	
	Для каждого СтрокаТаблицы Из Объект.Свойства Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ТипСсылки) Тогда
			ТипыСсылок.Вставить(СтрокаТаблицы.Имя, СтрокаТаблицы.ТипСсылки);
		КонецЕсли;
		
	КонецЦикла;
	
	Объект.Свойства.Очистить();
	
	Если Объект.ТипИсточника = Перечисления.ТБ_ТипыИсточниковДанных.ВнешнийИсточник Тогда
		
		ЗаполнитьСвойстваТаблицыВнешнегоИсточника();
		
	ИначеЕсли Объект.ТипИсточника = Перечисления.ТБ_ТипыИсточниковДанных.COM1C Тогда
		
		ЗаполнитьСвойстваТаблицыCOMСоединения();
		
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из Объект.Свойства Цикл
		
		Если ТипыСсылок[СтрокаТаблицы.Имя] <> Неопределено Тогда
			СтрокаТаблицы.ТипСсылки = ТипыСсылок[СтрокаТаблицы.Имя];
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваТаблицыВнешнегоИсточника()
	
	ТаблицаИсточника = Метаданные.НайтиПоПолномуИмени(Объект.ИмяТаблицыВнешнегоИсточника);
	Если ТаблицаИсточника <> Неопределено Тогда
		
		Для каждого Поле Из ТаблицаИсточника.Поля Цикл
			
			Типы = Поле.Тип.Типы();
			Если Типы.Количество() = 1 Тогда
				
				ТипПоля = Типы[0];
				Если ТипПоля = Тип("Число")
					Или ТипПоля = Тип("Строка")
					Или ТипПоля = Тип("Дата")
					Или ТипПоля = Тип("Булево") Тогда
					
					НоваяСтрока = Объект.Свойства.Добавить();
					НоваяСтрока.Имя           = Поле.Имя;
					НоваяСтрока.Представление = Поле.Представление();
					НоваяСтрока.Тип           = Строка(ТипПоля);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваТаблицыCOMСоединения()
	
	Если Не ЗначениеЗаполнено(Объект.ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	Соединение = ТБ_СопоставлениеОбъектовПовтИсп.COMСоединение(Объект.НастройкаПодключения);
	Если Соединение = Неопределено Тогда
		
		ТекстСообщения = НСтр("ru = 'При подключении к источнику возникли ошибки (см. Журнал регистрации).'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	СловаЗапроса = СтрРазделить(Объект.ТекстЗапроса, " ", Ложь);
	Если ВРег(СловаЗапроса[0]) = "ВЫБРАТЬ" Тогда
		
		Если ВРег(СловаЗапроса[1]) = "ПЕРВЫЕ" Тогда
			СловаЗапроса[2] = "1"
		Иначе
			
			СловаЗапроса.Вставить(1, "ПЕРВЫЕ");
			СловаЗапроса.Вставить(2, "1");
			
		КонецЕсли;
		
		ТекстЗапроса = СтрСоединить(СловаЗапроса, " ");
		
	Иначе
		ТекстЗапроса = Объект.ТекстЗапроса;
	КонецЕсли;
	
	Запрос = Соединение.NewObject("Запрос");
	Запрос.Текст = ТекстЗапроса;
	
	Если ЗначениеЗаполнено(Объект.ПараметрыЗапроса) Тогда
		
		ПараметрыЗапроса = Соединение.NewObject("Структура");
		
		Соединение.ОбщегоНазначения.ВыполнитьВБезопасномРежиме(Объект.ПараметрыЗапроса, ПараметрыЗапроса);
		
		Для каждого Элемент Из ПараметрыЗапроса Цикл
			Запрос.Параметры.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	Если Объект.ИспользуетсяПланОбмена Тогда
		
		ТаблицаИзменений = Соединение.ПланыОбмена.ТБ_ОбменСопоставлениеОбъектов.ТаблицаИзменений(
			Объект.ИмяОбъектаПланаОбмена);
		
		Запрос.Параметры.Вставить("ТаблицаИзменений", ТаблицаИзменений);
		
	КонецЕсли;
	
	Для Каждого Поле Из Запрос.Выполнить().Колонки Цикл
		
		Типы = Поле.ТипЗначения.Типы();
		ТипПоля = ТипЗнч(Поле.ТипЗначения.ПривестиЗначение(0));
		
		Если ТипПоля = Тип("Неопределено") Тогда
			КоличествоТипов = Типы.Count();
			ИндексТипа = Неопределено;
			Если КоличествоТипов = 1 Тогда
				ИндексТипа = 0;
			ИначеЕсли КоличествоТипов = 2 Тогда
				TypeName0 = НРег(Соединение.XMLТип(Типы.Get(0)).TypeName);
				TypeName1 = НРег(Соединение.XMLТип(Типы.Get(1)).TypeName);
				Если TypeName1 = "null" Тогда
					ИндексТипа = 0;
				ИначеЕсли TypeName0 = "null" Тогда
					ИндексТипа = 1;
				КонецЕсли;
			КонецЕсли;
			Если ИндексТипа <> Неопределено Тогда
				TypeName = НРег(Соединение.XMLТип(Типы.Get(ИндексТипа)).TypeName);
				Если TypeName = "decimal" Тогда
					ТипПоля = Тип("Число");
				ИначеЕсли TypeName = "string" Тогда
					ТипПоля = Тип("Строка");
				ИначеЕсли TypeName = "datetime" Тогда
					ТипПоля = Тип("Дата");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипПоля = Тип("Число")
			Или ТипПоля = Тип("Строка")
			Или ТипПоля = Тип("Дата")
			Или ТипПоля = Тип("Булево") Тогда
			
			НоваяСтрока = Объект.Свойства.Добавить();
			НоваяСтрока.Имя           = Поле.Имя;
			НоваяСтрока.Представление = Поле.Имя;
			НоваяСтрока.Тип           = ТипПоля;
			
		Иначе
			
			НоваяСтрока = Объект.Свойства.Добавить();
			НоваяСтрока.Имя           = Поле.Имя;
			НоваяСтрока.Представление = Поле.Имя;
			НоваяСтрока.Тип           = "Строка";
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИдентификаторДляФормул(Знач Представление)
	
	Возврат ТБ_СопоставлениеОбъектов.ИдентификаторДляФормул(Представление);
	
КонецФункции

#КонецОбласти
