
#Область СлужебныеПроцедурыИФункции

&После("ПриСозданииНаСервере")
Процедура ТБ_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	
	Если ТБ_ЗагрузкаОбъектов.РазрешенаЗагрузкаОбъектов() Тогда
		
		// Команда "Загрузить объект" в форме объекта.
		ТБ_ДобавитьКомандуЗагрузитьОбъект(Форма);
		
		// Команда "Загрузить объекты" в форме списка (журнала).
		ТБ_ДобавитьКомандуЗагрузитьОбъекты(Форма);
		
		// Поле "Загружен из источника" в списке.
		ТБ_ДобавитьПолеЗагруженИзИсточника(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ТБ_ДобавитьКомандуЗагрузитьОбъект(Форма)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиЗагрузкиОбъектов.Ссылка КАК НастройкаЗагрузки,
	|	НастройкиЗагрузкиОбъектов.ИмяОбъекта КАК ИмяОбъекта
	|ИЗ
	|	Справочник.ТБ_НастройкиЗагрузкиОбъектов КАК НастройкиЗагрузкиОбъектов
	|ГДЕ
	|	НЕ НастройкиЗагрузкиОбъектов.ЭтоГруппа");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОсновнаяФормаОбъекта = Метаданные.НайтиПоПолномуИмени(Выборка.ИмяОбъекта).ОсновнаяФормаОбъекта;
		Если ОсновнаяФормаОбъекта <> Неопределено Тогда
			
			ИмяФормыОбъекта = ОсновнаяФормаОбъекта.ПолноеИмя();
			
			Если Форма.ИмяФормы = ИмяФормыОбъекта
				И Форма.Элементы.Найти("ТБ_ЗагрузитьОбъект") = Неопределено Тогда
				
				Группа = ТБ_ГруппаДляКомандыЗагрузитьОбъект(Форма.Элементы);
				Если Группа <> Неопределено Тогда
					
					НоваяКоманда = ТБ_СопоставлениеОбъектов.ДобавитьКоманду(
						Форма.Команды, "ТБ_ЗагрузитьОбъект", НСтр("ru = 'Загрузить'"), "Подключаемый_ВыполнитьПереопределяемуюКоманду");
					НоваяКоманда.Картинка = БиблиотекаКартинок.ТБ_ОбъектСопоставлен;
					НоваяКоманда.Подсказка = НСтр("ru = 'Загрузить объект из источника'");
					НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
					
					ТБ_СопоставлениеОбъектов.ДобавитьКнопкуФормы(
						Форма.Элементы, "ТБ_ЗагрузитьОбъект", , "ТБ_ЗагрузитьОбъект",
						Группа);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТБ_ГруппаДляКомандыЗагрузитьОбъект(Элементы)
	
	Результат = Элементы.Найти("ФормаГлобальныеКоманды");
	
	Если Результат = Неопределено Тогда
		Результат = Элементы.Найти("ФормаГруппаКомандыФормы");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ТБ_ДобавитьКомандуЗагрузитьОбъекты(Форма)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НастройкиЗагрузкиОбъектов.ИмяФормыСписка КАК ИмяФормыСписка
	|ИЗ
	|	Справочник.ТБ_НастройкиЗагрузкиОбъектов КАК НастройкиЗагрузкиОбъектов
	|ГДЕ
	|	НастройкиЗагрузкиОбъектов.ИмяФормыСписка = &ИмяФормыСписка");
	
	Запрос.УстановитьПараметр("ИмяФормыСписка", Форма.ИмяФормы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Группа = ТБ_ГруппаДляКомандыЗагрузитьОбъекты(Форма.Элементы);
		Если Группа <> Неопределено Тогда
			
			НоваяКоманда = ТБ_СопоставлениеОбъектов.ДобавитьКоманду(
				Форма.Команды, "ТБ_ЗагрузитьОбъекты", НСтр("ru = 'Загрузить'"), "Подключаемый_ВыполнитьПереопределяемуюКоманду");
			НоваяКоманда.Картинка = БиблиотекаКартинок.ТБ_ОбъектСопоставлен;
			НоваяКоманда.Подсказка = НСтр("ru = 'Загрузить объекты из источника'");
			НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
			
			ТБ_СопоставлениеОбъектов.ДобавитьКнопкуФормы(
				Форма.Элементы, "ТБ_ЗагрузитьОбъекты", , "ТБ_ЗагрузитьОбъекты",
				Группа);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТБ_ГруппаДляКомандыЗагрузитьОбъекты(Элементы)
	
	Результат = Элементы.Найти("ГруппаГлобальныеКоманды");
	
	Если Результат = Неопределено Тогда
		Результат = Элементы.Найти("ГруппаПользовательскихНастроек");
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Результат = Элементы.Найти("КоманднаяПанельФормы");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ТБ_ДобавитьПолеЗагруженИзИсточника(Форма)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НастройкиЗагрузкиОбъектов.ИмяФормыСписка КАК ИмяФормыСписка
	|ИЗ
	|	Справочник.ТБ_НастройкиЗагрузкиОбъектов КАК НастройкиЗагрузкиОбъектов
	|ГДЕ
	|	НастройкиЗагрузкиОбъектов.ИмяФормыСписка = &ИмяФормыСписка");
	
	Запрос.УстановитьПараметр("ИмяФормыСписка", Форма.ИмяФормы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Если Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаСпискаДокументов" Тогда
			
			СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
			ЗаполнитьЗначенияСвойств(СвойстваСписка, Форма.Список);
			
			ТБ_ДоработатьЗапросДинамическогоСпискаЖурналаДокументов(СвойстваСписка.ТекстЗапроса, "ДокументЗаказКлиента");
			
			ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Форма.Элементы.Список, СвойстваСписка);
			
			ТБ_ДобавитьЭлементЗагруженИзИсточника(Форма.Элементы, "Список", "СписокНомер");
			
		ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказПоставщику.Форма.ФормаСпискаДокументов" Тогда
			
			СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
			ЗаполнитьЗначенияСвойств(СвойстваСписка, Форма.Список);
			
			ТБ_ДоработатьЗапросДинамическогоСпискаЖурналаДокументов(СвойстваСписка.ТекстЗапроса, "ДокументЗаказПоставщику");
			
			ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Форма.Элементы.Список, СвойстваСписка);
			
			ТБ_ДобавитьЭлементЗагруженИзИсточника(Форма.Элементы, "Список", "СписокНомер");
			
		ИначеЕсли Форма.ИмяФормы = "Документ.ОперацияПоПлатежнойКарте.Форма.ФормаСпискаДокументов" Тогда
			
			СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
			ЗаполнитьЗначенияСвойств(СвойстваСписка, Форма.Список);
			
			ТБ_ДоработатьЗапросДинамическогоСпискаЖурналаДокументов(СвойстваСписка.ТекстЗапроса, "РеестрДокументов");
			
			ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Форма.Элементы.Список, СвойстваСписка);
			
			ТБ_ДобавитьЭлементЗагруженИзИсточника(Форма.Элементы, "Список", "Номер");
			
		ИначеЕсли Форма.ИмяФормы = "Документ.ОтчетОРозничныхПродажах.Форма.ФормаСписка" Тогда
			
			//СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
			//ЗаполнитьЗначенияСвойств(СвойстваСписка, Форма.ОтчетыОРозничныхПродажах);
			//
			//ТБ_ДоработатьЗапросДинамическогоСпискаЖурналаДокументов(СвойстваСписка.ТекстЗапроса, "ДокументОтчетыОРозничныхПродажах");
			//
			//ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Форма.Элементы.ОтчетыОРозничныхПродажах, СвойстваСписка);
			//
			//ТБ_ДобавитьЭлементЗагруженИзИсточника(Форма.Элементы, "ОтчетыОРозничныхПродажах", "Номер");
			
		ИначеЕсли Форма.ИмяФормы = "Документ.ПриходныйКассовыйОрдер.Форма.ФормаСпискаДокументов" Тогда
			
			СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
			ЗаполнитьЗначенияСвойств(СвойстваСписка, Форма.ПриходныеКассовыеОрдера);
			
			ТБ_ДоработатьЗапросДинамическогоСпискаЖурналаДокументов(СвойстваСписка.ТекстЗапроса, "РеестрДокументов");
			
			ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Форма.Элементы.ПриходныеКассовыеОрдера, СвойстваСписка);
			
			ТБ_ДобавитьЭлементЗагруженИзИсточника(Форма.Элементы, "ПриходныеКассовыеОрдера", "Номер");
			
		ИначеЕсли Форма.ИмяФормы = "Документ.РасходныйКассовыйОрдер.Форма.ФормаСпискаДокументов" Тогда
			
			СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
			ЗаполнитьЗначенияСвойств(СвойстваСписка, Форма.РасходныеКассовыеОрдера);
			
			ТБ_ДоработатьЗапросДинамическогоСпискаЖурналаДокументов(СвойстваСписка.ТекстЗапроса, "РеестрДокументов");
			
			ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Форма.Элементы.РасходныеКассовыеОрдера, СвойстваСписка);
			
			ТБ_ДобавитьЭлементЗагруженИзИсточника(Форма.Элементы, "РасходныеКассовыеОрдера", "РасходныеКассовыеОрдераНомер");
			
		ИначеЕсли Форма.ИмяФормы = "ЖурналДокументов.СкладскиеОрдера.Форма.ФормаСписка" Тогда
			
			//СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
			//ЗаполнитьЗначенияСвойств(СвойстваСписка, Форма.ЖурналОрдеров);
			//
			//ТБ_ДоработатьЗапросДинамическогоСпискаЖурналаДокументов(СвойстваСписка.ТекстЗапроса, "ЖурналДокументовСкладскиеОрдера");
			//
			//ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Форма.Элементы.ЖурналОрдеров, СвойстваСписка);
			//
			//ТБ_ДобавитьЭлементЗагруженИзИсточника(Форма.Элементы, "ЖурналОрдеров", "ЖурналОрдеровНомер");
			
		ИначеЕсли Форма.ИмяФормы = "Обработка.ЖурналДокументовБезналичныеПлатежи.Форма.ФормаСписка" Тогда
			
			СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
			ЗаполнитьЗначенияСвойств(СвойстваСписка, Форма.СписокПлатежей);
			
			ТБ_ДоработатьЗапросДинамическогоСпискаЖурналаДокументов(СвойстваСписка.ТекстЗапроса, "РеестрДокументов");
			
			ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Форма.Элементы.СписокПлатежей, СвойстваСписка);
			
			ТБ_ДобавитьЭлементЗагруженИзИсточника(Форма.Элементы, "СписокПлатежей", "СписокПлатежейНомер");
			
		ИначеЕсли Форма.ИмяФормы = "Обработка.ЖурналДокументовВнутреннегоТовародвижения.Форма.СписокДокументов" Тогда
			
			СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
			ЗаполнитьЗначенияСвойств(СвойстваСписка, Форма.СписокДокументыВнутреннегоТовародвижения);
			
			ТБ_ДоработатьЗапросДинамическогоСпискаЖурналаДокументов(СвойстваСписка.ТекстЗапроса, "РеестрДокументовПереопределяемый");
			
			ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Форма.Элементы.СписокДокументыВнутреннегоТовародвижения, СвойстваСписка);
			
			ТБ_ДобавитьЭлементЗагруженИзИсточника(Форма.Элементы, "СписокДокументыВнутреннегоТовародвижения", "СписокДокументыВнутреннегоТовародвиженияНомер");
			
		ИначеЕсли Форма.ИмяФормы = "Обработка.ЖурналДокументовЗакупки.Форма.СписокДокументов" Тогда
			
			ТБ_ДобавитьЭлементЗагруженИзИсточника(Форма.Элементы, "СписокДокументыЗакупки", "СписокДокументыЗакупкиНомер");
			
		ИначеЕсли Форма.ИмяФормы = "Обработка.ЖурналДокументовОтчетыКомиссионеров.Форма.СписокДокументов" Тогда
			
			СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
			ЗаполнитьЗначенияСвойств(СвойстваСписка, Форма.Список);
			
			ТБ_ДоработатьЗапросДинамическогоСпискаЖурналаДокументов(СвойстваСписка.ТекстЗапроса, "РеестрДокументовПереопределяемый");
			
			ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Форма.Элементы.Список, СвойстваСписка);
			
			ТБ_ДобавитьЭлементЗагруженИзИсточника(Форма.Элементы, "Список", "Номер");
			
		ИначеЕсли Форма.ИмяФормы = "Обработка.ЖурналДокументовОтчетыКомитентам.Форма.СписокДокументов" Тогда
			
			СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
			ЗаполнитьЗначенияСвойств(СвойстваСписка, Форма.Список);
			
			ТБ_ДоработатьЗапросДинамическогоСпискаЖурналаДокументов(СвойстваСписка.ТекстЗапроса, "РеестрДокументовПереопределяемый");
			
			ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Форма.Элементы.Список, СвойстваСписка);
			
			ТБ_ДобавитьЭлементЗагруженИзИсточника(Форма.Элементы, "Список", "Номер");
			
		ИначеЕсли Форма.ИмяФормы = "Обработка.ЖурналДокументовПродажи.Форма.СписокДокументов" Тогда
			
			ТБ_ДобавитьЭлементЗагруженИзИсточника(Форма.Элементы, "СписокДокументыПродажи", "СписокДокументыПродажиНомер");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ТБ_ДоработатьЗапросДинамическогоСпискаЖурналаДокументов(ТекстЗапроса, ИмяОсновнойТаблицы) Экспорт
	
	ЗаменяемаяСтрока = ИмяОсновнойТаблицы + ".Ссылка,";
	
	Если СтрНайти(ТекстЗапроса, ЗаменяемаяСтрока) = 0 Тогда
		ЗаменяемаяСтрока = ИмяОсновнойТаблицы + ".Ссылка КАК Ссылка,";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		ЗаменяемаяСтрока,
		ЗаменяемаяСтрока + "
		|	-1 КАК ТБ_Загружен,");
	
КонецПроцедуры

Процедура ТБ_ДобавитьЭлементЗагруженИзИсточника(Элементы, Знач ИмяСписка, Знач ИмяЭлемента)
	
	НовыйЭлемент = ТБ_СопоставлениеОбъектов.ДобавитьПолеФормы(
		Элементы, ИмяСписка + "ТБ_Загружен", НСтр("ru = 'Загружен'"), ИмяСписка + ".ТБ_Загружен",
		Элементы[ИмяСписка], Элементы[ИмяЭлемента], ВидПоляФормы.ПолеКартинки);
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.КартинкаЗначений = БиблиотекаКартинок.ТБ_ОбъектСопоставлен;
	НовыйЭлемент.Подсказка = НСтр("ru = 'Загружен из источника'");
	НовыйЭлемент.КартинкаШапки = БиблиотекаКартинок.ТБ_ОбъектСопоставлен;
	
КонецПроцедуры

#КонецОбласти
