
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	УстановитьДоступностьПоТипуИсточника();
	
	Объект.ТипПравила = Перечисления.ТБ_ТипыПравилСопоставления.СопоставлениеОбъектов;
	УстановитьДоступностьПоТипуПравила();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	ЗначениеНастройки = Настройки.Получить("Объект.ИсточникДанных");
	Если ЗначениеНастройки <> Неопределено Тогда
		
		Объект.ИсточникДанных = ЗначениеНастройки;
		ИсточникДанныхПриИзмененииНаСервере();
		
		Настройки.Удалить("Объект.ИсточникДанных");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_СоответствияОбъектов"
		Или ИмяСобытия = "Удаление_СоответствияОбъектов" Тогда
		ЗаполнитьСлужебныеРеквизиты();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаСоответствияОбъектов
		И ДанныеИсточникаИзменены Тогда
		ЗаполнитьСоответствияОбъектов(Объект.ПравилоСопоставления, Объект.ИсточникДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхПриИзменении(Элемент)
	
	Если Объект.ИсточникДанных <> ТекущийИсточникДанных
		И ТаблицаИсточникаДанных.Количество() <> 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ИсточникДанныхПриИзмененииЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'При изменении источника таблица данных будет очищена. Продолжить?'");
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	ИсточникДанныхПриИзмененииНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ТипПравилаПриИзменении(Элемент)
	
	ТипПравилаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилоСопоставленияПриИзменении(Элемент)
	
	ПравилаСопоставленияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаСоответствияОбъектовОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("РегистрСведений.ТБ_СоответствияОбъектов.Форма.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаИсточникаДанных

&НаКлиенте
Процедура ТаблицаИсточникаДанныхПриИзменении(Элемент)
	
	УстановитьДанныеИсточникаИзменены();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИсточникаДанныхПослеУдаления(Элемент)
	
	УстановитьДанныеИсточникаИзменены();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоответствияОбъектов

&НаКлиенте
Процедура СоответствияОбъектовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//Если Поле = Элементы.СоответствияОбъектовОбъект Тогда
	//	
	//	СтандартнаяОбработка = Ложь;
	//	ПоказатьЗначение(, Элемент.ТекущиеДанные.Объект);
	//	
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИзмененныеОбъекты

&НаКлиенте
Процедура ИзмененныеОбъектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ИзмененныеОбъектыСсылка Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ИсточникДанных

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайла(Команда)
	
	ПараметрыФормы = Новый Структура("АдресСвойствВХранилище", ПоместитьСвойстваОбъектаДанныхВХранилище());
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзВнешнегоФайлаЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.ТБ_СопоставлениеОбъектов.Форма.ЗагрузкаИзТабличногоДокумента",
		ПараметрыФормы, ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоИсточника(Команда)
	
	ЗагрузитьИзВнешнегоИсточникаНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВXML(Команда)
	
	Если ТаблицаИсточникаДанных.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Нет данных для выгрузки.'"));
		Возврат;
		
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВыгрузитьВXMLЗавершение", ЭтотОбъект);
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла.Фильтр = НСтр("ru = 'Файлы XML (*.xml)|*.xml'");
	ДиалогОткрытияФайла.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзXML(Команда)
	
	Если ТаблицаИсточникаДанных.Количество() <> 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВыгрузитьВXMLВопрос", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Очистить таблицу данных источника перед загрузкой?'");
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
		
	КонецЕсли;
	
	ЗагрузитьИзXMLНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область Сопоставление

&НаКлиенте
Процедура ОбновитьСоответствияОбъектов(Команда)
	
	ОбновитьСоответствияОбъектовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсеСоответствияОбъектов(Команда)
	
	ТБ_СопоставлениеОбъектовКлиент.УстановитьПометки(
		СоответствияОбъектов,
		Элементы.СоответствияОбъектов,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьВсеСоответствияОбъектов(Команда)
	
	ТБ_СопоставлениеОбъектовКлиент.УстановитьПометки(
		СоответствияОбъектов,
		Элементы.СоответствияОбъектов,
		Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиДублиПоПолямПоиска(Команда)
	
	НайтиДублиПоПолямПоискаНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДублиПоПолямПоиска(Команда)
	
	ПоказатьДублиПоПолямПоиска = Не ПоказатьДублиПоПолямПоиска;
	Элементы.ПоказатьДублиПоПолямПоиска.Пометка = ПоказатьДублиПоПолямПоиска;
	
	ОбновитьОтборСтрокТаблицыСопоставления();
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьОбъекты(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = СоответствияОбъектов.НайтиСтроки(Новый Структура("Пометка", Истина));
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны строки для сопоставления.'"));
		Возврат;
		
	КонецЕсли;
	
	Для каждого СтрокаСоответствия Из НайденныеСтроки Цикл
		
		СтрокаСоответствия.Объект       = Неопределено;
		СтрокаСоответствия.Сопоставлено = Ложь;
		
	КонецЦикла;
	
	Если Объект.ТипПравила = ПредопределенноеЗначение("Перечисление.ТБ_ТипыПравилСопоставления.СопоставлениеОбъектов") Тогда
		КоличествоЗаписей = СопоставитьОбъектыНаСервере();
	Иначе
		КоличествоЗаписей = СопоставитьОбъектыДляЗагрузкиТЧНаСервере();
	КонецЕсли;
	
	//ОповеститьОбИзменении(ТипЗнч()); // доделать
	
	ОбновитьОтборСтрокТаблицыСопоставления();
	
	ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru = 'Сопоставление завершено (%1)'"), КоличествоЗаписей),
		,
		НСтр("ru = 'Сопоставление объектов завершено.'"),
		БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоНесопоставленные(Команда)
	
	ПоказатьТолькоНесопоставленные = Не ПоказатьТолькоНесопоставленные;
	Элементы.ПоказатьТолькоНесопоставленные.Пометка = ПоказатьТолькоНесопоставленные;
	
	ОбновитьОтборСтрокТаблицыСопоставления();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСопоставленныеОбъекты(Команда)
	
	Отказ = Ложь;
	КоличествоЗаписей = СохранитьСопоставленныеОбъектыНаСервере(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если КоличествоЗаписей = 0 Тогда
		
		ПоказатьОповещениеПользователя(НСтр("ru = 'Соответствие не сохранено'"),
			,
			НСтр("ru = 'Нет сопоставленных объектов.'"),
			БиблиотекаКартинок.Информация32);
		
	Иначе
		
		ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru = 'Соответствие сохранено (%1)'"), КоличествоЗаписей),
			,
			НСтр("ru = 'Соответствие сопоставленных объектов записано.'"),
			БиблиотекаКартинок.Информация32);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТабличнуюЧасть(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = СоответствияОбъектов.НайтиСтроки(Новый Структура("Пометка", Истина));
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны строки для сопоставления.'"));
		Возврат;
		
	КонецЕсли;
	
	Для каждого СтрокаСоответствия Из НайденныеСтроки Цикл
		
		СтрокаСоответствия.Объект       = Неопределено;
		СтрокаСоответствия.Сопоставлено = Ложь;
		
	КонецЦикла;
	
	КоличествоЗаписей = СопоставитьОбъектыДляЗагрузкиТЧНаСервере(Истина);
	
	ОбновитьОтборСтрокТаблицыСопоставления();
	
	ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru = 'Загрузка завершена (%1)'"), КоличествоЗаписей),
		,
		НСтр("ru = 'Загрузка табличной части завершена.'"),
		БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСопоставление(Команда)
	
	ТекущиеДанные = Элементы.СоответствияОбъектов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЕстьЗапись Тогда
		
		ПараметрыФормы = Новый Структура("Ключ", КлючЗаписиСоответствия(ТекущиеДанные.Идентификатор, ТекущиеДанные.ИмяОбъекта));
		
		ОткрытьФорму("РегистрСведений.ТБ_СоответствияОбъектов.Форма.ФормаЗаписи", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура УдалитьИзмененныеОбъекты(Команда)
	
	ОчиститьСообщения();
	
	КоличествоЗаписей = УдалитьИзмененныеОбъектыНаСервере();
	
	Если КоличествоЗаписей = 0 Тогда
		
		ПоказатьОповещениеПользователя(НСтр("ru = 'Объекты не удалены'"),
			,
			НСтр("ru = 'Нет объектов для удаления.'"),
			БиблиотекаКартинок.Информация32);
		
	Иначе
		
		ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru = 'Объекты удалены (%1)'"), КоличествоЗаписей),
			,
			НСтр("ru = 'Созданные объекты удалены.'"),
			БиблиотекаКартинок.Информация32);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИсточникДанныхПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ИсточникДанныхПриИзмененииНаКлиенте();
	Иначе
		Объект.ИсточникДанных = ТекущийИсточникДанных;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайлаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Строка") И ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		
		КоличествоЗаписей = ЗагрузитьИзВнешнегоФайлаНаСервере(РезультатЗакрытия);
		
		ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru = 'Данные источника загружены (%1)'"), КоличествоЗаписей),
			,
			НСтр("ru = 'Загрузка данных источника завершена.'"),
			БиблиотекаКартинок.Информация32);
		
		УстановитьДанныеИсточникаИзменены();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВXMLЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		КоличествоЗаписей = ВыгрузитьВXMLНаСервере(ВыбранныеФайлы[0]);
		
		ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru = 'Данные источника выгружены (%1)'"), КоличествоЗаписей),
			,
			НСтр("ru = 'Выгрузка данных источника завершена.'"),
			БиблиотекаКартинок.Информация32);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьВXMLНаСервере(ПутьКФайлу)
	
	ДанныеДляВыгрузки = МассивДанныхИсточника();
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ПутьКФайлу);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Соответствие");
	
	Для каждого ДанныеСтроки Из ДанныеДляВыгрузки Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Строка");
		
		Для каждого КлючИЗначение Из ДанныеСтроки Цикл
			
			ЗаписьXML.ЗаписатьНачалоЭлемента(КлючИЗначение.Ключ);
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(КлючИЗначение.Значение));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть();
	
	Возврат ДанныеДляВыгрузки.Количество();
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВXMLВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ТаблицаИсточникаДанных.Очистить();
		Элементы.ТаблицаИсточникаДанных.Обновить();
		
		ЗагрузитьИзXMLНаКлиенте();
		
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		ЗагрузитьИзXMLНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзXMLНаКлиенте()
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзXMLЗавершение", ЭтотОбъект);
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Фильтр = НСтр("ru = 'Файлы XML (*.xml)|*.xml'");
	ДиалогОткрытияФайла.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзXMLЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		КоличествоЗаписей = ЗагрузитьИзXMLНаСервере(ВыбранныеФайлы[0]);
		
		ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru = 'Данные источника загружены (%1)'"), КоличествоЗаписей),
			,
			НСтр("ru = 'Загрузка данных источника завершена.'"),
			БиблиотекаКартинок.Информация32);
		
		УстановитьДанныеИсточникаИзменены();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьИзXMLНаСервере(ПутьКФайлу)
	
	ТипыПолейИсточника = Новый Соответствие;
	
	Для каждого СтрокаТаблицы Из СвойстваИсточникаДанных Цикл
		ТипыПолейИсточника.Вставить(СтрокаТаблицы.Имя, Тип(СтрокаТаблицы.Тип));
	КонецЦикла;
	
	КоличествоЗаписей = 0;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлу);
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если ЧтениеXML.ЛокальноеИмя = "Строка" Тогда
				
				НоваяСтрока = ТаблицаИсточникаДанных.Добавить();
				КоличествоЗаписей = КоличествоЗаписей + 1;
			ИначеЕсли ЧтениеXML.ЛокальноеИмя = "СоответствиеТипов" Тогда
				ЧтениеXML.Пропустить();
			Иначе
				ИмяКолонки = ЧтениеXML.ЛокальноеИмя;
			КонецЕсли;
			
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			
			ТипКолонки = ТипыПолейИсточника.Получить(ИмяКолонки);
			Если ТипКолонки <> Неопределено Тогда
				НоваяСтрока[ИмяКолонки] = XMLЗначение(ТипКолонки, ЧтениеXML.Значение);
			КонецЕсли;
			
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КоличествоЗаписей;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СоответствияОбъектовОбъект.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПравилоСопоставления");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СоответствияОбъектов.Объект");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Не найден>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТБ_ЦветТекстаНеНайден);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПоТипуИсточника()
	
	ТипИсточника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ИсточникДанных, "ТипИсточника");
	ЭтоВнешнийИсточник = ТипИсточника = Перечисления.ТБ_ТипыИсточниковДанных.ВнешнийИсточник
		Или ТипИсточника = Перечисления.ТБ_ТипыИсточниковДанных.COM1C;
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЗагрузитьИзВнешнегоФайла",
		"Видимость",
		Не ЭтоВнешнийИсточник);
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЗагрузитьИзВнешнегоИсточника",
		"Видимость",
		ЭтоВнешнийИсточник);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПоТипуПравила()
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("СоздаватьНовыеОбъекты");
	ИменаЭлементов.Добавить("ОбновлятьСуществующиеОбъекты");
	ИменаЭлементов.Добавить("СоздаватьНовыеЗначенияСвойств");
	ИменаЭлементов.Добавить("СохранитьСопоставленныеОбъекты");
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		ИменаЭлементов,
		"Видимость",
		Объект.ТипПравила = Перечисления.ТБ_ТипыПравилСопоставления.СопоставлениеОбъектов);
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ЗагрузитьТабличнуюЧасть");
	ИменаЭлементов.Добавить("ОчищатьТабличнуюЧасть");
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		ИменаЭлементов,
		"Видимость",
		Объект.ТипПравила = Перечисления.ТБ_ТипыПравилСопоставления.ЗагрузкаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборСтрокТаблицыСопоставления()
	
	ОтборСтрок = Новый Структура;
	
	Если ПоказатьДублиПоПолямПоиска Тогда
		ОтборСтрок.Вставить("ЕстьДубли", Истина);
	КонецЕсли;
	
	Если ПоказатьТолькоНесопоставленные Тогда
		ОтборСтрок.Вставить("Сопоставлено", Ложь);
	КонецЕсли;
	
	Элементы.СоответствияОбъектов.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	
КонецПроцедуры

#Область ПриИзмененииРеквизитов

&НаКлиенте
Процедура ИсточникДанныхПриИзмененииНаКлиенте()
	
	ИсточникДанныхПриИзмененииНаСервере();
	
	Если ЭтоВнешнийИсточник Тогда
		
		Оповещение = Новый ОписаниеОповещения("ИсточникДанныхПриИзмененииНаКлиентеЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Загрузить данные из внешнего источника?'");
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхПриИзмененииНаКлиентеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗагрузитьИзВнешнегоИсточникаНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИсточникДанныхПриИзмененииНаСервере()
	
	ПравилаСопоставленияПриИзмененииНаСервере();
	
	ТекущийИсточникДанных = Объект.ИсточникДанных;
	
	ТаблицаИсточникаДанных.Очистить();
	
	ТБ_СопоставлениеОбъектов.УдалитьРеквизитыВТаблице(
		ЭтотОбъект,
		"ТаблицаИсточникаДанных",
		СвойстваИсточникаДанных);
	
	ТБ_СопоставлениеОбъектов.ЗаполнитьСвойстваИсточникаДанных(
		СвойстваИсточникаДанных,
		Объект.ИсточникДанных,
		Истина);
	
	ТБ_СопоставлениеОбъектов.ДобавитьРеквизитыВТаблицу(
		ЭтотОбъект,
		"ТаблицаИсточникаДанных",
		СвойстваИсточникаДанных);
	
	УстановитьДоступностьПоТипуИсточника();
	
КонецПроцедуры

&НаСервере
Процедура ТипПравилаПриИзмененииНаСервере()
	
	ПравилаСопоставленияПриИзмененииНаСервере();
	
	СоздаватьНовыеЗначенияСвойств = Ложь;
	СоздаватьНовыеОбъекты         = Ложь;
	ОбновлятьСуществующиеОбъекты  = Ложь;
	ОчищатьТабличнуюЧасть         = Ложь;
	РежимРазработчика             = Ложь;
	
	УстановитьДоступностьПоТипуПравила();
	
КонецПроцедуры

&НаСервере
Процедура ПравилаСопоставленияПриИзмененииНаСервере()
	
	МетаданныеОбъекта = Неопределено;
	ОписаниеОшибок = ТБ_СопоставлениеОбъектов.НовоеОписаниеОшибок();
	
	СоответствияОбъектов.Очистить();
	Объект.ИзмененныеОбъекты.Очистить();
	ДанныеИсточникаИзменены = Истина;
	
	ТБ_СопоставлениеОбъектов.УдалитьРеквизитыВТаблице(
		ЭтотОбъект,
		"СоответствияОбъектов",
		СвойстваИсточника,
		ОписаниеОшибок);
	
	ПравилоДляЗаполнения  = Объект.ПравилоСопоставления;
	ИсточникДляЗаполнения = Объект.ИсточникДанных;
	
	ТБ_СопоставлениеОбъектов.ЗаполнитьСвойстваИсточникаДанныхПоПравилу(
		СвойстваИсточника,
		Объект.ПравилоСопоставления,
		Истина);
	
	ТБ_СопоставлениеОбъектов.ДобавитьРеквизитыВТаблицу(
		ЭтотОбъект,
		"СоответствияОбъектов",
		СвойстваИсточника,
		,
		ОписаниеОшибок);
	
	Если ЗначениеЗаполнено(ОписаниеОшибок) Тогда
		
		Для каждого ОписаниеОшибки Из ОписаниеОшибок Цикл
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки.ТекстОшибки);
		КонецЦикла;
		
		Объект.ПравилоСопоставления = Справочники.ТБ_ПравилаСопоставления.ПустаяСсылка();
		СвойстваИсточника.Очистить();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ПравилоСопоставления) Тогда
		
		ИмяОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПравилоСопоставления, "ИмяОбъекта");
		
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяОбъекта);
		
	КонецЕсли;
	
	ЗаполнитьСоответствияОбъектов(ПравилоДляЗаполнения, ИсточникДляЗаполнения);
	
	Если МетаданныеОбъекта <> Неопределено Тогда
		Элементы.СоответствияОбъектовОбъект.ОграничениеТипа = МетаданныеОбъекта.СтандартныеРеквизиты.Ссылка.Тип;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПравилоДляЗаполнения) Тогда
		УстановитьНадписьСозданияОбъектов(ПравилоДляЗаполнения);
	КонецЕсли;
	
	КонецПроцедуры

&НаСервере
Процедура УстановитьНадписьСозданияОбъектов(ПравилоДляЗаполнения)

	ТекСоздаватьГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПравилоСопоставления, "СоздаватьГруппы");
	Если ТекСоздаватьГруппы = Истина Тогда 
		НадписьЭлемента = "Создавать новые объекты (будут созданы группы)";
	Иначе 
		НадписьЭлемента = "Создавать новые объекты";
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоздаватьНовыеОбъекты", "Заголовок", НадписьЭлемента);
	
КонецПроцедуры 

#КонецОбласти

#Область ИсточникДанных

&НаСервере
Функция ПоместитьСвойстваОбъектаДанныхВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(СвойстваИсточникаДанных.Выгрузить(), Новый УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция ЗагрузитьИзВнешнегоФайлаНаСервере(Знач АдресДанныхВХранилище)
	
	ТаблицаИсточникаДанных.Очистить();
	
	ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресДанныхВХранилище);
	Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаИсточникаДанных.Добавить(), СтрокаТаблицы);
	КонецЦикла;
	
	Возврат ТаблицаИсточникаДанных.Количество();
	
КонецФункции

#Область ЗагрузкаИзВнешнегоИсточника

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоИсточникаНаКлиенте()
	
	ТаблицаИсточникаДанных.Очистить();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Выполняется получение списка объектов'");
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		НачатьЗагрузкуИзВнешнегоИсточника(),
		Новый ОписаниеОповещения("ЗагрузитьИзВнешнегоИсточникаЗавершение", ЭтотОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоИсточникаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	КоличествоЗаписей = ПолучитьТаблицуИсточника(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru = 'Данные источника загружены (%1)'"), КоличествоЗаписей),
		,
		НСтр("ru = 'Загрузка данных источника завершена.'"),
		БиблиотекаКартинок.Информация32);
	
	УстановитьДанныеИсточникаИзменены();
	
КонецПроцедуры

&НаСервере
Функция НачатьЗагрузкуИзВнешнегоИсточника()
	
	ТаблицаИсточника = РеквизитФормыВЗначение("ТаблицаИсточникаДанных");
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "ТБ_СопоставлениеОбъектов.ЗагрузитьИзВнешнегоИсточника",
		ТаблицаИсточника, Объект.ИсточникДанных, Неопределено, Неопределено, Ложь);
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуИсточника(Знач АдресРезультата)
	
	ТаблицаИсточника = ПолучитьИзВременногоХранилища(АдресРезультата);
	ЗначениеВРеквизитФормы(ТаблицаИсточника, "ТаблицаИсточникаДанных");
	
	Возврат ТаблицаИсточникаДанных.Количество();
	
КонецФункции

#КонецОбласти

&НаСервере
Функция МассивДанныхИсточника()
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаИсточникаДанных.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура УстановитьДанныеИсточникаИзменены()
	
	Если Не ДанныеИсточникаИзменены Тогда
		
		СоответствияОбъектов.Очистить();
		Объект.ИзмененныеОбъекты.Очистить();
		
		ДанныеИсточникаИзменены = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПравилаСопоставления

&НаСервере
Процедура ЗаполнитьСоответствияОбъектов(ПравилоДляЗаполнения, ИсточникДляЗаполнения)
	
	СоответствияОбъектов.Очистить();
	Объект.ИзмененныеОбъекты.Очистить();
	
	Если Не ЗначениеЗаполнено(ПравилоДляЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПравилоДляЗаполнения, "ИмяОбъекта");
	
	ИменаПолей = СвойстваИсточника.Выгрузить(, "Имя").ВыгрузитьКолонку("Имя");
	Колонки    = СтрСоединить(ИменаПолей, ",");
	
	ТаблицаИсточника = ТаблицаИсточникаДанных.Выгрузить(, Колонки);
	ТаблицаИсточника.Свернуть(Колонки);
	
	ТаблицаИсточника = ТБ_СопоставлениеОбъектов.ТаблицаИсточникаСОтборами(
		ТаблицаИсточника,
		СвойстваИсточника,
		ПравилоДляЗаполнения);
	
	Для каждого СтрокаТаблицы Из ТаблицаИсточника Цикл
		
		СтрокаСоответствия = СоответствияОбъектов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСоответствия, СтрокаТаблицы);
		
		Идентификатор   = ТБ_СопоставлениеОбъектов.ИдентификаторИсточника(СтрокаСоответствия, СвойстваИсточника);
		Представление   = ТБ_СопоставлениеОбъектов.ПредставлениеИсточника(СтрокаСоответствия, СвойстваИсточника);
		СтруктураДанных = ТБ_СопоставлениеОбъектов.СтруктураДанныхИсточника(СтрокаСоответствия, СвойстваИсточника);
		
		СтрокаСоответствия.Идентификатор        = Идентификатор;
		СтрокаСоответствия.ИмяОбъекта           = ИмяОбъекта;
		СтрокаСоответствия.Объект               = Неопределено;
		СтрокаСоответствия.ИсточникДанных       = ИсточникДляЗаполнения;
		СтрокаСоответствия.Представление        = Представление;
		СтрокаСоответствия.ДанныеИсточника      = ТБ_СопоставлениеОбъектов.СтрокаJSON(СтруктураДанных);
		СтрокаСоответствия.ПравилоСопоставления = ПравилоДляЗаполнения;
		СтрокаСоответствия.Сопоставлено         = Ложь;
		
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из СоответствияОбъектов Цикл
		
		СтрокаТаблицы.ЕстьДубли         = Ложь;
		СтрокаТаблицы.КартинкаЕстьДубли = -1;
		
	КонецЦикла;
	
	ЗаполнитьСлужебныеРеквизиты();
	
	СоответствияОбъектов.Сортировать("Идентификатор");
	
	ДанныеИсточникаИзменены = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизиты()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСоответствия.Идентификатор КАК Идентификатор,
	|	ТаблицаСоответствия.ИмяОбъекта КАК ИмяОбъекта
	|ПОМЕСТИТЬ ТаблицаСоответствия
	|ИЗ
	|	&ТаблицаСоответствия КАК ТаблицаСоответствия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Идентификатор,
	|	ИмяОбъекта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСоответствия.Идентификатор КАК Идентификатор,
	|	ТаблицаСоответствия.ИмяОбъекта КАК ИмяОбъекта,
	|	НЕ СоответствияОбъектов.Идентификатор ЕСТЬ NULL КАК ЕстьЗапись,
	|	ВЫБОР
	|		КОГДА СоответствияОбъектов.Идентификатор ЕСТЬ NULL
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИндексКартинкиЕстьЗапись
	|ИЗ
	|	ТаблицаСоответствия КАК ТаблицаСоответствия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТБ_СоответствияОбъектов КАК СоответствияОбъектов
	|		ПО ТаблицаСоответствия.Идентификатор = СоответствияОбъектов.Идентификатор
	|			И ТаблицаСоответствия.ИмяОбъекта = СоответствияОбъектов.ИмяОбъекта");
	
	ПоляИдентификатора = "Идентификатор,ИмяОбъекта";
	
	Запрос.УстановитьПараметр("ТаблицаСоответствия", СоответствияОбъектов.Выгрузить(, ПоляИдентификатора));
	
	ДанныеСоответствия = Запрос.Выполнить().Выгрузить();
	ДанныеСоответствия.Индексы.Добавить(ПоляИдентификатора);
	
	ПараметрыОтбора = Новый Структура(ПоляИдентификатора);
	
	Для каждого СтрокаТаблицы Из СоответствияОбъектов Цикл
		
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаТаблицы);
		
		НайденныеСтроки = ДанныеСоответствия.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, НайденныеСтроки[0]);
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.СоответствияОбъектов.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область Сопоставление

&НаСервере
Процедура ОбновитьСоответствияОбъектовНаСервере()
	
	ПравилаСопоставленияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Функция СопоставитьОбъектыНаСервере()
	
	КоличествоЗаписей = 0;
	
	//
	
	ИдентификаторСтроки = 0;
	
	Для каждого СтрокаСоответствия Из СоответствияОбъектов Цикл
		
		СтрокаСоответствия.ИдентификаторСтроки = ИдентификаторСтроки;
		ИдентификаторСтроки = ИдентификаторСтроки + 1;
		
	КонецЦикла;
	
	//
	
	ТаблицаИсточника = СоответствияОбъектов.Выгрузить(Новый Структура("Пометка", Истина));
	
	ПараметрыСопоставления = ТБ_СопоставлениеОбъектов.ПараметрыСопоставления(Объект.ПравилоСопоставления);
	ПараметрыСопоставления.СоздаватьНовыеЗначенияСвойств = СоздаватьНовыеЗначенияСвойств;
	ПараметрыСопоставления.СоздаватьНовыеОбъекты         = СоздаватьНовыеОбъекты;
	ПараметрыСопоставления.ОбновлятьСуществующиеОбъекты  = ОбновлятьСуществующиеОбъекты;
	ПараметрыСопоставления.РежимРазработчика             = РежимРазработчика;
	
	ТаблицаДанных = ТаблицаДанныхСоЗначениямиПолей(ТаблицаИсточника, ПараметрыСопоставления, СвойстваИсточника);
	
	Отказ = Ложь;
	
	ТБ_СопоставлениеОбъектов.НайтиСоздатьОбъекты(
		ТаблицаДанных,
		Объект.ПравилоСопоставления,
		ПараметрыСопоставления,
		Отказ);
	
	Если Не Отказ Тогда
		
		Для каждого СтрокаДанных Из ТаблицаДанных Цикл
			
			Если Не СтрокаДанных.Отказ
				И ЗначениеЗаполнено(СтрокаДанных.Объект) Тогда
				
				НайденныеСтроки = СоответствияОбъектов.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаДанных.ИдентификаторСтроки));
				Если НайденныеСтроки.Количество() <> 0 Тогда
					
					СтрокаСоответствия = НайденныеСтроки[0];
					СтрокаСоответствия.Объект       = СтрокаДанных.Объект;
					СтрокаСоответствия.Сопоставлено = Истина;
					
					КоличествоЗаписей = КоличествоЗаписей + 1;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для каждого ОписаниеОшибки Из ПараметрыСопоставления.ОписаниеОшибок Цикл
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки.ТекстОшибки);
	КонецЦикла;
	
	ЗагрузитьИзмененныеОбъекты(ПараметрыСопоставления);
	
	Возврат КоличествоЗаписей;
	
КонецФункции

&НаСервере
Функция СопоставитьОбъектыДляЗагрузкиТЧНаСервере(Знач ЗаписыватьОбъекты = Ложь)
	
	КоличествоЗаписей = 0;
	
	//
	
	ИдентификаторСтроки = 0;
	
	Для каждого СтрокаСоответствия Из СоответствияОбъектов Цикл
		
		СтрокаСоответствия.ИдентификаторСтроки = ИдентификаторСтроки;
		ИдентификаторСтроки = ИдентификаторСтроки + 1;
		
	КонецЦикла;
	
	//
	
	ПараметрыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ПравилоСопоставления,
	"ИмяОбъекта,ПредставлениеОбъекта,ИмяТабличнойЧасти,
	|ОбработчикПередОбработкой,ОбработчикПослеЗаполненияСтрокиТаблицы,ОбработчикПередЗаписью,ОбработчикПослеЗаписи");
	
	//
	
	ТаблицаИсточника = СоответствияОбъектов.Выгрузить(Новый Структура("Пометка", Истина));
	
	ПараметрыСопоставления = ТБ_СопоставлениеОбъектов.ПараметрыСопоставления(Объект.ПравилоСопоставления);
	ПараметрыСопоставления.ОчищатьТабличнуюЧасть = ОчищатьТабличнуюЧасть;
	ПараметрыСопоставления.РежимРазработчика     = РежимРазработчика;
	
	ТаблицаДанных = ТаблицаДанныхСоЗначениямиПолей(ТаблицаИсточника, ПараметрыСопоставления, СвойстваИсточника);
	
	ТаблицаОбъектов = ТаблицаДанных.Скопировать(Новый Структура("Отказ", Ложь), "Объект_Ссылка");
	ТаблицаОбъектов.Свернуть("Объект_Ссылка");
	
	Для каждого СтрокаТаблицы Из ТаблицаОбъектов Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Объект_Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Отказ = Ложь;
		
		НайденныеСтроки = ТаблицаДанных.НайтиСтроки(Новый Структура("Объект_Ссылка", СтрокаТаблицы.Объект_Ссылка));
		Для каждого СтрокаДанных Из НайденныеСтроки Цикл
			
			Если СтрокаДанных.Отказ Тогда
				Отказ = Истина;
			КонецЕсли;
			
			НайденныеСтроки_ = СоответствияОбъектов.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаДанных.ИдентификаторСтроки));
			Если НайденныеСтроки_.Количество() <> 0 Тогда
			
				СтрокаСоответствия = НайденныеСтроки_[0];
				СтрокаСоответствия.Объект       = СтрокаДанных.Объект_Ссылка;
				СтрокаСоответствия.Сопоставлено = Истина;
				
				КоличествоЗаписей = КоличествоЗаписей + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не Отказ
			И ЗаписыватьОбъекты Тогда
			
			СправочникОбъект = СтрокаТаблицы.Объект_Ссылка.ПолучитьОбъект();
			
			ТБ_СопоставлениеОбъектов.ВыполнитьКодОбработчикаПередОбработкойВПопытке(
				СправочникОбъект, ПараметрыОбъекта, ПараметрыСопоставления, Отказ);
			
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПараметрыСопоставления.ОчищатьТабличнуюЧасть Тогда
				СправочникОбъект[ПараметрыОбъекта.ИмяТабличнойЧасти].Очистить();
			КонецЕсли;
			
			Для каждого СтрокаДанных Из НайденныеСтроки Цикл
				
				НоваяСтрока = СправочникОбъект[ПараметрыОбъекта.ИмяТабличнойЧасти].Добавить();
				
				Для каждого СтрокаТаблицы Из ПараметрыСопоставления.ТаблицаРеквизитов Цикл
					
					Если СтрокаТаблицы.Имя = "Ссылка" Тогда
						Продолжить;
					КонецЕсли;
					
					НоваяСтрока[СтрокаТаблицы.Имя] = СтрокаДанных[СтрокаТаблицы.ПолноеИмя];
					
				КонецЦикла;
				
				ТБ_СопоставлениеОбъектов.ВыполнитьКодОбработчикаПослеЗаполненияСтрокиВПопытке(
					СправочникОбъект, НоваяСтрока, ПараметрыОбъекта, СтрокаДанных.ДанныеИсточника,
					ПараметрыСопоставления, Отказ);
				
				Если Отказ Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			
			НачатьТранзакцию();
			Попытка
				
				// Обработчик ПередЗаписью.
				ТБ_СопоставлениеОбъектов.ВыполнитьКодОбработчикаПередЗаписьюВПопытке(
					СправочникОбъект, ПараметрыОбъекта, НайденныеСтроки[0].ДанныеИсточника,
					ПараметрыСопоставления, Отказ);
				
				Если Отказ Тогда
					Продолжить;
				КонецЕсли;
				
				Если ПараметрыСопоставления.РежимРазработчика Тогда
					СправочникОбъект.ОбменДанными.Загрузка = Истина;
				КонецЕсли;
				
				СправочникОбъект.Записать();
				
				// Обработчик ПослеЗаписи.
				ТБ_СопоставлениеОбъектов.ВыполнитьКодОбработчикаПослеЗаписиВПопытке(
					СправочникОбъект, ПараметрыОбъекта, НайденныеСтроки[0].ДанныеИсточника,
					ПараметрыСопоставления, Отказ);
				
				ЗафиксироватьТранзакцию();
				
				ПараметрыСопоставления.ИзмененныеОбъекты.Добавить(СправочникОбъект.Ссылка);
				
			Исключение
				
				ОтменитьТранзакцию();
				
				ТБ_СопоставлениеОбъектов.ДобавитьОписаниеОшибки(ПараметрыСопоставления.ОписаниеОшибок,
					СтрШаблон(НСтр("ru = 'Ошибка записи обновляемого объекта ""%1"":
					|%2'"),
					ПараметрыОбъекта.ПредставлениеОбъекта,
					КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого ОписаниеОшибки Из ПараметрыСопоставления.ОписаниеОшибок Цикл
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки.ТекстОшибки);
	КонецЦикла;
	
	ЗагрузитьИзмененныеОбъекты(ПараметрыСопоставления);
	
	Возврат КоличествоЗаписей;
	
КонецФункции

&НаСервере
Функция ТаблицаДанныхСоЗначениямиПолей(ТаблицаИсточника, Знач ПараметрыСопоставления, Знач СвойстваИсточника)
	
	ТаблицаДанных = ТБ_СопоставлениеОбъектов.ТаблицаДанныхДляСопоставления(ПараметрыСопоставления);
	
	Для каждого СтрокаИсточника Из ТаблицаИсточника Цикл
		
		СтрокаДанных = ТБ_СопоставлениеОбъектов.ДобавитьСтрокуДанных(
			ТаблицаДанных,
			СтрокаИсточника.ИдентификаторСтроки,
			СтрокаИсточника.Идентификатор,
			ТБ_СопоставлениеОбъектов.СтруктураДанныхИсточника(СтрокаИсточника, СвойстваИсточника),
			ПараметрыСопоставления);
		
		Если Не СтрокаДанных.Отказ Тогда
			
			НезаполненныеПоля = ТБ_СопоставлениеОбъектов.ПроверитьЗаполнениеСтрокиДанных(СтрокаДанных, ПараметрыСопоставления);
			Если НезаполненныеПоля.Количество() <> 0 Тогда
				
				НомерСтроки = СтрокаИсточника.ИдентификаторСтроки + 1;
				
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Не определено значение для обязательных полей %1 в строке %2 списка ""Соответствия объектов""'"),
					СтрСоединить(НезаполненныеПоля, ", "),
					НомерСтроки);
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
					,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоответствияОбъектов", НомерСтроки, "Идентификатор"),
					,
					СтрокаДанных.Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаДанных;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьИзмененныеОбъекты(Знач ПараметрыСопоставления)
	
	Объект.ИзмененныеОбъекты.Очистить();
	
	Для каждого Ссылка Из ПараметрыСопоставления.СозданныеОбъекты Цикл
		
		НоваяСтрока = Объект.ИзмененныеОбъекты.Добавить();
		НоваяСтрока.Ссылка   = Ссылка;
		НоваяСтрока.Действие = НСтр("ru = 'Создан'");
		
	КонецЦикла;
	
	Для каждого Ссылка Из ПараметрыСопоставления.ИзмененныеОбъекты Цикл
		
		НоваяСтрока = Объект.ИзмененныеОбъекты.Добавить();
		НоваяСтрока.Ссылка   = Ссылка;
		НоваяСтрока.Действие = НСтр("ru = 'Изменен'");
		
	КонецЦикла;
	
	Объект.ИзмененныеОбъекты.Сортировать("Ссылка");
	
КонецПроцедуры

#КонецОбласти

#Область ПоискДублейПоПолямПоиска

&НаКлиенте
Процедура НайтиДублиПоПолямПоискаНаКлиенте()
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Выполняется поиск дублей объектов'");
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		НачатьПоискДублей(),
		Новый ОписаниеОповещения("НайтиДублиПоПолямПоискаЗавершение", ЭтотОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиДублиПоПолямПоискаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	КоличествоЗаписей = ПолучитьТаблицуСоответствия(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru = 'Поиск дублей завершен (%1)'"), КоличествоЗаписей),
		,
		НСтр("ru = 'Поиск дублей по полям поиска завершен.'"),
		БиблиотекаКартинок.Информация32);
	
	Элементы.СоответствияОбъектов.Обновить();
	
КонецПроцедуры

&НаСервере
Функция НачатьПоискДублей()
	
	Для каждого СтрокаСоответствия Из СоответствияОбъектов Цикл
		СтрокаСоответствия.ИдентификаторСтроки = СтрокаСоответствия.ПолучитьИдентификатор();
	КонецЦикла;
	
	ТаблицаСоответствия     = СоответствияОбъектов.Выгрузить();
	ТаблицаСвойствИсточника = РеквизитФормыВЗначение("СвойстваИсточника");
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработки.ТБ_СопоставлениеОбъектов.НайтиДублиПоПолямПоиска",
		ТаблицаСоответствия, Объект.ПравилоСопоставления, ТаблицаСвойствИсточника);
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуСоответствия(Знач АдресРезультата)
	
	КоличествоЗаписей = 0;
	
	ТаблицаДублей = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Для каждого СтрокаСоответствия Из СоответствияОбъектов Цикл
		
		ЕстьДубли = ТаблицаДублей.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаСоответствия.ИдентификаторСтроки)).Количество() <> 0;
		Если ЕстьДубли Тогда
			КоличествоЗаписей = КоличествоЗаписей + 1;
		КонецЕсли;
		
		СтрокаСоответствия.ЕстьДубли         = ЕстьДубли;
		СтрокаСоответствия.КартинкаЕстьДубли = ?(ЕстьДубли, 1, 0);
		
	КонецЦикла;
	
	Возврат КоличествоЗаписей;
	
КонецФункции

#КонецОбласти

&НаСервере
Функция СохранитьСопоставленныеОбъектыНаСервере(Отказ)
	
	КоличествоЗаписей = 0;
	
	НачатьТранзакцию();
	Попытка
		
		НайденныеСтроки = СоответствияОбъектов.НайтиСтроки(Новый Структура("Пометка", Истина));
		Для каждого СтрокаСоответствия Из НайденныеСтроки Цикл
			
			Если ЗначениеЗаполнено(СтрокаСоответствия.Объект) Тогда 
				РегистрыСведений.ТБ_СоответствияОбъектов.ЗаписатьСоответствие(СтрокаСоответствия);
				КоличествоЗаписей = КоличествоЗаписей + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка при записи соответствия объектов:
			|%1'"),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		
		КоличествоЗаписей = 0;
		
	КонецПопытки;
	
	ЗаполнитьСлужебныеРеквизиты();
	
	Возврат КоличествоЗаписей;
	
КонецФункции

&НаСервереБезКонтекста
Функция КлючЗаписиСоответствия(Знач Идентификатор, Знач ИмяОбъекта)
	
	ЗначенияКлюча = Новый Структура;
	ЗначенияКлюча.Вставить("Идентификатор", Идентификатор);
	ЗначенияКлюча.Вставить("ИмяОбъекта",    ИмяОбъекта);
	
	Возврат РегистрыСведений.ТБ_СоответствияОбъектов.СоздатьКлючЗаписи(ЗначенияКлюча);
	
КонецФункции

&НаСервере
Функция УдалитьИзмененныеОбъектыНаСервере()
	
	КоличествоОбъектов = 0;
	
	Для каждого ИдентификаторСтроки Из Элементы.ИзмененныеОбъекты.ВыделенныеСтроки Цикл
		
		УдаляемаяСтрока = Объект.ИзмененныеОбъекты.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		Попытка
			
			// Очистка объектов в таблице соответствия.
			НайденныеСтроки = СоответствияОбъектов.НайтиСтроки(Новый Структура("Объект", УдаляемаяСтрока.Ссылка));
			Для каждого СтрокаСоответствия Из НайденныеСтроки Цикл
				
				СтрокаСоответствия.Объект       = Неопределено;
				СтрокаСоответствия.Сопоставлено = Ложь;
				
			КонецЦикла;
			
			// Удаление объекта.
			Если ОбщегоНазначения.ЕстьСсылкиНаОбъект(УдаляемаяСтрока.Ссылка) Тогда
				
				УдаляемыйОбъект = УдаляемаяСтрока.Ссылка.ПолучитьОбъект();
				Если РежимРазработчика Тогда
					УдаляемыйОбъект.ОбменДанными.Загрузка = Истина;
				КонецЕсли;
				УдаляемыйОбъект.УстановитьПометкуУдаления(Истина);
				
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Объект %1 помечен на удаление, на объект есть ссылки'"),
					УдаляемаяСтрока.Ссылка);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
			Иначе
				
				УдаляемыйОбъект = УдаляемаяСтрока.Ссылка.ПолучитьОбъект();
				УдаляемыйОбъект.Удалить();
				
			КонецЕсли;
			
			Объект.ИзмененныеОбъекты.Удалить(УдаляемаяСтрока);
			
			КоличествоОбъектов = КоличествоОбъектов + 1;
			
		Исключение
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка при удалении созданного объекта:
				|%1'"),
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат КоличествоОбъектов;
	
КонецФункции

#КонецОбласти
