#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Фиксирует начало запуска сценария загрузки.
//
// Параметры:
//  Сценарий - СправочникСсылка.ТБ_СценарииЗагрузкиОбъектов - сценарий загрузки.
//
Процедура ЗафиксироватьЗапускСценария(Знач Сценарий) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных();
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ТБ_СостоянияЗагрузкиОбъектов");
		ЭлементБлокировки.УстановитьЗначение("Сценарий", Сценарий);
		
		Блокировка.Заблокировать();
		
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Сценарий = Сценарий;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.Сценарий = Сценарий;
		МенеджерЗаписи.ПоследнийЗапускНачало = ТекущаяДатаСеанса();
		// На случай если ЗафиксироватьРезультатВыполненияРассылки не будет вызван из-за необработанного исключения.
		МенеджерЗаписи.ПоследнийЗапускЗавершение = МенеджерЗаписи.ПоследнийЗапускНачало + 30 * 60;
		МенеджерЗаписи.НомерСеанса = НомерСеансаИнформационнойБазы();
		МенеджерЗаписи.Выполнена = Ложь;
		МенеджерЗаписи.СОшибками = Истина;
		
		МенеджерЗаписи.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Фиксирует результат выполнения сценария загрузки.
//
// Параметры:
//  Сценарий - СправочникСсылка.ТБ_СценарииЗагрузкиОбъектов - сценарий загрузки.
//  РезультатВыполнения - Структура - результат выполнения сценария.
//
Процедура ЗафиксироватьРезультатВыполненияСценария(Знач Сценарий, Знач РезультатВыполнения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ТБ_СостоянияЗагрузкиОбъектов");
		ЭлементБлокировки.УстановитьЗначение("Сценарий", Сценарий);
		Блокировка.Заблокировать();
		
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Сценарий = Сценарий;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.Сценарий = Сценарий;
		МенеджерЗаписи.СОшибками = РезультатВыполнения.СОшибками;
		МенеджерЗаписи.Выполнена = Истина; //РезультатВыполнения.ВыполненаВПапку
		//	Или РезультатВыполнения.ВыполненаВСетевойКаталог
		//	Или РезультатВыполнения.ВыполненаНаFTP
		//	Или РезультатВыполнения.ВыполненаПоЭлектроннойПочте
		//	Или Не МенеджерЗаписи.СОшибками;
		
		Если МенеджерЗаписи.Выполнена Тогда
			МенеджерЗаписи.УспешныйЗапуск = МенеджерЗаписи.ПоследнийЗапускНачало;
		КонецЕсли;
		
		МенеджерЗаписи.ПоследнийЗапускЗавершение = ТекущаяДатаСеанса();
		
		МенеджерЗаписи.Записать(Истина);
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли