
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ПредставлениеСостоянияНовый",             НСтр("ru = 'Новый'"));
	Список.Параметры.УстановитьЗначениеПараметра("ПредставлениеСостоянияНеВыполнен",        НСтр("ru = 'Не выполнен'"));
	Список.Параметры.УстановитьЗначениеПараметра("ПредставлениеСостоянияВыполненСОшибками", НСтр("ru = 'Выполнен с ошибками'"));
	Список.Параметры.УстановитьЗначениеПараметра("ПредставлениеСостоянияВыполнен",          НСтр("ru = 'Выполнен'"));
	
КонецПроцедуры

#КонецОбласти
