#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("Период");
	ПараметрПериод = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("Организация");
	ПараметрОрганизация = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("Счет");
	ПараметрСчет = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("ВидСубконто");
	ПараметрВидСубконто = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("Источник");
	ПараметрИсточник = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	
	ИмяРеквизитаНастройкаПодключения = "НастройкаПодключения";
	НастройкаПодключения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрИсточник.Значение, ИмяРеквизитаНастройкаПодключения);
	
	Соединение = ТБ_СопоставлениеОбъектовПовтИсп.COMСоединение(НастройкаПодключения);
	Если Соединение = Неопределено Тогда
		
		ТекстСообщения = НСтр("ru = 'При подключении к источнику возникли ошибки (см. Журнал регистрации).'");
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Организация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ИНН = &ИНН
	|	И Организации.КПП = &КПП
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Счет.Код КАК Счет,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(430)) КАК ИмяОбъекта,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(250)) КАК ИдентификаторСубконто1,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(500)) КАК ПредставлениеСубконто1,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Субконто1Ссылка,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ХозрасчетныйОстаткиИОбороты.Субконто1) КАК Субконто1,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокДт КАК СуммаНачальныйОстатокДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокКт КАК СуммаНачальныйОстатокКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК СуммаОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК СуммаКонечныйОстатокДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокКт КАК СуммаКонечныйОстатокКт,
	|	ХозрасчетныйОстаткиИОбороты.КоличествоНачальныйОстатокДт КАК КоличествоНачальныйОстатокДт,
	|	ХозрасчетныйОстаткиИОбороты.КоличествоНачальныйОстатокКт КАК КоличествоНачальныйОстатокКт,
	|	ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт КАК КоличествоОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.КоличествоОборотКт КАК КоличествоОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.КоличествоКонечныйОстатокДт КАК КоличествоКонечныйОстатокДт,
	|	ХозрасчетныйОстаткиИОбороты.КоличествоКонечныйОстатокКт КАК КоличествоКонечныйОстатокКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Счет В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					Т.Ссылка
	|				ИЗ
	|					ПланСчетов.Хозрасчетный КАК Т
	|				ГДЕ
	|					Т.Код = &Счет),
	|			&ВидСубконто,
	|			Организация В
	|				(ВЫБРАТЬ
	|					Т.Ссылка
	|				ИЗ
	|					ВТ_Организация КАК Т)) КАК ХозрасчетныйОстаткиИОбороты";
	
	// Параметр запроса
	ИмяЭлемента = ПараметрВидСубконто.Значение.ИмяПредопределенныхДанных;
	ИмяПредопределенногоЗначения = "ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка";
	ИмяПредопределенногоЗначения = СтрЗаменить(ИмяПредопределенногоЗначения, "ПустаяСсылка", ИмяЭлемента);
	ВидСубконто = Соединение.ПредопределенноеЗначение(ИмяПредопределенногоЗначения);
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрОрганизация.Значение, "ИНН, КПП");
	ИмяРеквизитаКод = "Код";
	КодСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрСчет.Значение, ИмяРеквизитаКод);
	
	Запрос = Соединение.NewObject("Запрос");
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрПериод.Значение.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ПараметрПериод.Значение.ДатаОкончания);
	Запрос.УстановитьПараметр("ИНН", РеквизитыОрганизации.ИНН);
	Запрос.УстановитьПараметр("КПП", РеквизитыОрганизации.КПП);
	Запрос.УстановитьПараметр("Счет", КодСчета);
	Запрос.УстановитьПараметр("ВидСубконто", ВидСубконто);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаЗначенийCOM = РезультатЗапроса.Выгрузить();
	Для каждого СтрокаТаблицы из ТаблицаЗначенийCOM Цикл 
		Попытка
			СтрокаТаблицы.ПредставлениеСубконто1 = СтрокаТаблицы.Субконто1;
			СтрокаТаблицы.ИмяОбъекта = СтрокаТаблицы.Субконто1Ссылка.Метаданные().ПолноеИмя();
			СтрокаТаблицы.ИдентификаторСубконто1 = Соединение.String(СтрокаТаблицы.Субконто1Ссылка.УникальныйИдентификатор());
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Сравнение оборотов по счетам.Заполнение субконто'"),
				УровеньЖурналаРегистрации.Предупреждение, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;  
	// Удалим колонки с составным типом, чтобы при сериализации(ЗначениеИзСтрокиXML) не было ошибки
	ТаблицаЗначенийCOM.Колонки.Удалить("Субконто1Ссылка");
	ТаблицаЗначенийCOM.Колонки.Удалить("Субконто1");
	
	СтрокаXML = Соединение.ОбщегоНазначения.ЗначениеВСтрокуXML(ТаблицаЗначенийCOM);
	ТаблицаЗначений = ОбщегоНазначения.ЗначениеИзСтрокиXML(СтрокаXML);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаЗначений", ТаблицаЗначений);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.Счет КАК Счет,
	|	Т.ИмяОбъекта КАК ИмяОбъекта,
	|	Т.ИдентификаторСубконто1 КАК ИдентификаторСубконто1,
	|	Т.ПредставлениеСубконто1 КАК ПредставлениеСубконто1,
	|	Т.СуммаНачальныйОстатокДт КАК СуммаНачальныйОстатокДт,
	|	Т.СуммаНачальныйОстатокКт КАК СуммаНачальныйОстатокКт,
	|	Т.СуммаОборотДт КАК СуммаОборотДт,
	|	Т.СуммаОборотКт КАК СуммаОборотКт,
	|	Т.СуммаКонечныйОстатокДт КАК СуммаКонечныйОстатокДт,
	|	Т.СуммаКонечныйОстатокКт КАК СуммаКонечныйОстатокКт,
	|	Т.КоличествоНачальныйОстатокДт КАК КоличествоНачальныйОстатокДт,
	|	Т.КоличествоНачальныйОстатокКт КАК КоличествоНачальныйОстатокКт,
	|	Т.КоличествоОборотДт КАК КоличествоОборотДт,
	|	Т.КоличествоОборотКт КАК КоличествоОборотКт,
	|	Т.КоличествоКонечныйОстатокДт КАК КоличествоКонечныйОстатокДт,
	|	Т.КоличествоКонечныйОстатокКт КАК КоличествоКонечныйОстатокКт
	|ПОМЕСТИТЬ Источник
	|ИЗ
	|	&ТаблицаЗначений КАК Т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИмяОбъекта,
	|	ИдентификаторСубконто1";
	Запрос.Выполнить();
	
	СхемаКомпоновки = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, , , МенеджерВременныхТаблиц);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли