
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкаЗагрузки = Параметры.НастройкаЗагрузки;
	СтруктураДанных   = Параметры.СтруктураДанных;
	ТекущийОбъект     = Параметры.ТекущийОбъект;
	
	Если ЗначениеЗаполнено(ТекущийОбъект)
		И Не ЗначениеЗаполнено(СтруктураДанных) Тогда
		СтруктураДанных = ТБ_ЗагрузкаОбъектов.СтруктураДанныхЗагруженногоОбъекта(ТекущийОбъект);
	КонецЕсли;
	
	//
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ТекущийОбъект");
	ИменаЭлементов.Добавить("НастройкаЗагрузки");
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		ИменаЭлементов,
		"ТолькоПросмотр",
		ЗначениеЗаполнено(НастройкаЗагрузки));
	
	//
	
	Если ЗначениеЗаполнено(НастройкаЗагрузки) Тогда
		НастройкаЗагрузкиПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкаЗагрузкиПриИзменении(Элемент)
	
	НастройкаЗагрузкиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийОбъектПриИзменении(Элемент)
	
	ТекущийОбъектПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяТабличнойЧастиПриИзменении(Элемент)
	
	НайденныеСтроки = ТабличныеЧасти.НайтиСтроки(Новый Структура("ИмяТабличнойЧасти", ИмяТабличнойЧасти));
	Если НайденныеСтроки.Количество() = 0 Тогда
		ПравилоСопоставления = Неопределено;
	Иначе
		ПравилоСопоставления = НайденныеСтроки[0].ПравилоСопоставления;
	КонецЕсли;
	
	ОбновитьДанныеИсточникаНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьДанныеИсточника(Команда)
	
	ОбновитьДанныеИсточникаНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПриИзмененииРеквизитов

&НаСервере
Процедура ТекущийОбъектПриИзмененииНаСервере()
	
	СтруктураДанных = ТБ_ЗагрузкаОбъектов.СтруктураДанныхЗагруженногоОбъекта(ТекущийОбъект);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура НастройкаЗагрузкиПриИзмененииНаСервере()
	
	ТабличныеЧасти.Очистить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТабличныеЧасти.Ссылка.ИмяОбъекта КАК ИмяОбъекта,
	|	ТабличныеЧасти.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ТабличныеЧасти.ПравилоСопоставления КАК ПравилоСопоставления,
	|	ТабличныеЧасти.ПравилоСопоставления.ИсточникДанных КАК ИсточникДанных
	|ИЗ
	|	Справочник.ТБ_НастройкиЗагрузкиОбъектов.ТабличныеЧасти КАК ТабличныеЧасти
	|ГДЕ
	|	ТабличныеЧасти.Ссылка = &НастройкаЗагрузки");
	
	Запрос.УстановитьПараметр("НастройкаЗагрузки", НастройкаЗагрузки);
	
	Элементы.ИмяТабличнойЧасти.СписокВыбора.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ТабличныеЧасти.Добавить(), Выборка);
		
		Представление = ТБ_СопоставлениеОбъектовПовтИсп.ПредставлениеОбъектаМетаданных(Выборка.ИмяОбъекта + ".ТабличнаяЧасть." + Выборка.ИмяТабличнойЧасти);
		Элементы.ИмяТабличнойЧасти.СписокВыбора.Добавить(Выборка.ИмяТабличнойЧасти, Представление);
		
	КонецЦикла;
	
	
	Элементы.ИмяТабличнойЧасти.СписокВыбора.СортироватьПоПредставлению();
	
	//
	
	ИмяТабличнойЧасти = "";
	ПравилоСопоставления = Неопределено;
	
	//
	
	ОбновитьДанныеИсточникаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеИсточникаНаСервере()
	
	СоздатьТаблицуДанныхИсточника();
	ЗаполнитьТаблицуДанныхИсточника();
	
КонецПроцедуры

#Область ЗагрузкаДанныхИсточника

&НаСервере
Процедура СоздатьТаблицуДанныхИсточника()
	
	ДанныеИсточника.Очистить();
	
	ТБ_СопоставлениеОбъектов.УдалитьРеквизитыВТаблице(
		ЭтотОбъект,
		"ДанныеИсточника",
		СвойстваИсточника);
	
	ТБ_СопоставлениеОбъектов.ЗаполнитьСвойстваИсточникаДанныхПоПравилу(
		СвойстваИсточника,
		ПравилоСопоставления,
		Истина);
	
	ТБ_СопоставлениеОбъектов.ДобавитьРеквизитыВТаблицу(
		ЭтотОбъект,
		"ДанныеИсточника",
		СвойстваИсточника);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДанныхИсточника()
	
	ДанныеИсточника.Очистить();
	
	Если Не ЗначениеЗаполнено(ПравилоСопоставления) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОтклонений = ТБ_ЗагрузкаОбъектов.ТаблицаОтклонений(
		ПравилоСопоставления,
		ТекущийОбъект,
		СтруктураДанных);
	
	Для каждого СтрокаТаблицы Из ТаблицаОтклонений Цикл
		
		КартинкаОтклонение = ?(СтрокаТаблицы.Отклонение > 0, 0, 1);
		Отклонение         = ?(СтрокаТаблицы.Отклонение > 0, НСтр("ru = 'Есть в источнике'"), НСтр("ru = 'Нет в источнике'"));
		
		Для Сч = 1 По СтрокаТаблицы.Отклонение * ?(СтрокаТаблицы.Отклонение < 0, -1, 1) Цикл
			
			НоваяСтрока = ДанныеИсточника.Добавить();
			НоваяСтрока.КартинкаОтклонение = КартинкаОтклонение;
			НоваяСтрока.Отклонение         = Отклонение;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, , "Отклонение");
			
		КонецЦикла;
		
	КонецЦикла;
	
	Элементы.ДанныеИсточника.Обновить();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
