
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Параметры.Свойство("ЗначениеКопирования")
			И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			
			ОбъектКопирования = Параметры.ЗначениеКопирования.ПолучитьОбъект();
			ПолучитьЗначенияРеквизитовИзХранилища(ОбъектКопирования);
			
			НастройкиКомпоновки = ОбъектКопирования.КомпоновщикНастроек.Получить();
			
		Иначе
			НастройкиКомпоновки = Неопределено;
		КонецЕсли;
		
		ПриЧтенииСозданииНаСервере();
		
		ТБ_СопоставлениеОбъектов.ИнициализироватьКомпоновщик(
			КомпоновщикНастроек,
			УникальныйИдентификатор,
			СвойстваИсточникаДанных,
			НастройкиКомпоновки);
		
	КонецЕсли;
	
	// 2024.01.26 Заменили список выбора, справочником, для использования иерархии
	//ТБ_СопоставлениеОбъектов.ЗаполнитьСписокВыбораОбъекта(Элементы.ИмяОбъекта.СписокВыбора); 
	
	Если ЗначениеЗаполнено(Объект.ИмяОбъекта) Тогда
		ТБ_СопоставлениеОбъектов.ЗаполнитьСписокВыбораИмяОбъекта(Объект.ИмяОбъекта, Элементы.ИмяОбъекта.СписокВыбора);
	КонецЕсли;
	
	ПроверитьИзменитьПризнакГруппы(ЭтотОбъект, Объект.ИмяОбъекта);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПолучитьЗначенияРеквизитовИзХранилища(ТекущийОбъект);
	
	ПриЧтенииСозданииНаСервере();
	
	УстановитьПоказатьТолькоВыбранныеРеквизиты(ЭтотОбъект, Истина);
	УстановитьПоказатьТолькоВыбранныеДопРеквизиты(ЭтотОбъект, Истина);
	
	НастройкиКомпоновки = ТекущийОбъект.КомпоновщикНастроек.Получить();
	
	ТБ_СопоставлениеОбъектов.ИнициализироватьКомпоновщик(
		КомпоновщикНастроек,
		УникальныйИдентификатор,
		СвойстваИсточникаДанных,
		НастройкиКомпоновки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ДополнительныеРеквизиты.Количество() = 0 Тогда
		Элементы.ГруппаДопРеквизиты.Скрыть();
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для каждого ТекущаяСтрока Из Объект.Реквизиты Цикл
		
		СтрокаТЧ = ТекущийОбъект.Реквизиты[ТекущаяСтрока.НомерСтроки - 1];
		СтрокаТЧ.ТипЗначенияХранилище = Новый ХранилищеЗначения(ТекущаяСтрока.ТипЗначения);
		СтрокаТЧ.ЗначениеХранилище    = Новый ХранилищеЗначения(ТекущаяСтрока.Значение);
		
	КонецЦикла;
	
	Для каждого ТекущаяСтрока Из Объект.ДополнительныеРеквизиты Цикл
		
		СтрокаТЧ = ТекущийОбъект.ДополнительныеРеквизиты[ТекущаяСтрока.НомерСтроки - 1];
		СтрокаТЧ.ТипЗначенияХранилище = Новый ХранилищеЗначения(ТекущаяСтрока.ТипЗначения);
		СтрокаТЧ.ЗначениеХранилище    = Новый ХранилищеЗначения(ТекущаяСтрока.Значение);
		
	КонецЦикла;
	
	ТекущийОбъект.КомпоновщикНастроек = Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПолучитьЗначенияРеквизитовИзХранилища(ТекущийОбъект);
	
	ЗаполнитьСлужебныеРеквизиты("Реквизиты");
	ЗаполнитьСлужебныеРеквизиты("ДополнительныеРеквизиты");
	
	Элементы.СтраницаОбработчикПередСопоставлением.Картинка   = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.ОбработчикПередСопоставлением);
	Элементы.СтраницаОбработчикПередОбработкой.Картинка       = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.ОбработчикПередОбработкой);
	Элементы.СтраницаОбработчикПослеЗаполненияСтроки.Картинка = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.ОбработчикПослеЗаполненияСтрокиТаблицы);
	Элементы.СтраницаОбработчикПередЗаписью.Картинка          = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.ОбработчикПередЗаписью);
	Элементы.СтраницаОбработчикПослеЗаписи.Картинка           = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.ОбработчикПослеЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсточникДанныхПриИзменении(Элемент)
	
	ИсточникДанныхПриИзмененииНаСервере();
	
	ЗаполнитьСписокВыбораНаименования(ЭтотОбъект, Элементы.Наименование.СписокВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяОбъектаПриИзменении(Элемент)
	
	Объект.ПредставлениеОбъекта        = ТБ_СопоставлениеОбъектовКлиент.ПредставлениеЗначения(Объект.ИмяОбъекта, Элементы.ИмяОбъекта.СписокВыбора);
	Объект.ИмяТабличнойЧасти           = "";
	Объект.ПредставлениеТабличнойЧасти = "";
	Объект.ВидНоменклатуры             = Неопределено;
	
	ИмяОбъектаПриИзмененииНаСервере();
	
	ЗаполнитьСписокВыбораНаименования(ЭтотОбъект, Элементы.Наименование.СписокВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяТабличнойЧастиПриИзменении(Элемент)
	
	Объект.ПредставлениеТабличнойЧасти = ТБ_СопоставлениеОбъектовКлиент.ПредставлениеЗначения(Объект.ИмяТабличнойЧасти, Элементы.ИмяТабличнойЧасти.СписокВыбора);
	Объект.ВидНоменклатуры             = Неопределено;
	
	ИмяТабличнойЧастиПриИзмененииНаСервере();
	
	ЗаполнитьСписокВыбораНаименования(ЭтотОбъект, Элементы.Наименование.СписокВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	
	ЗаполнитьТаблицуДопРеквизитов();
	
	ЗаполнитьСписокВыбораНаименования(ЭтотОбъект, Элементы.Наименование.СписокВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяОбъектаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.ТБ_Объекты.ФормаВыбора",, Элементы.ИмяОбъекта,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ИмяОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	СтруктураВыбранногоЗначения = ИмяОбъектаОбработкаВыбораНаСервере(ВыбранноеЗначение);   
	
	ИмяОбъектаСписокВыбора = Элементы.ИмяОбъекта.СписокВыбора;
	
	ИмяОбъектаСписокВыбора.Очистить();
	
	ИмяОбъектаСписокВыбора.Добавить(СтруктураВыбранногоЗначения.ПолноеИмя, СтруктураВыбранногоЗначения.Наименование);
	
	ВыбранноеЗначение = СтруктураВыбранногоЗначения.ПолноеИмя;
	
	ПроверитьИзменитьПризнакГруппы(ЭтотОбъект, СтруктураВыбранногоЗначения.ПолноеИмя);

КонецПроцедуры

&НаКлиенте
Процедура ИмяОбъектаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпоновщикНастроекНастройкиОтбор

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриИзменении(Элемент)
	
	ОбновитьОбязательныеСвойстваИсточника();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеквизиты

&НаКлиенте
Процедура РеквизитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.РеквизитыИндексКартинкиТип Тогда
		
		СтандартнаяОбработка = Ложь;
		ВыборТипаЗначения(Элемент, "Реквизиты");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыПриАктивизацииЯчейки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент = Элементы.РеквизитыЗначение Тогда
		Элементы.РеквизитыЗначение.ОграничениеТипа = ТекущиеДанные.ТипЗначения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыПометкаПриИзменении(Элемент)
	
	СортироватьТаблицуРеквизитов("Реквизиты", Элементы.Реквизиты.ТекущаяСтрока);
	
	ОбновитьОтборСтрокТаблицыРеквизитов(ЭтотОбъект);
	ОбновитьОбязательныеСвойстваИсточника();
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыПоискПриИзменении(Элемент)
	
	УстановитьПометкуВТаблицеРеквизитов("Реквизиты");
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыВариантЗаполненияПриИзменении(Элемент)
	
	УстановитьПометкуВТаблицеРеквизитов("Реквизиты");
	ОбновитьОбязательныеСвойстваИсточника();
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыЗначениеПриИзменении(Элемент)
	
	ЗначениеПриИзмененииНаСервере("Реквизиты", Элементы.Реквизиты.ТекущаяСтрока);
	
	УстановитьПометкуВТаблицеРеквизитов("Реквизиты");
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыСвойствоИсточникаПриИзменении(Элемент)
	
	УстановитьПометкуВТаблицеРеквизитов("Реквизиты");
	ОбновитьОбязательныеСвойстваИсточника();
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыСвойствоИсточникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Реквизиты.ТекущиеДанные;
	
	//Если ТекущиеДанные.ВариантЗаполнения = ПредопределенноеЗначение("Перечисление.ТБ_ВариантыЗаполнения.ЗначениеИсточника") Тогда
	Если ТекущиеДанные.ВариантЗаполнения = ПредопределенноеЗначение("Перечисление.ТБ_ВариантыЗаполнения.ЗначениеИсточника") 
		И Не ТекущиеДанные.Имя = "Ссылка" Тогда
		ДанныеВыбора = ДанныеВыбораСвойстваИсточника(Строка(ТекущиеДанные.ТипЗначения));
	Иначе
		ДанныеВыбора = ДанныеВыбораСвойстваИсточника("Строка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОбработчикПриИзменении(Элемент)
	
	УстановитьПометкуВТаблицеРеквизитов("Реквизиты");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеРеквизиты

&НаКлиенте
Процедура ДополнительныеРеквизитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ДополнительныеРеквизитыИндексКартинкиТип Тогда
		
		СтандартнаяОбработка = Ложь;
		ВыборТипаЗначения(Элемент, "ДополнительныеРеквизиты");
		
	ИначеЕсли Поле = Элементы.ДополнительныеРеквизитыРеквизит Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Свойство);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыПриАктивизацииЯчейки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент = Элементы.ДополнительныеРеквизитыЗначение Тогда
		
		Элементы.ДополнительныеРеквизитыЗначение.ОграничениеТипа = ТекущиеДанные.ТипЗначения;
		
		Если ТекущиеДанные.ТипЗначения.Типы().Найти(Тип("СправочникСсылка.ЗначенияСвойствОбъектов")) <> Неопределено Тогда
			
			ПараметрВыбора = Новый ПараметрВыбора("Отбор.Владелец", ТекущиеДанные.Свойство);
			Массив = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрВыбора);
			
		Иначе
			Массив = Новый Массив;
		КонецЕсли;
		
		Элементы.ДополнительныеРеквизитыЗначение.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыПометкаПриИзменении(Элемент)
	
	СортироватьТаблицуРеквизитов("ДополнительныеРеквизиты", Элементы.ДополнительныеРеквизиты.ТекущаяСтрока);
	
	ОбновитьОтборСтрокТаблицыДопРеквизитов(ЭтотОбъект);
	ОбновитьОбязательныеСвойстваИсточника();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыПоискПриИзменении(Элемент)
	
	УстановитьПометкуВТаблицеРеквизитов("ДополнительныеРеквизиты");
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыВариантЗаполненияПриИзменении(Элемент)
	
	УстановитьПометкуВТаблицеРеквизитов("ДополнительныеРеквизиты");
	ОбновитьОбязательныеСвойстваИсточника();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыЗначениеПриИзменении(Элемент)
	
	ЗначениеПриИзмененииНаСервере("ДополнительныеРеквизиты", Элементы.ДополнительныеРеквизиты.ТекущаяСтрока);
	
	УстановитьПометкуВТаблицеРеквизитов("ДополнительныеРеквизиты");
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыСвойствоИсточникаПриИзменении(Элемент)
	
	УстановитьПометкуВТаблицеРеквизитов("ДополнительныеРеквизиты");
	ОбновитьОбязательныеСвойстваИсточника();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыСвойствоИсточникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ДополнительныеРеквизиты.ТекущиеДанные;
	
	Если ТекущиеДанные.ВариантЗаполнения = ПредопределенноеЗначение("Перечисление.ТБ_ВариантыЗаполнения.ЗначениеИсточника") Тогда
		ДанныеВыбора = ДанныеВыбораСвойстваИсточника(Строка(ТекущиеДанные.ТипЗначения));
	Иначе
		ДанныеВыбора = ДанныеВыбораСвойстваИсточника("Строка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыОбработчикПриИзменении(Элемент)
	
	УстановитьПометкуВТаблицеРеквизитов("ДополнительныеРеквизиты");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСвойстваИсточника

&НаКлиенте
Процедура СвойстваИсточникаПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СвойстваИсточника.ТекущиеДанные;
	Если Не ТекущиеДанные.Пометка Тогда
		
		ТекущиеДанные.ВключатьВИдентификатор = Ложь;
		ТекущиеДанные.ВключатьВПредставление = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваИсточникаВключатьВИдентификаторПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СвойстваИсточника.ТекущиеДанные;
	Если Не ТекущиеДанные.Пометка Тогда
		ТекущиеДанные.Пометка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваИсточникаВключатьВПредставлениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СвойстваИсточника.ТекущиеДанные;
	Если Не ТекущиеДанные.Пометка Тогда
		ТекущиеДанные.Пометка = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьРеквизитыИЗначения(Команда)
	
	ПроверитьРеквизитыИЗначенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсеРеквизиты(Команда)
	
	ТБ_СопоставлениеОбъектовКлиент.УстановитьПометки(
		Объект.Реквизиты,
		Элементы.Реквизиты,
		Истина,
		Новый Структура("Обязательно", Ложь),
		Модифицированность);
	
	СортироватьТаблицуРеквизитов("Реквизиты", Элементы.Реквизиты.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьВсеРеквизиты(Команда)
	
	ТБ_СопоставлениеОбъектовКлиент.УстановитьПометки(
		Объект.Реквизиты,
		Элементы.Реквизиты,
		Ложь,
		Новый Структура("Обязательно", Ложь),
		Модифицированность);
	
	СортироватьТаблицуРеквизитов("Реквизиты", Элементы.Реквизиты.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоВыбранныеРеквизиты(Команда)
	
	УстановитьПоказатьТолькоВыбранныеРеквизиты(ЭтотОбъект, Не ПоказатьТолькоВыбранныеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверхРеквизиты(Команда)
	
	ПереместитьВверх("Реквизиты");
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВнизРеквизиты(Команда)
	
	ПереместитьВниз("Реквизиты");
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсеДопРеквизиты(Команда)
	
	ТБ_СопоставлениеОбъектовКлиент.УстановитьПометки(
		Объект.ДополнительныеРеквизиты,
		Элементы.ДополнительныеРеквизиты,
		Истина,
		,
		Модифицированность);
	
	СортироватьТаблицуРеквизитов("ДополнительныеРеквизиты", Элементы.ДополнительныеРеквизиты.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьВсеДопРеквизиты(Команда)
	
	ТБ_СопоставлениеОбъектовКлиент.УстановитьПометки(
		Объект.ДополнительныеРеквизиты,
		Элементы.ДополнительныеРеквизиты,
		Ложь,
		,
		Модифицированность);
	
	СортироватьТаблицуРеквизитов("ДополнительныеРеквизиты", Элементы.ДополнительныеРеквизиты.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоВыбранныеДопРеквизиты(Команда)
	
	УстановитьПоказатьТолькоВыбранныеДопРеквизиты(ЭтотОбъект, Не ПоказатьТолькоВыбранныеДопРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверхДопРеквизиты(Команда)
	
	ПереместитьВверх("ДополнительныеРеквизиты");
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВнизДопРеквизиты(Команда)
	
	ПереместитьВниз("ДополнительныеРеквизиты");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСвойство(Команда)
	
	ТекущиеДанные = Элементы.ДополнительныеРеквизиты.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекущиеДанные.Свойство);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсеСвойстваИсточника(Команда)
	
	ТБ_СопоставлениеОбъектовКлиент.УстановитьПометки(
		Объект.СвойстваИсточника,
		Элементы.СвойстваИсточника,
		Истина,
		Новый Структура("Обязательно", Ложь),
		Модифицированность);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьВсеСвойстваИсточника(Команда)
	
	ТБ_СопоставлениеОбъектовКлиент.УстановитьПометки(
		Объект.СвойстваИсточника,
		Элементы.СвойстваИсточника,
		Ложь,
		Новый Структура("Обязательно", Ложь),
		Модифицированность);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПроверитьИзменитьПризнакГруппы(Форма, ПолноеИмяОбъекта)
	
	ТекЭлементы = Форма.Элементы;
	ТекОбъект = Форма.Объект;
	
	МожноСтавитьПризнак = Ложь;
	Если СтрНачинаетсяС(ПолноеИмяОбъекта, "Справочник.") ИЛИ СтрНачинаетсяС(ПолноеИмяОбъекта, "ПланВидовХарактеристик.") Тогда 
		МожноСтавитьПризнак = ЕстьИерархияГрупп(ПолноеИмяОбъекта);
	КонецЕсли;
	
	Если Не МожноСтавитьПризнак И ТекОбъект.СоздаватьГруппы Тогда 
		ТекОбъект.СоздаватьГруппы = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ТекЭлементы, "СоздаватьГруппы", "Доступность", МожноСтавитьПризнак);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьИерархияГрупп(ВыбранноеЗначение)

	ТекМетаданные = ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени(ВыбранноеЗначение);
	Если ТекМетаданные = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Если ТекМетаданные.Иерархический Тогда
		Если СтрНачинаетсяС(ВыбранноеЗначение, "ПланВидовХарактеристик.") Тогда
			Возврат Истина;	
		ИначеЕсли СтрНачинаетсяС(ВыбранноеЗначение, "Справочник.") И ТекМетаданные.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда 
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;	
	Иначе 		
		Возврат Ложь;
	КонецЕсли;

КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	
	УстановитьУсловноеОфрмлениеТаблицыРеквизитов("Реквизиты");
	УстановитьУсловноеОфрмлениеТаблицыРеквизитов("ДополнительныеРеквизиты");
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РеквизитыПометка.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Реквизиты.Обязательно");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РеквизитыПоиск.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ИмяТабличнойЧасти");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СвойстваИсточникаВключатьВПредставление.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ИмяТабличнойЧасти");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СвойстваИсточникаПометка.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СвойстваИсточника.Обязательно");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОфрмлениеТаблицыРеквизитов(Знач ИмяТаблицы)
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяТаблицы + "Реквизит"].Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТаблицы + ".Поиск");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ЖирныйШрифт);
	
	//
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ТБ_ВариантыЗаполнения.ЗначениеИсточника);
	СписокЗначений.Добавить(Перечисления.ТБ_ВариантыЗаполнения.ПоискПоКоду);
	СписокЗначений.Добавить(Перечисления.ТБ_ВариантыЗаполнения.ПоискПоНаименованию);
	СписокЗначений.Добавить(Перечисления.ТБ_ВариантыЗаполнения.ПоискПоСоответствию);
	СписокЗначений.Добавить(Перечисления.ТБ_ВариантыЗаполнения.Обработчик);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяТаблицы + "Значение"].Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТаблицы + ".ВариантЗаполнения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	//
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ТБ_ВариантыЗаполнения.ЗначениеИсточника);
	СписокЗначений.Добавить(Перечисления.ТБ_ВариантыЗаполнения.ПоискПоКоду);
	СписокЗначений.Добавить(Перечисления.ТБ_ВариантыЗаполнения.ПоискПоНаименованию);
	СписокЗначений.Добавить(Перечисления.ТБ_ВариантыЗаполнения.ПоискПоСоответствию);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяТаблицы + "СвойствоИсточника"].Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТаблицы + ".ВариантЗаполнения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяТаблицы + "Обработчик"].Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТаблицы + ".ВариантЗаполнения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТБ_ВариантыЗаполнения.Обработчик;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяТаблицы + "СвойствоИсточника"].Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяТаблицы + "Обработчик"].Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТаблицы + ".Пометка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЗаполнитьСписокВыбораНаименования(ЭтотОбъект, Элементы.Наименование.СписокВыбора);
	
	ТБ_СопоставлениеОбъектов.ЗаполнитьСвойстваИсточникаДанных(СвойстваИсточникаДанных, Объект.ИсточникДанных);
	
	ТБ_СопоставлениеОбъектов.ЗаполнитьСписокВыбораТабличнойЧасти(Элементы.ИмяТабличнойЧасти.СписокВыбора, Объект.ИмяОбъекта);
	
	ЗаполнитьСлужебныеРеквизиты("Реквизиты");
	ЗаполнитьСлужебныеРеквизиты("ДополнительныеРеквизиты");
	
	УстановитьДоступностьПоПриемникуДанных();
	
	Элементы.СтраницаОбработчикПередСопоставлением.Картинка   = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.ОбработчикПередСопоставлением);
	Элементы.СтраницаОбработчикПередОбработкой.Картинка       = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.ОбработчикПередОбработкой);
	Элементы.СтраницаОбработчикПослеЗаполненияСтроки.Картинка = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.ОбработчикПослеЗаполненияСтрокиТаблицы);
	Элементы.СтраницаОбработчикПередЗаписью.Картинка          = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.ОбработчикПередЗаписью);
	Элементы.СтраницаОбработчикПослеЗаписи.Картинка           = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.ОбработчикПослеЗаписи);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораНаименования(Форма, СписокВыбора)
	
	Объект = Форма.Объект;
	
	СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Объект.ВидНоменклатуры) Тогда
		
		Если ЗначениеЗаполнено(Объект.ПредставлениеТабличнойЧасти) Тогда
			
			СписокВыбора.Добавить(СтрШаблон("%1 - %2 [%3] (%4)",
				Объект.ИсточникДанных,
				Объект.ПредставлениеОбъекта,
				Объект.ПредставлениеТабличнойЧасти,
				Объект.ВидНоменклатуры));
			
		Иначе
			
			СписокВыбора.Добавить(СтрШаблон("%1 - %2 (%3)",
				Объект.ИсточникДанных,
				Объект.ПредставлениеОбъекта,
				Объект.ВидНоменклатуры));
			
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(Объект.ПредставлениеТабличнойЧасти) Тогда
			
			СписокВыбора.Добавить(СтрШаблон("%1 - %2 [%3]",
				Объект.ИсточникДанных,
				Объект.ПредставлениеОбъекта,
				Объект.ПредставлениеТабличнойЧасти));
			
		Иначе
			
			СписокВыбора.Добавить(СтрШаблон("%1 - %2",
				Объект.ИсточникДанных,
				Объект.ПредставлениеОбъекта));
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ПриИзмененииРеквизитов

&НаСервере
Процедура ИсточникДанныхПриИзмененииНаСервере()
	
	ТБ_СопоставлениеОбъектов.ЗаполнитьСвойстваИсточникаДанных(СвойстваИсточникаДанных, Объект.ИсточникДанных);
	
	ЗагрузитьСвойстваИсточникаДанных();
	
	ОбновитьОбязательныеСвойстваИсточника();
	ОчиститьОтсутствующиеСвойстваИсточника();
	
КонецПроцедуры

&НаСервере
Процедура ИмяОбъектаПриИзмененииНаСервере()
	
	УстановитьДоступностьПоПриемникуДанных();
	
	ТБ_СопоставлениеОбъектов.ЗаполнитьСписокВыбораТабличнойЧасти(Элементы.ИмяТабличнойЧасти.СписокВыбора, Объект.ИмяОбъекта);
	
	ЗагрузитьСвойстваПриемникаДанных();
	ОбновитьОбязательныеСвойстваИсточника();
	
КонецПроцедуры

&НаСервере
Процедура ИмяТабличнойЧастиПриИзмененииНаСервере()
	
	УстановитьДоступностьПоПриемникуДанных();
	
	ЗагрузитьСвойстваПриемникаДанных();
	ОбновитьОбязательныеСвойстваИсточника();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПолучитьЗначенияРеквизитовИзХранилища(ТекущийОбъект)
	
	Для каждого ТекущаяСтрока Из Объект.Реквизиты Цикл
		
		СтрокаТЧ = ТекущийОбъект.Реквизиты[ТекущаяСтрока.НомерСтроки - 1];
		ТекущаяСтрока.ТипЗначения = СтрокаТЧ.ТипЗначенияХранилище.Получить();
		ТекущаяСтрока.Значение    = СтрокаТЧ.ЗначениеХранилище.Получить();
		
	КонецЦикла;
	
	Для каждого ТекущаяСтрока Из Объект.ДополнительныеРеквизиты Цикл
		
		СтрокаТЧ = ТекущийОбъект.ДополнительныеРеквизиты[ТекущаяСтрока.НомерСтроки - 1];
		ТекущаяСтрока.ТипЗначения = СтрокаТЧ.ТипЗначенияХранилище.Получить();
		ТекущаяСтрока.Значение    = СтрокаТЧ.ЗначениеХранилище.Получить();
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизиты(Знач ИмяТаблицы)
	
	Для каждого ТекущаяСтрока Из Объект[ИмяТаблицы] Цикл
		ЗаполнитьСлужебныеРеквизитыВСтроке(ТекущаяСтрока);
	КонецЦикла;
	
	Если ИмяТаблицы = "Реквизиты" Тогда
		
		ТБ_СопоставлениеОбъектов.ЗаполнитьЗаполнятьОбязательноВТаблицеРеквизитов(
			Объект.Реквизиты,
			Объект.ИмяОбъекта,
			Объект.ВидНоменклатуры);
		
	Иначе
		
		ТБ_СопоставлениеОбъектов.ЗаполнитьЗаполнятьОбязательноВТаблицеДопРеквизитов(
			Объект.ДополнительныеРеквизиты,
			Объект.ИмяОбъекта,
			Объект.ВидНоменклатуры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыВСтроке(ТекущаяСтрока)
	
	//ТекущаяСтрока.Обязательно = ТекущаяСтрока.Имя = "Ссылка";
	ТекущаяСтрока.Обязательно = ТекущаяСтрока.Имя = "Ссылка" 
						И Объект.ТипПравила = ПредопределенноеЗначение("Перечисление.ТБ_ТипыПравилСопоставления.ЗагрузкаТабличнойЧасти");

	Типы = ТекущаяСтрока.ТипЗначения.Типы();
	ТипЗначения = ?(Типы.Количество() = 1, Типы[0], ТипЗнч(ТекущаяСтрока.Значение));
	
	ТипСсылка       = ОбщегоНазначения.ЭтоСсылка(ТипЗначения);
	ТипПеречисление = Перечисления.ТипВсеСсылки().СодержитТип(ТипЗначения);
	
	ТекущаяСтрока.ЕстьЗначениеИсточника = ТипЗначения = Тип("Число")
		Или ТипЗначения = Тип("Строка")
		Или ТипЗначения = Тип("Дата")
		Или ТипЗначения = Тип("Булево");
	
	ТекущаяСтрока.ЕстьПоискПоКоду         = Ложь;
	ТекущаяСтрока.ЕстьПоискПоНаименованию = Ложь;
	ТекущаяСтрока.ЕстьПоискПоСоответствию = Ложь;

	Если ТекущаяСтрока.Имя = "Ссылка" Тогда  
		//И Не ЗначениеЗаполнено(Объект.ИмяТабличнойЧасти) Тогда 
		ТекущаяСтрока.ЕстьЗначениеИсточника = Истина;
	КонецЕсли;
	
	Если ТипПеречисление Тогда
		
		ТекущаяСтрока.ЕстьПоискПоНаименованию = Истина;
		
	ИначеЕсли ТипСсылка Тогда
		
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗначения);
		
		Для каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
			
			Если Реквизит.Имя = "Код" Тогда
				
				ТекущаяСтрока.ЕстьПоискПоКоду = Истина;
				
			ИначеЕсли Реквизит.Имя = "Наименование" Тогда
				
				ТекущаяСтрока.ЕстьПоискПоНаименованию = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТекущаяСтрока.ЕстьПоискПоСоответствию = Истина;
		
	КонецЕсли;
	
	ТекущаяСтрока.ИндексКартинкиТип = ?(Типы.Количество() = 1, -1,
		?(ТекущаяСтрока.Значение = Неопределено, 2, 3));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПоПриемникуДанных()
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ВидНоменклатуры",
		"Видимость",
		ЕстьВидНоменклатуры());
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаДопРеквизиты",
		"Видимость",
		ЕстьДопРеквизиты());
		
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СтраницаОбработчикПослеЗаполненияСтроки",
		"Видимость",
		ЗначениеЗаполнено(Объект.ИмяТабличнойЧасти));
	
КонецПроцедуры

#Область ИсточникДанных

&НаСервере
Процедура ЗагрузитьСвойстваИсточникаДанных()
	
	ВыбранныеСвойства = Объект.СвойстваИсточника.Выгрузить(Новый Структура("Пометка", Истина),
		"Имя,ВключатьВИдентификатор,ВключатьВПредставление,Обязательно");
	
	Объект.СвойстваИсточника.Очистить();
	
	Для каждого Свойство Из СвойстваИсточникаДанных Цикл
		
		НоваяСтрока = Объект.СвойстваИсточника.Добавить();
		НоваяСтрока.Имя = Свойство.Имя;
		
		НайденныеСтроки = ВыбранныеСвойства.НайтиСтроки(Новый Структура("Имя", Свойство.Имя));
		Если НайденныеСтроки.Количество() <> 0 Тогда
			
			Если Не НайденныеСтроки[0].Обязательно
				Или НайденныеСтроки[0].ВключатьВИдентификатор
				Или НайденныеСтроки[0].ВключатьВПредставление Тогда
				
				НоваяСтрока.Пометка                = Истина;
				НоваяСтрока.ВключатьВИдентификатор = НайденныеСтроки[0].ВключатьВИдентификатор;
				НоваяСтрока.ВключатьВПредставление = НайденныеСтроки[0].ВключатьВПредставление;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ТБ_СопоставлениеОбъектов.ИнициализироватьКомпоновщик(
		КомпоновщикНастроек,
		УникальныйИдентификатор,
		СвойстваИсточникаДанных,
		НастройкиКомпоновки);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОбязательныеСвойстваИсточника()
	
	ВариантыЗаполнения = Новый Массив;
	ВариантыЗаполнения.Добавить(Перечисления.ТБ_ВариантыЗаполнения.ЗначениеИсточника);
	ВариантыЗаполнения.Добавить(Перечисления.ТБ_ВариантыЗаполнения.ПоискПоКоду);
	ВариантыЗаполнения.Добавить(Перечисления.ТБ_ВариантыЗаполнения.ПоискПоНаименованию);
	ВариантыЗаполнения.Добавить(Перечисления.ТБ_ВариантыЗаполнения.ПоискПоСоответствию);
	
	ОбязательныеСвойства = Новый Соответствие;
	ОбязательныеСвойства.Вставить("ИдентификаторИсточника",  Истина);
	ОбязательныеСвойства.Вставить("НомерСообщенияИсточника", Истина);
	
	Для каждого ТекущаяСтрока Из Объект.Реквизиты.НайтиСтроки(Новый Структура("Пометка", Истина)) Цикл
		
		Если ВариантыЗаполнения.Найти(ТекущаяСтрока.ВариантЗаполнения) <> Неопределено
			И ЗначениеЗаполнено(ТекущаяСтрока.СвойствоИсточника) Тогда
			ОбязательныеСвойства.Вставить(ТекущаяСтрока.СвойствоИсточника, Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого ТекущаяСтрока Из Объект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Пометка", Истина)) Цикл
		
		Если ВариантыЗаполнения.Найти(ТекущаяСтрока.ВариантЗаполнения) <> Неопределено
			И ЗначениеЗаполнено(ТекущаяСтрока.СвойствоИсточника) Тогда
			ОбязательныеСвойства.Вставить(ТекущаяСтрока.СвойствоИсточника, Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	ДобавитьОбязательныеСвойстваОтбора(КомпоновщикНастроек.Настройки.Отбор.Элементы, ОбязательныеСвойства);
	
	Для каждого СтрокаТаблицы Из Объект.СвойстваИсточника Цикл
		
		ТекущееЗначение = СтрокаТаблицы.Обязательно;
		
		СтрокаТаблицы.Обязательно = ОбязательныеСвойства.Получить(СтрокаТаблицы.Имя) <> Неопределено;
		
		Если СтрокаТаблицы.Обязательно Тогда
			
			СтрокаТаблицы.Пометка = Истина;
			
		ИначеЕсли ТекущееЗначение
			И Не СтрокаТаблицы.ВключатьВИдентификатор
			И Не СтрокаТаблицы.ВключатьВПредставление Тогда
			
			СтрокаТаблицы.Пометка = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОбязательныеСвойстваОтбора(Знач ЭлементыОтбора, ОбязательныеСвойства)
	
	Для каждого Элемент Из ЭлементыОтбора Цикл
		
		Если ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			Если Элемент.Использование Тогда
				ДобавитьОбязательныеСвойстваОтбора(Элемент.Элементы, ОбязательныеСвойства);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			Если Элемент.Использование Тогда
				
				Если ТипЗнч(Элемент.ЛевоеЗначение) = Тип("ПолеКомпоновкиДанных")
					И ЗначениеЗаполнено(Элемент.ЛевоеЗначение) Тогда
					
					ОбязательныеСвойства.Вставить(Строка(Элемент.ЛевоеЗначение), Истина);
					
				КонецЕсли;
				
				Если ТипЗнч(Элемент.ПравоеЗначение) = Тип("ПолеКомпоновкиДанных")
					И ЗначениеЗаполнено(Элемент.ПравоеЗначение) Тогда
					
					ОбязательныеСвойства.Вставить(Строка(Элемент.ПравоеЗначение), Истина);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьОтсутствующиеСвойстваИсточника()
	
	ПараметрыОтбора = Новый Структура("Имя,Тип");
	
	Для каждого ТекущаяСтрока Из Объект.Реквизиты Цикл
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.СвойствоИсточника) Тогда
			
			ПараметрыОтбора.Имя = ТекущаяСтрока.СвойствоИсточника;
			//ПараметрыОтбора.Тип = ?(ТекущаяСтрока.ВариантЗаполнения = Перечисления.ТБ_ВариантыЗаполнения.ЗначениеИсточника,
			//	Строка(ТекущаяСтрока.ТипЗначения),
			//	"Строка");
			ПараметрыОтбора.Тип = ?(ТекущаяСтрока.ВариантЗаполнения = Перечисления.ТБ_ВариантыЗаполнения.ЗначениеИсточника
					И Не ТекущаяСтрока.Имя = "Ссылка",
				Строка(ТекущаяСтрока.ТипЗначения),
				"Строка");
			Если СвойстваИсточникаДанных.НайтиСтроки(ПараметрыОтбора).Количество() = 0 Тогда
				ТекущаяСтрока.СвойствоИсточника = "";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого ТекущаяСтрока Из Объект.ДополнительныеРеквизиты Цикл
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.СвойствоИсточника) Тогда
			
			ПараметрыОтбора.Имя = ТекущаяСтрока.СвойствоИсточника;
			ПараметрыОтбора.Тип = ?(ТекущаяСтрока.ВариантЗаполнения = Перечисления.ТБ_ВариантыЗаполнения.ЗначениеИсточника,
				Строка(ТекущаяСтрока.ТипЗначения),
				"Строка");
			
			Если СвойстваИсточникаДанных.НайтиСтроки(ПараметрыОтбора).Количество() = 0 Тогда
				ТекущаяСтрока.СвойствоИсточника = "";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДанныеВыбораСвойстваИсточника(Знач Тип)
	
	Результат = Новый СписокЗначений;
	
	НайденныеСтроки = СвойстваИсточникаДанных.НайтиСтроки(Новый Структура("Тип", Тип));
	Для каждого Свойство Из НайденныеСтроки Цикл
		Результат.Добавить(Свойство.Имя, Свойство.Представление);
	КонецЦикла;
	
	Результат.СортироватьПоПредставлению();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПриемникДанных

&НаСервере
Процедура ЗагрузитьСвойстваПриемникаДанных()
	
	ЗаполнитьТаблицуРеквизитов();
	ЗаполнитьТаблицуДопРеквизитов();
	
	ОбновитьОтборСтрокТаблицыРеквизитов(ЭтотОбъект);
	ОбновитьОтборСтрокТаблицыДопРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

#Область ЗаполнениеТаблицыРеквизитов

&НаСервере
Процедура ЗаполнитьТаблицуРеквизитов()
	
	ТаблицаРеквизитов = Объект.Реквизиты.Выгрузить().СкопироватьКолонки();
	
	Если ЗначениеЗаполнено(Объект.ИмяТабличнойЧасти) Тогда
		
		ДобавитьРеквизитСсылка(ТаблицаРеквизитов, Объект.ИмяОбъекта);
		
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(Объект.ИмяОбъекта + ".ТабличнаяЧасть." + Объект.ИмяТабличнойЧасти);
		
		Для каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
			ДобавитьРеквизит(ТаблицаРеквизитов, Реквизит, Ложь, Истина);
		КонецЦикла;
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ИмяОбъекта) Тогда
		
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(Объект.ИмяОбъекта);
		
		Для Каждого Реквизит из  Метаданные.ОбщиеРеквизиты Цикл
			НайденыйОбъект = Реквизит.Состав.Найти(ОбъектМетаданных);
			
			Если НайденыйОбъект.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать Тогда
				ДобавитьРеквизит(ТаблицаРеквизитов, Реквизит, Ложь, Ложь);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого Реквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
			ДобавитьРеквизит(ТаблицаРеквизитов, Реквизит, Истина, Ложь);
		КонецЦикла;
		
		Для каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
			ДобавитьРеквизит(ТаблицаРеквизитов, Реквизит, Ложь, Ложь);
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаРеквизитов.Сортировать("Представление");
	
	//
	
	УдаляемыеСтроки = Новый Массив;
	ПараметрыОтбора = Новый Структура("Имя,ТипЗначения");
	
	Для каждого ТекущаяСтрока Из Объект.Реквизиты Цикл
		
		Если ТекущаяСтрока.Пометка Тогда
			
			ЗаполнитьЗначенияСвойств(ПараметрыОтбора, ТекущаяСтрока);
			
			НайденныеСтроки = ТаблицаРеквизитов.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() <> 0 Тогда
				
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, НайденныеСтроки[0], "Представление");
				ТаблицаРеквизитов.Удалить(НайденныеСтроки[0]);
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		
		УдаляемыеСтроки.Добавить(ТекущаяСтрока);
		
	КонецЦикла;
	
	Для каждого ТекущаяСтрока Из УдаляемыеСтроки Цикл
		Объект.Реквизиты.Удалить(ТекущаяСтрока);
	КонецЦикла;
	
	Для каждого ТекущаяСтрока Из ТаблицаРеквизитов Цикл
		ЗаполнитьЗначенияСвойств(Объект.Реквизиты.Добавить(), ТекущаяСтрока);
	КонецЦикла;
	
	ЗаполнитьСлужебныеРеквизиты("Реквизиты");
	СортироватьТаблицуРеквизитов("Реквизиты");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьРеквизитСсылка(ТаблицаРеквизитов, Знач ИмяОбъекта)
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ИмяОбъекта);
	
	Представление = СтрШаблон(НСтр("ru = '%1 [Ссылка]'"), ОбщегоНазначения.ПредставлениеОбъекта(ОбъектМетаданных));
	ОписаниеТипов = ОбъектМетаданных.СтандартныеРеквизиты.Ссылка.Тип;
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.Имя               = "Ссылка";
	НоваяСтрока.Представление     = Представление;
	НоваяСтрока.ТипЗначения       = ОписаниеТипов;
	НоваяСтрока.Значение          = ОписаниеТипов.ПривестиЗначение(Неопределено);
	НоваяСтрока.ВариантЗаполнения = Перечисления.ТБ_ВариантыЗаполнения.Значение;
	НоваяСтрока.Пометка           = Истина;
	НоваяСтрока.Поиск             = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьРеквизит(ТаблицаРеквизитов, Знач Реквизит, Знач Стандартный, Знач РеквизитТЧ)
	
	//ИсключаемыеРеквизиты = СтрРазделить("Ссылка,ЭтоГруппа,Предопределенный,ИмяПредопределенныхДанных", ",");
	ИсключаемыеРеквизиты = СтрРазделить("ЭтоГруппа,Предопределенный,ИмяПредопределенныхДанных", ",");
	
	Если ИсключаемыеРеквизиты.Найти(Реквизит.Имя) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Представление = Реквизит.Синоним;
	
	Если Не ЗначениеЗаполнено(Представление) И Стандартный Тогда
		
		Представления = Новый Соответствие;
		Представления.Вставить("ПометкаУдаления", "Пометка удаления");
		
		Представление = Представления.Получить(Реквизит.Имя);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Представление) Тогда
		Представление = Реквизит.Имя;
	КонецЕсли;
	
	Если Стандартный Тогда
		Представление = Представление + СтрШаблон(" [%1]", Реквизит.Имя);
	КонецЕсли;
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.Имя               = Реквизит.Имя;
	НоваяСтрока.Представление     = Представление;
	НоваяСтрока.ТипЗначения       = Реквизит.Тип;
	НоваяСтрока.Значение          = Реквизит.Тип.ПривестиЗначение(?(РеквизитТЧ, Неопределено, Реквизит.ЗначениеЗаполнения));
	НоваяСтрока.ВариантЗаполнения = Перечисления.ТБ_ВариантыЗаполнения.Значение;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеТаблицыДопРеквизитов

&НаСервере
Процедура ЗаполнитьТаблицуДопРеквизитов()
	
	Если Не ЕстьДопРеквизиты() Тогда
		
		Объект.ДополнительныеРеквизиты.Очистить();
		Возврат;
		
	КонецЕсли;
	
	//
	
	НаборыСвойств = Новый СписокЗначений;
	
	Если Объект.ИмяОбъекта = "Справочник.Номенклатура" Тогда
		
		НаборыСвойств.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Номенклатура_Общие"));
		
		Если ЗначениеЗаполнено(Объект.ВидНоменклатуры) Тогда
			ИмяРеквизитаНаборСвойств = "НаборСвойств";
			НаборыСвойств.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидНоменклатуры, ИмяРеквизитаНаборСвойств));
		КонецЕсли;
		
	ИначеЕсли Объект.ИмяОбъекта = "Справочник.Партнеры" Тогда
		
		Клиент          = Истина;
		Конкурент       = Истина;
		Поставщик       = Истина;
		ПрочиеОтношения = Истина;
		
		НаборыСвойств = УправлениеСвойствамиПереопределяемый.ПолучитьНаборыСвойствДляПартнеров(Клиент, Конкурент, Поставщик, ПрочиеОтношения);
		
	ИначеЕсли Объект.ИмяОбъекта = "Справочник.СерииНоменклатуры" Тогда
		
		НаборыСвойств.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_СерииНоменклатуры_Общие"));
		
		Если ЗначениеЗаполнено(Объект.ВидНоменклатуры) Тогда
			ИмяРеквизитаНаборСвойствСерий = "НаборСвойствСерий";
			НаборыСвойств.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидНоменклатуры, ИмяРеквизитаНаборСвойствСерий));
		КонецЕсли;
		
	ИначеЕсли Объект.ИмяОбъекта = "Справочник.ХарактеристикиНоменклатуры" Тогда
		
		НаборыСвойств.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_ХарактеристикиНоменклатуры_Общие"));
		
		Если ЗначениеЗаполнено(Объект.ВидНоменклатуры) Тогда
			ИмяРеквизитаНаборСвойствХарактеристик = "НаборСвойствХарактеристик";
			НаборыСвойств.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидНоменклатуры, ИмяРеквизитаНаборСвойствХарактеристик));
		КонецЕсли;
		
	Иначе
		НаборыСвойств.Добавить(УправлениеСвойствами.НаборСвойствПоИмени(СтрЗаменить(Объект.ИмяОбъекта, ".", "_")));
	КонецЕсли;
	
	ТаблицаДопРеквизитов = Объект.ДополнительныеРеквизиты.Выгрузить().СкопироватьКолонки();
	
	НаборыСвойствМассив = Новый Массив;

	Для каждого НаборСвойств Из НаборыСвойств Цикл
		НаборыСвойствМассив.Добавить(НаборСвойств.Значение);
	КонецЦикла;

	Если НаборыСвойствМассив.Количество() > 0 Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДопРеквизитыСведения.Ссылка КАК НаборСвойств,
		|	ДопРеквизитыСведения.Свойство КАК Свойство,
		|	ДопРеквизитыСведения.Свойство.Имя КАК Имя,
		|	ДопРеквизитыСведения.Свойство.Заголовок КАК Представление,
		|	ДопРеквизитыСведения.Свойство.ТипЗначения КАК ТипЗначения
		|ИЗ
		|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ДопРеквизитыСведения
		|ГДЕ
		|	ДопРеквизитыСведения.Ссылка В (&НаборыСвойств)
		|	И НЕ ДопРеквизитыСведения.Свойство.ПометкаУдаления");

		Запрос.УстановитьПараметр("НаборыСвойств", НаборыСвойствМассив);

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДобавитьДопРеквизит(ТаблицаДопРеквизитов, Выборка);
		КонецЦикла;

	КонецЕсли;

	ТаблицаДопРеквизитов.Сортировать("Представление");
	
	//
	
	УдаляемыеСтроки = Новый Массив;
	ПараметрыОтбора = Новый Структура("Свойство,ТипЗначения");
	
	Для каждого ТекущаяСтрока Из Объект.ДополнительныеРеквизиты Цикл
		
		Если ТекущаяСтрока.Пометка Тогда
			
			ЗаполнитьЗначенияСвойств(ПараметрыОтбора, ТекущаяСтрока);
			
			НайденныеСтроки = ТаблицаДопРеквизитов.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() <> 0 Тогда
				
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, НайденныеСтроки[0], "Имя,Представление");
				ТаблицаДопРеквизитов.Удалить(НайденныеСтроки[0]);
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		
		УдаляемыеСтроки.Добавить(ТекущаяСтрока);
		
	КонецЦикла;
	
	Для каждого ТекущаяСтрока Из УдаляемыеСтроки Цикл
		Объект.ДополнительныеРеквизиты.Удалить(ТекущаяСтрока);
	КонецЦикла;
	
	Для каждого ТекущаяСтрока Из ТаблицаДопРеквизитов Цикл
		ЗаполнитьЗначенияСвойств(Объект.ДополнительныеРеквизиты.Добавить(), ТекущаяСтрока);
	КонецЦикла;
	
	ЗаполнитьСлужебныеРеквизиты("ДополнительныеРеквизиты");
	СортироватьТаблицуРеквизитов("ДополнительныеРеквизиты");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьДопРеквизит(ТаблицаДопРеквизитов, Знач Реквизит)
	
	НоваяСтрока = ТаблицаДопРеквизитов.Добавить();
	НоваяСтрока.Свойство          = Реквизит.Свойство;
	НоваяСтрока.Имя               = Реквизит.Имя;
	НоваяСтрока.Представление     = Реквизит.Представление;
	НоваяСтрока.ТипЗначения       = Реквизит.ТипЗначения;
	НоваяСтрока.Значение          = Реквизит.ТипЗначения.ПривестиЗначение(НоваяСтрока.Значение);
	НоваяСтрока.ВариантЗаполнения = Перечисления.ТБ_ВариантыЗаполнения.Значение;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура СортироватьТаблицуРеквизитов(ИмяТаблицы, ТекущаяСтрока = Неопределено)
	
	ТБ_СопоставлениеОбъектов.СортироватьТаблицуРеквизитов(Объект[ИмяТаблицы], ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Функция ЕстьВидНоменклатуры()
	
	Возврат Не ЗначениеЗаполнено(Объект.ИмяТабличнойЧасти)
		И (Объект.ИмяОбъекта = "Справочник.Номенклатура"
			Или Объект.ИмяОбъекта = "Справочник.СерииНоменклатуры"
			Или Объект.ИмяОбъекта = "Справочник.ХарактеристикиНоменклатуры");
	
КонецФункции

&НаСервере
Функция ЕстьДопРеквизиты()
	
	Если ЗначениеЗаполнено(Объект.ИмяОбъекта)
		И Не ЗначениеЗаполнено(Объект.ИмяТабличнойЧасти) Тогда
		
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(Объект.ИмяОбъекта);
		
		Если ОбъектМетаданных <> Неопределено Тогда
			Возврат ОбъектМетаданных.ТабличныеЧасти.Найти("ДополнительныеРеквизиты") <> Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ПроверитьРеквизитыИЗначенияНаСервере()
	
	ТБ_СопоставлениеОбъектов.ЗаполнитьСвойстваИсточникаДанных(СвойстваИсточникаДанных, Объект.ИсточникДанных);
	
	ЗагрузитьСвойстваИсточникаДанных();
	ЗагрузитьСвойстваПриемникаДанных();
	
	ОбновитьОбязательныеСвойстваИсточника();
	ОчиститьОтсутствующиеСвойстваИсточника();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПоказатьТолькоВыбранныеРеквизиты(Форма, Знач Значение)
	
	Форма.ПоказатьТолькоВыбранныеРеквизиты = Значение;
	Форма.Элементы.ПоказатьТолькоВыбранныеРеквизиты.Пометка = Значение;
	
	ОбновитьОтборСтрокТаблицыРеквизитов(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьОтборСтрокТаблицыРеквизитов(Форма)
	
	ОтборСтрок = Новый Структура;
	
	Если Форма.ПоказатьТолькоВыбранныеРеквизиты Тогда
		ОтборСтрок.Вставить("Пометка", Истина);
	КонецЕсли;
	
	Форма.Элементы.Реквизиты.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПоказатьТолькоВыбранныеДопРеквизиты(Форма, Знач Значение)
	
	Форма.ПоказатьТолькоВыбранныеДопРеквизиты = Значение;
	Форма.Элементы.ПоказатьТолькоВыбранныеДопРеквизиты.Пометка = Значение;
	
	ОбновитьОтборСтрокТаблицыДопРеквизитов(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьОтборСтрокТаблицыДопРеквизитов(Форма)
	
	ОтборСтрок = Новый Структура;
	
	Если Форма.ПоказатьТолькоВыбранныеДопРеквизиты Тогда
		ОтборСтрок.Вставить("Пометка", Истина);
	КонецЕсли;
	
	Форма.Элементы.ДополнительныеРеквизиты.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Знач ИмяТаблицы)
	
	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.Пометка Тогда
		
		СтрокаТаблицы = Объект[ИмяТаблицы].НайтиПоИдентификатору(Элементы[ИмяТаблицы].ТекущаяСтрока);
		
		Индекс = Объект[ИмяТаблицы].Индекс(СтрокаТаблицы);
		Если Индекс > 0 Тогда
			
			Объект[ИмяТаблицы].Сдвинуть(Индекс, -1);
			Модифицированность = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Знач ИмяТаблицы)
	
	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.Пометка Тогда
		
		СтрокаТаблицы = Объект[ИмяТаблицы].НайтиПоИдентификатору(Элементы[ИмяТаблицы].ТекущаяСтрока);
		
		Индекс = Объект[ИмяТаблицы].Индекс(СтрокаТаблицы);
		Если Индекс < Объект[ИмяТаблицы].Количество() - 1 И Объект[ИмяТаблицы][Индекс + 1].Пометка Тогда
			
			Объект[ИмяТаблицы].Сдвинуть(Индекс, 1);
			Модифицированность = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуВТаблицеРеквизитов(Знач ИмяТаблицы)
	
	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	
	Если Не ТекущиеДанные.Пометка Тогда
		
		ТекущиеДанные.Пометка = Истина;
		СортироватьТаблицуРеквизитов(ИмяТаблицы, Элементы[ИмяТаблицы].ТекущаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборТипаЗначения(Элемент, Знач ИмяТаблицы)
	
	Типы = Элемент.ТекущиеДанные.ТипЗначения.Типы();
	Если Типы.Количество() > 1 Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяТаблицы", ИмяТаблицы);
		
		Оповещение = Новый ОписаниеОповещения("ВыборТипаЗначенияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		СписокТипов = Новый СписокЗначений;
		СписокТипов.ЗагрузитьЗначения(Типы);
		СписокТипов.СортироватьПоЗначению();
		СписокТипов.Добавить("Очистить", НСтр("ru = 'Очистить'"), , БиблиотекаКартинок.ПолеВводаОчистить);
		
		ПоказатьВыборИзСписка(Оповещение, СписокТипов, Элементы[ИмяТаблицы + "ИндексКартинкиТип"]);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборТипаЗначенияЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		ИмяТаблицы = ДополнительныеПараметры.ИмяТаблицы;
		ТекущиеДанные = Элементы[Имятаблицы].ТекущиеДанные;
		
		Если ВыбранныйЭлемент.Значение = "Очистить" Тогда
			ТекущиеДанные.Значение = Неопределено;
		Иначе
			
			ОписаниеТипов = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранныйЭлемент.Значение));
			ТекущиеДанные.Значение = ОписаниеТипов.ПривестиЗначение(ТекущиеДанные.Значение);
			
		КонецЕсли;
		
		ЗначениеПриИзмененииНаСервере(Имятаблицы, Элементы[ИмяТаблицы].ТекущаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗначениеПриИзмененииНаСервере(Знач ИмяТаблицы, Знач ИдентификаторСтроки)
	
	ТекущаяСтрока = Объект[ИмяТаблицы].НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ЗаполнитьСлужебныеРеквизитыВСтроке(ТекущаяСтрока);
	
	Если ТекущаяСтрока.ВариантЗаполнения = Перечисления.ТБ_ВариантыЗаполнения.ЗначениеИсточника Тогда
		
		ОчиститьВариантЗаполнения = Не ТекущаяСтрока.ЕстьЗначениеИсточника;
		
	ИначеЕсли ТекущаяСтрока.ВариантЗаполнения = Перечисления.ТБ_ВариантыЗаполнения.ПоискПоКоду Тогда
		
		ОчиститьВариантЗаполнения = Не ТекущаяСтрока.ЕстьПоискПоКоду;
		
	ИначеЕсли ТекущаяСтрока.ВариантЗаполнения = Перечисления.ТБ_ВариантыЗаполнения.ПоискПоНаименованию Тогда
		
		ОчиститьВариантЗаполнения = Не ТекущаяСтрока.ЕстьПоискПоНаименованию;
		
	ИначеЕсли ТекущаяСтрока.ВариантЗаполнения = Перечисления.ТБ_ВариантыЗаполнения.ПоискПоСоответствию Тогда
		
		ОчиститьВариантЗаполнения = Не ТекущаяСтрока.ЕстьПоискПоСоответствию;
		
	Иначе
		ОчиститьВариантЗаполнения = Ложь;
	КонецЕсли;
	
	Если ОчиститьВариантЗаполнения Тогда
		ТекущаяСтрока.ВариантЗаполнения = Перечисления.ТБ_ВариантыЗаполнения.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяОбъектаОбработкаВыбораНаСервере(ВыбранноеЗначение) 
	Возврат Новый Структура("Наименование, ПолноеИмя", ВыбранноеЗначение.Наименование, ВыбранноеЗначение.ПолноеИмя);
КонецФункции

#КонецОбласти

