
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ВключитьРежимСопоставления");
	ИменаЭлементов.Добавить("ИсточникДанных");
	ИменаЭлементов.Добавить("ДанныеИсточника");
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		ИменаЭлементов,
		"Видимость",
		ЗначениеЗаполнено(Запись.ИсточникДанных));
	
	Элементы.ГруппаСопоставление.Видимость   = Ложь;
	Элементы.ГруппаДанныеПриемника.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗагрузитьСвойстваИсточникаДанных(Запись.ИсточникДанных);
	ЗагрузитьСвойстваПриемникаДанных(Запись.ПравилоСопоставления);
	
	Элементы.ИсточникДанных.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ИмяОбъекта = РегистрыСведений.ТБ_СоответствияОбъектов.ИмяОбъекта(ТекущийОбъект.Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_СоответствияОбъектов", ПараметрыЗаписи, Запись.ИсходныйКлючЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПравилоСопоставленияПриИзменении(Элемент)
	
	ПравилоСопоставленияПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьРежимСопоставления(Команда)
	
	РежимСопоставления = Не РежимСопоставления;
	Элементы.ВключитьРежимСопоставления.Пометка = РежимСопоставления;
	
	Если РежимСопоставления Тогда
		ЗаполнитьРеквизитыПоОбъектуНаСервере();
	КонецЕсли;
	
	Элементы.ГруппаСопоставление.Видимость   = РежимСопоставления;
	Элементы.ГруппаДанныеПриемника.Видимость = РежимСопоставления;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоОбъекту(Команда)
	
	ОчиститьСообщения();
	
	ЗаполнитьРеквизитыПоОбъектуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоПравилу(Команда)
	
	ОчиститьСообщения();
	
	ЗаполнитьРеквизитыПоПравилуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьОбъекты(Команда)
	
	ОчиститьСообщения();
	
	СопоставитьОбъектыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПриИзмененииРеквизитов

&НаСервере
Процедура ПравилоСопоставленияПриИзмененииНаСервере()
	
	ЗагрузитьСвойстваИсточникаДанных(Запись.ИсточникДанных);
	ЗагрузитьСвойстваПриемникаДанных(Запись.ПравилоСопоставления);
	
	Запись.Объект = Элементы.Объект.ОграничениеТипа.ПривестиЗначение(Запись.Объект);
	
КонецПроцедуры

#КонецОбласти

#Область ИсточникДанных

&НаСервере
Процедура ЗагрузитьСвойстваИсточникаДанных(Знач ИсточникДанных)
	
	Если Не ЗначениеЗаполнено(Запись.ДанныеИсточника) Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьПоляИсточникаДанных();
	
	ТБ_СопоставлениеОбъектов.ЗаполнитьСвойстваИсточникаДанныхПоПравилу(
		СвойстваИсточникаДанных,
		Запись.ПравилоСопоставления);
	
	// Заполнение полей данными источника.
	ДанныеИсточника = ТБ_СопоставлениеОбъектов.ЗначениеJSON(Запись.ДанныеИсточника);
	
	Для каждого СтрокаТаблицы Из СвойстваИсточникаДанных Цикл
		
		СтрокаТаблицы.ТипЗначения = Новый ОписаниеТипов(СтрокаТаблицы.Тип);
		
		Если ДанныеИсточника.Свойство(СтрокаТаблицы.Имя) Тогда
			
			Если СтрокаТаблицы.Тип = "Дата" Тогда
				СтрокаТаблицы.Значение = ПрочитатьДатуJSON(ДанныеИсточника[СтрокаТаблицы.Имя], ФорматДатыJSON.ISO);
			Иначе
				СтрокаТаблицы.Значение = ДанныеИсточника[СтрокаТаблицы.Имя];
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДобавитьПоляИсточникаДанных();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПоляИсточникаДанных()
	
	Для каждого СтрокаТаблицы Из СвойстваИсточникаДанных Цикл
		
		Если СтрокаТаблицы.Имя = "Идентификатор" Тогда
			Продолжить;
		КонецЕсли;
		
		Элементы.Удалить(Элементы["Источник_" + СтрокаТаблицы.Имя]);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоляИсточникаДанных()
	
	Попытка
		
		Для каждого СтрокаТаблицы Из СвойстваИсточникаДанных Цикл
			
			Если СтрокаТаблицы.Имя = "Идентификатор" Тогда
				Продолжить;
			КонецЕсли;
			
			ПутьКДанным = СтрШаблон("СвойстваИсточникаДанных[%1].Значение", Формат(СвойстваИсточникаДанных.Индекс(СтрокаТаблицы), "ЧГ=0"));
			
			НовыйЭлемент = ТБ_СопоставлениеОбъектов.ДобавитьПолеФормы(
				Элементы, "Источник_" + СтрокаТаблицы.Имя, СтрокаТаблицы.Представление, ПутьКДанным,
				Элементы.ГруппаДанныеИсточника);
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.ОграничениеТипа = СтрокаТаблицы.ТипЗначения;
			НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
			НовыйЭлемент.МаксимальнаяШирина = 30;
			
		КонецЦикла;
		
	Исключение
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка при создании реквизитов источника:
			|%1'"),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗагрузитьСвойстваПриемникаДанных(Знач Правило)
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Правило, "ИмяОбъекта,ВидНоменклатуры");
	
	Если ЗначениеЗаполнено(ЗначенияРеквизитов.ИмяОбъекта) Тогда
		
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ЗначенияРеквизитов.ИмяОбъекта);
		ОписаниеТипов = ОбъектМетаданных.СтандартныеРеквизиты.Ссылка.Тип;
		
	Иначе
		ОписаниеТипов = Метаданные.РегистрыСведений.ТБ_СоответствияОбъектов.Ресурсы.Объект.Тип;
	КонецЕсли;
	
	Элементы.Объект.ОграничениеТипа = ОписаниеТипов;
	
	//
	
	ТБ_СопоставлениеОбъектов.ЗагрузитьПравилоСопоставления(
		Правило,
		ТаблицаРеквизитов,
		ТаблицаДопРеквизитов);
	
	// Добавление полей формы приемника.
	ДобавитьПоляПриемникаДанных(ЗначенияРеквизитов.ИмяОбъекта);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоляПриемникаДанных(Знач ПолноеИмяОбъекта)
	
	ИмяГруппы = "ГруппаОбъект";
	
	Если Элементы.Найти(ИмяГруппы) <> Неопределено Тогда
		Элементы.Удалить(Элементы[ИмяГруппы]);
	КонецЕсли;
	
	ПредставлениеОбъекта = ТБ_СопоставлениеОбъектовПовтИсп.ПредставлениеОбъектаМетаданных(ПолноеИмяОбъекта);
	
	НоваяГруппа = ТБ_СопоставлениеОбъектов.ДобавитьГруппуФормы(
		Элементы, ИмяГруппы, ПредставлениеОбъекта,
		Элементы.ГруппаДанныеПриемника);
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	
	Попытка
		
		// Добавление реквизитов объекта.
		Для каждого СтрокаТаблицы Из ТаблицаРеквизитов Цикл
			
			ПутьКДанным = СтрШаблон("ТаблицаРеквизитов[%1].Значение", Формат(ТаблицаРеквизитов.Индекс(СтрокаТаблицы), "ЧГ=0"));
			
			НовыйЭлемент = ТБ_СопоставлениеОбъектов.ДобавитьПолеФормы(
				Элементы, "Объект_" + СтрокаТаблицы.Имя, СтрокаТаблицы.Представление, ПутьКДанным,
				НоваяГруппа);
			НовыйЭлемент.ОграничениеТипа = СтрокаТаблицы.ТипЗначения;
			НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
			НовыйЭлемент.МаксимальнаяШирина = 30;
			
			Если СтрокаТаблицы.Поиск Тогда
				НовыйЭлемент.ШрифтЗаголовка = ШрифтыСтиля.ЖирныйШрифт;
			КонецЕсли;
			
			Если СтрДлина(СтрокаТаблицы.Представление) > 20 Тогда
				НовыйЭлемент.ВысотаЗаголовка = 2;
			КонецЕсли;
			
			Если СтрокаТаблицы.ЗаполнятьОбязательно Или СтрокаТаблицы.ЗаполнятьОбязательноПоУмолчанию Тогда
				НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		// Добавление доп. реквизитов объекта.
		Для каждого СтрокаТаблицы Из ТаблицаДопРеквизитов Цикл
			
			ПутьКДанным = СтрШаблон("ТаблицаДопРеквизитов[%1].Значение", Формат(ТаблицаДопРеквизитов.Индекс(СтрокаТаблицы), "ЧГ=0"));
			
			НовыйЭлемент = ТБ_СопоставлениеОбъектов.ДобавитьПолеФормы(
				Элементы, "Объект_" + СтрокаТаблицы.Имя, СтрокаТаблицы.Представление, ПутьКДанным,
				НоваяГруппа);
			НовыйЭлемент.ОграничениеТипа = СтрокаТаблицы.ТипЗначения;
			НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
			НовыйЭлемент.МаксимальнаяШирина = 30;
			
			Если СтрокаТаблицы.ТипЗначения.Типы().Найти(Тип("СправочникСсылка.ЗначенияСвойствОбъектов")) <> Неопределено Тогда
				
				ПараметрВыбора = Новый ПараметрВыбора("Отбор.Владелец", СтрокаТаблицы.Свойство);
				Массив = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрВыбора);
				
			Иначе
				Массив = Новый Массив;
			КонецЕсли;
			
			НовыйЭлемент.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
			
			Если СтрокаТаблицы.Поиск Тогда
				НовыйЭлемент.ШрифтЗаголовка = ШрифтыСтиля.ЖирныйШрифт;
			КонецЕсли;
			
			Если СтрДлина(СтрокаТаблицы.Представление) > 20 Тогда
				НовыйЭлемент.ВысотаЗаголовка = 2;
			КонецЕсли;
			
			Если СтрокаТаблицы.ЗаполнятьОбязательно Или СтрокаТаблицы.ЗаполнятьОбязательноПоУмолчанию Тогда
				НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка при создании реквизитов приемника:
			|%1'"),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПоОбъектуНаСервере()
	
	ПараметрыСопоставления = ТБ_СопоставлениеОбъектов.ПараметрыСопоставления();
	ПараметрыСопоставления["ТаблицаРеквизитов"]    = ТаблицаРеквизитов;
	ПараметрыСопоставления["ТаблицаДопРеквизитов"] = ТаблицаДопРеквизитов;
	
	ТаблицаДанных = ТБ_СопоставлениеОбъектов.ТаблицаДанныхДляСопоставления(ПараметрыСопоставления);
	
	СтрокаДанных = ТБ_СопоставлениеОбъектов.ДобавитьСтрокуДанныхПоОбъекту(
		ТаблицаДанных,
		Запись.Идентификатор,
		Запись.Объект,
		Запись.ПравилоСопоставления,
		ПараметрыСопоставления);
	
	Если Не СтрокаДанных.Отказ Тогда
		ЗаполнитьРеквизитыПолученнымиЗначениями(СтрокаДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПоПравилуНаСервере()
	
	ПараметрыСопоставления = ТБ_СопоставлениеОбъектов.ПараметрыСопоставления();
	ПараметрыСопоставления["ТаблицаРеквизитов"]    = ТаблицаРеквизитов;
	ПараметрыСопоставления["ТаблицаДопРеквизитов"] = ТаблицаДопРеквизитов;
	
	ТаблицаДанных = ТБ_СопоставлениеОбъектов.ТаблицаДанныхДляСопоставления(ПараметрыСопоставления);
	
	СтрокаДанных = ТБ_СопоставлениеОбъектов.ДобавитьСтрокуДанных(
		ТаблицаДанных,
		1,
		Запись.Идентификатор,
		СтруктураДанныхИсточника(),
		ПараметрыСопоставления);
	
	Если Не СтрокаДанных.Отказ Тогда
		ЗаполнитьРеквизитыПолученнымиЗначениями(СтрокаДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СтруктураДанныхИсточника()
	
	Результат = Новый Структура;
	
	Для каждого СтрокаТаблицы Из СвойстваИсточникаДанных Цикл
		Результат.Вставить(СтрокаТаблицы.Имя, СтрокаТаблицы.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизитыПолученнымиЗначениями(Знач СтрокаДанных)
	
	Для каждого СтрокаТаблицы Из ТаблицаРеквизитов Цикл
		СтрокаТаблицы.Значение = СтрокаДанных["Объект_" + СтрокаТаблицы.Имя];
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из ТаблицаДопРеквизитов Цикл
		СтрокаТаблицы.Значение = СтрокаДанных["Объект_" + СтрокаТаблицы.Имя];
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьОбъектыНаСервере()
	
	ПараметрыСопоставления = ТБ_СопоставлениеОбъектов.ПараметрыСопоставления();
	ПараметрыСопоставления["ТаблицаРеквизитов"]            = ТаблицаРеквизитов;
	ПараметрыСопоставления["ТаблицаДопРеквизитов"]         = ТаблицаДопРеквизитов;
	ПараметрыСопоставления.СоздаватьНовыеОбъекты        = Истина;
	ПараметрыСопоставления.ОбновлятьСуществующиеОбъекты = Истина;
	
	ТаблицаДанных = ТБ_СопоставлениеОбъектов.ТаблицаДанныхДляСопоставления(ПараметрыСопоставления);
	
	СтрокаДанных = ТБ_СопоставлениеОбъектов.ДобавитьСтрокуДанныхПоЗначениям(
		ТаблицаДанных,
		Запись.Идентификатор,
		ПараметрыСопоставления);
	
	НезаполненныеПоля = ТБ_СопоставлениеОбъектов.ПроверитьЗаполнениеСтрокиДанных(СтрокаДанных, ПараметрыСопоставления);
	Если НезаполненныеПоля.Количество() <> 0 Тогда
		
		Для каждого Поле Из НезаполненныеПоля Цикл
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Поле %1 не заполнено'"), Поле);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЦикла;
		Возврат;
		
	КонецЕсли;
	
	//
	
	Отказ = Ложь;
	
	Если ЗначениеЗаполнено(Запись.ПравилоСопоставления) Тогда
		ТБ_СопоставлениеОбъектов.НайтиСоздатьОбъекты(
			ТаблицаДанных,
			Запись.ПравилоСопоставления,
			ПараметрыСопоставления,
			Отказ);
	КонецЕсли;
	
	//
	
	Если Не Отказ Тогда
		Запись.Объект = СтрокаДанных.Объект;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
