#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет структуру параметрами загрузки по настройке загрузки объектов.
//
// Параметры:
//  Параметры - Структура - структура, в которую записываются параметры.
//  НастройкаЗагрузки - СправочникСсылка.ТБ_НастройкиЗагрузкиОбъектов - настройка загрузки.
//
Процедура ПолучитьПараметрыЗагрузки(Параметры, Знач НастройкаЗагрузки) Экспорт
	
	Если Не ЗначениеЗаполнено(НастройкаЗагрузки) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиЗагрузкиОбъектов.ИмяОбъекта КАК ИмяОбъекта,
	|	НастройкиЗагрузкиОбъектов.ПравилоСопоставления.ИсточникДанных КАК ИсточникДанных,
	|	НастройкиЗагрузкиОбъектов.ПравилоСопоставления КАК ПравилоСопоставления
	|ИЗ
	|	Справочник.ТБ_НастройкиЗагрузкиОбъектов КАК НастройкиЗагрузкиОбъектов
	|ГДЕ
	|	НастройкиЗагрузкиОбъектов.Ссылка = &НастройкаЗагрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабличныеЧасти.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ТабличныеЧасти.ПравилоСопоставления КАК ПравилоСопоставления
	|ИЗ
	|	Справочник.ТБ_НастройкиЗагрузкиОбъектов.ТабличныеЧасти КАК ТабличныеЧасти
	|ГДЕ
	|	ТабличныеЧасти.Ссылка = &НастройкаЗагрузки");
	
	Запрос.УстановитьПараметр("НастройкаЗагрузки", НастройкаЗагрузки);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(Параметры, Выборка);
	
	Параметры.ТабличныеЧасти = РезультатЗапроса[1].Выгрузить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли