
#Область СлужебныеПроцедурыИФункции

&НаСервере
&После("ИнициализироватьРеквизитыЛокализация")
Процедура ТБ_ИнициализироватьРеквизитыЛокализация()
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	ЗаполнитьЗначенияСвойств(СвойстваСписка, СписокПлатежей);
	
	МодификацияКонфигурацииПереопределяемый.ТБ_ДоработатьЗапросДинамическогоСпискаЖурналаДокументов(
		СвойстваСписка.ТекстЗапроса,
		"РеестрДокументов");
	
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.СписокПлатежей, СвойстваСписка);
	
КонецПроцедуры

#КонецОбласти
