
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресТаблицыИсточника = ПоместитьВоВременноеХранилище(Новый ТаблицаЗначений, УникальныйИдентификатор);
	
	Если ТипЗнч(Параметры.НастройкиЗагрузки) = Тип("Массив") Тогда
		
		Если Параметры.НастройкиЗагрузки.Количество() = 1 Тогда
			
			НастройкаЗагрузки = Параметры.НастройкиЗагрузки[0];
			
			Элементы.НастройкаЗагрузки.Видимость = Ложь;
			НастройкаЗагрузкиПриИзмененииНаСервере();
			
			Заголовок = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаЗагрузки, "Наименование");
			
		Иначе
			
			Элементы.НастройкаЗагрузки.РежимВыбораИзСписка = Истина;
			Элементы.НастройкаЗагрузки.СписокВыбора.ЗагрузитьЗначения(Параметры.НастройкиЗагрузки);
			
			ТБ_СопоставлениеОбъектов.ИнициализироватьКомпоновщик(
				КомпоновщикНастроек,
				УникальныйИдентификатор,
				СвойстваИсточника);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьПредставлениеОтбора();
	
	ОтборСопоставлено = "НеСопоставлено";
	ОбновитьОтборСтрокТаблицыСопоставления();
	
	ЗаполнитьТаблицуСоответствияНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкаЗагрузкиПриИзменении(Элемент)
	
	НастройкаЗагрузкиПриИзмененииНаСервере();
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСоответствияОбъектов;
	УстановитьПредставлениеОтбора();
	
	ЗаполнитьТаблицуСоответствияНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСопоставленоПриИзменении(Элемент)
	
	ТБ_СопоставлениеОбъектовКлиент.УстановитьПометки(
		СоответствияОбъектов,
		Элементы.СоответствияОбъектов,
		Ложь);
	
	ОбновитьОтборСтрокТаблицыСопоставления();
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаОтборДанныхИсточникаНажатие(Элемент)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОтборДанныхИсточника Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСоответствияОбъектов;
		УстановитьПредставлениеОтбора();
		
		ОбновитьТаблицуСоответствияНаКлиенте();
		ОбновитьОтборСтрокТаблицыСопоставления();
		
	Иначе
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОтборДанныхИсточника;
		УстановитьПредставлениеОтбора();
		
	КонецЕсли;
	
	ТекущийЭлемент = Элементы.Страницы;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоответствияОбъектов

&НаКлиенте
Процедура СоответствияОбъектовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.СоответствияОбъектовОбъект Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Значение = Элемент.ТекущиеДанные.Объект;
		Если ЗначениеЗаполнено(Значение) Тогда
			ПоказатьЗначение(, Значение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСоответствияОбъектов(Команда)
	
	ЗаполнитьТаблицуСоответствияНаКлиенте();
	ОбновитьОтборСтрокТаблицыСопоставления();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсеСоответствияОбъектов(Команда)
	
	ТБ_СопоставлениеОбъектовКлиент.УстановитьПометки(
		СоответствияОбъектов,
		Элементы.СоответствияОбъектов,
		Истина,
		ОтборСтрокСопоставлено());
	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьВсеСоответствияОбъектов(Команда)
	
	ТБ_СопоставлениеОбъектовКлиент.УстановитьПометки(
		СоответствияОбъектов,
		Элементы.СоответствияОбъектов,
		Ложь,
		ОтборСтрокСопоставлено());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбъекты(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = СоответствияОбъектов.НайтиСтроки(Новый Структура("Пометка", Истина));
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны строки для загрузки.'"));
		Возврат;
		
	КонецЕсли;
	
	//Для каждого СтрокаСоответствия Из НайденныеСтроки Цикл
	//	
	//	СтрокаСоответствия.Объект       = Неопределено;
	//	СтрокаСоответствия.Сопоставлено = Ложь;
	//	
	//КонецЦикла;
	
	ЗагрузитьОбъектыНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗагруженныеДанные(Команда)
	
	НайденныеСтроки = СоответствияОбъектов.НайтиСтроки(Новый Структура("Пометка", Истина));
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны строки для проверки.'"));
		Возврат;
		
	КонецЕсли;
	
	КоличествоЗаписей = ПроверитьЗагруженныеДанныеНаСервере();
	
	ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru = 'Проверка завершена (%1)'"), КоличествоЗаписей),
		,
		НСтр("ru = 'Проверка объектов завершена.'"),
		БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

&НаКлиенте
Процедура АнализЗагруженныхДанных(Команда)
	
	ТекущиеДанные = Элементы.СоответствияОбъектов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанных = ТБ_СопоставлениеОбъектовКлиент.СтруктураДанныхИсточника(ТекущиеДанные, СвойстваИсточника);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийОбъект",     ТекущиеДанные.Объект);
	ПараметрыФормы.Вставить("НастройкаЗагрузки", НастройкаЗагрузки);
	ПараметрыФормы.Вставить("СтруктураДанных",   СтруктураДанных);
	
	ОткрытьФорму("Обработка.ТБ_АнализЗагруженныхДанных.Форма.Форма", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьОтборСтрокТаблицыСопоставления()
	
	Элементы.СоответствияОбъектов.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрокСопоставлено());
	
КонецПроцедуры

&НаКлиенте
Функция ОтборСтрокСопоставлено()
	
	Результат = Новый Структура;
	
	Если ОтборСопоставлено = "Сопоставлено" Тогда
		
		Результат.Вставить("Сопоставлено", Истина);
		
	ИначеЕсли ОтборСопоставлено = "НеСопоставлено" Тогда
		
		Результат.Вставить("Сопоставлено", Ложь);
		
	ИначеЕсли ОтборСопоставлено = "НеПроведено" Тогда
		
		Результат.Вставить("Сопоставлено", Истина);
		Результат.Вставить("Проведено",    Ложь);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ПриИзмененииРеквизитов

&НаСервере
Процедура НастройкаЗагрузкиПриИзмененииНаСервере()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиЗагрузкиОбъектов.ПравилоСопоставления КАК ПравилоСопоставления,
	|	ЕСТЬNULL(НастройкиЗагрузкиОбъектов.ПравилоСопоставления.ИмяОбъекта, """") КАК ИмяОбъекта,
	|	ЕСТЬNULL(НастройкиЗагрузкиОбъектов.ПравилоСопоставления.ИсточникДанных, ЗНАЧЕНИЕ(Справочник.ТБ_ИсточникиДанных.ПустаяСсылка)) КАК ИсточникДанных
	|ИЗ
	|	Справочник.ТБ_НастройкиЗагрузкиОбъектов КАК НастройкиЗагрузкиОбъектов
	|ГДЕ
	|	НастройкиЗагрузкиОбъектов.Ссылка = &НастройкаЗагрузки");
	
	Запрос.УстановитьПараметр("НастройкаЗагрузки", НастройкаЗагрузки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка, "ПравилоСопоставления,ИмяОбъекта,ИсточникДанных");
	
	//
	
	СоздатьТаблицуСоответствия();
	
	ТБ_СопоставлениеОбъектов.ИнициализироватьКомпоновщик(
		КомпоновщикНастроек,
		УникальныйИдентификатор,
		СвойстваИсточника);
	
	//
	
	ИнициализироватьКомпоновщикОбъекта();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикОбъекта()
	
	СхемаКомпоновки = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанныхНабора = СхемаКомпоновки.ИсточникиДанных.Добавить();
	ИсточникДанныхНабора.Имя = "ИсточникДанных";
	ИсточникДанныхНабора.ТипИсточникаДанных = "Local";
	
	НаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "НаборДанных";
	НаборДанных.ИсточникДанных = "ИсточникДанных";
	НаборДанных.Запрос =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	" + ИмяОбъекта + " КАК ТаблицаОбъекта";
	
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновки, УникальныйИдентификатор);
	
	КомпоновщикНастроекОбъекта.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	КомпоновщикНастроекОбъекта.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанныхИсточника

&НаСервере
Процедура СоздатьТаблицуСоответствия()
	
	СоответствияОбъектов.Очистить();
	
	ТБ_СопоставлениеОбъектов.УдалитьРеквизитыВТаблице(
		ЭтотОбъект,
		"СоответствияОбъектов",
		СвойстваИсточника);
	
	ТБ_СопоставлениеОбъектов.ЗаполнитьСвойстваИсточникаДанныхПоНастройке(
		СвойстваИсточника,
		НастройкаЗагрузки);
	
	ТБ_СопоставлениеОбъектов.ДобавитьРеквизитыВТаблицу(
		ЭтотОбъект,
		"СоответствияОбъектов",
		СвойстваИсточника);
	
КонецПроцедуры

#Область ЗаполнениеТаблицыСоответствия

&НаКлиенте
Процедура ЗаполнитьТаблицуСоответствияНаКлиенте()
	
	СоответствияОбъектов.Очистить();
	
	Если ЗначениеЗаполнено(НастройкаЗагрузки) Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Выполняется получение списка объектов'");
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			НачатьЗаполнениеТаблицыСоответствия(),
			Новый ОписаниеОповещения("ЗаполнитьТаблицуСоответствияЗавершение", ЭтотОбъект),
			ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуСоответствияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ПолучитьТаблицуСоотвествия(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Элементы.СоответствияОбъектов.Обновить();
	
КонецПроцедуры

&НаСервере
Функция НачатьЗаполнениеТаблицыСоответствия()
	
	ПараметрыЗаполнения = Обработки.ТБ_ЗагрузкаОбъектов.ПараметрыЗаполнения();
	ПараметрыЗаполнения.ИмяОбъекта                 = ИмяОбъекта;
	ПараметрыЗаполнения.ИсточникДанных             = ИсточникДанных;
	ПараметрыЗаполнения.ПравилоСопоставления       = ПравилоСопоставления;
	ПараметрыЗаполнения.СвойстваИсточника          = РеквизитФормыВЗначение("СвойстваИсточника");
	ПараметрыЗаполнения.НастройкиКомпоновки        = КомпоновщикНастроек.ПолучитьНастройки();
	ПараметрыЗаполнения.НастройкиКомпоновкиОбъекта = КомпоновщикНастроекОбъекта.ПолучитьНастройки();
	ПараметрыЗаполнения.ТаблицаСоответствия        = СоответствияОбъектов.Выгрузить();
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор),
		"Обработки.ТБ_ЗагрузкаОбъектов.ЗаполнитьТаблицуСоответствия",
		ПараметрыЗаполнения);
	
КонецФункции

#КонецОбласти

#Область ОбновлениеТаблицыСоответствия

&НаКлиенте
Процедура ОбновитьТаблицуСоответствияНаКлиенте()
	
	СоответствияОбъектов.Очистить();
	
	Если ЗначениеЗаполнено(НастройкаЗагрузки) Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Выполняется получение списка объектов'");
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			НачатьОбновлениеТаблицыСоответствия(),
			Новый ОписаниеОповещения("ОбновитьТаблицуСоответствияЗавершение", ЭтотОбъект),
			ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуСоответствияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ПолучитьТаблицуСоотвествия(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Элементы.СоответствияОбъектов.Обновить();
	
КонецПроцедуры

&НаСервере
Функция НачатьОбновлениеТаблицыСоответствия()
	
	ПараметрыЗаполнения = Обработки.ТБ_ЗагрузкаОбъектов.ПараметрыЗаполнения();
	ПараметрыЗаполнения.ИмяОбъекта                 = ИмяОбъекта;
	ПараметрыЗаполнения.ИсточникДанных             = ИсточникДанных;
	ПараметрыЗаполнения.ПравилоСопоставления       = ПравилоСопоставления;
	ПараметрыЗаполнения.СвойстваИсточника          = РеквизитФормыВЗначение("СвойстваИсточника");
	ПараметрыЗаполнения.НастройкиКомпоновки        = КомпоновщикНастроек.ПолучитьНастройки();
	ПараметрыЗаполнения.НастройкиКомпоновкиОбъекта = КомпоновщикНастроекОбъекта.ПолучитьНастройки();
	ПараметрыЗаполнения.ТаблицаСоответствия        = СоответствияОбъектов.Выгрузить();
	ПараметрыЗаполнения.ТаблицаИсточника           = ПолучитьИзВременногоХранилища(АдресТаблицыИсточника);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор),
		"Обработки.ТБ_ЗагрузкаОбъектов.ОбновитьТаблицуСоответствия",
		ПараметрыЗаполнения);
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ПолучитьТаблицуСоотвествия(Знач АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПоместитьВоВременноеХранилище(Результат.ТаблицаИсточника, АдресТаблицыИсточника);
		СоответствияОбъектов.Загрузить(Результат.ТаблицаСоответствия);
		
	Иначе
		СоответствияОбъектов.Загрузить(Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаОбъектов

&НаКлиенте
Процедура ЗагрузитьОбъектыНаКлиенте()
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Выполняется загрузка объектов'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал = 2;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		НачатьЗагрузкуОбъектов(),
		Новый ОписаниеОповещения("ЗагрузитьОбъектыЗавершение", ЭтотОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбъектыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	КоличествоЗаписей = ПолучитьЗагруженныеОбъекты(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	//
	
	ТипыОбъектов = Новый Массив;
	
	НайденныеСтроки = СоответствияОбъектов.НайтиСтроки(Новый Структура("Пометка", Истина));
	Для каждого СтрокаСоответствия Из НайденныеСтроки Цикл
		
		Если ЗначениеЗаполнено(СтрокаСоответствия.Объект) Тогда
			
			ТипОбъекта = ТипЗнч(СтрокаСоответствия.Объект);
			Если ТипыОбъектов.Найти(ТипОбъекта) = Неопределено Тогда
				
				ОповеститьОбИзменении(ТипОбъекта);
				ТипыОбъектов.Добавить(ТипОбъекта);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	//
	
	ОбновитьОтборСтрокТаблицыСопоставления();
	Элементы.СоответствияОбъектов.Обновить();
	
	ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru = 'Загрузка завершена (%1)'"), КоличествоЗаписей),
		,
		НСтр("ru = 'Загрузка объектов завершена.'"),
		БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

&НаСервере
Функция НачатьЗагрузкуОбъектов()
	
	Для каждого СтрокаСоответствия Из СоответствияОбъектов Цикл
		СтрокаСоответствия.ИдентификаторСтроки = СтрокаСоответствия.ПолучитьИдентификатор();
	КонецЦикла;
	
	ПараметрыЗагрузки = Новый Структура;
	ПараметрыЗагрузки.Вставить("ИсточникДанных",      ИсточникДанных);
	ПараметрыЗагрузки.Вставить("НастройкаЗагрузки",   НастройкаЗагрузки);
	ПараметрыЗагрузки.Вставить("СвойстваИсточника",   РеквизитФормыВЗначение("СвойстваИсточника"));
	ПараметрыЗагрузки.Вставить("ТаблицаСоответствия", СоответствияОбъектов.Выгрузить(Новый Структура("Пометка", Истина)));
	ПараметрыЗагрузки.Вставить("ВыводитьСообщения",   Истина);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор),
		"Обработки.ТБ_ЗагрузкаОбъектов.ЗагрузитьОбъекты",
		ПараметрыЗагрузки);
	
КонецФункции

&НаСервере
Функция ПолучитьЗагруженныеОбъекты(Знач АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Для каждого СтрокаТаблицы Из Результат.ТаблицаСоответствия Цикл
		
		СтрокаСоответствия = СоответствияОбъектов.НайтиПоИдентификатору(СтрокаТаблицы.ИдентификаторСтроки);
		Если СтрокаСоответствия <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаСоответствия, СтрокаТаблицы);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого ОписаниеОшибки Из Результат.ОписаниеОшибок Цикл
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки.ТекстОшибки);
	КонецЦикла;
	
	Возврат Результат.КоличествоЗаписей;
	
КонецФункции

#КонецОбласти

#Область ПроверкаЗагруженныхДанных

&НаСервере
Функция ПроверитьЗагруженныеДанныеНаСервере()
	
	НайденныеСтроки = СоответствияОбъектов.НайтиСтроки(Новый Структура("Пометка,Сопоставлено", Истина, Истина));
	Для каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		
		Результат = ТБ_ЗагрузкаОбъектов.ПроверитьЗагруженныйОбъект(НастройкаЗагрузки, СтрокаТаблицы.Объект);
		СтрокаТаблицы.КартинкаСостояние = ?(Результат, 1, 3);
		
	КонецЦикла;
	
	Возврат НайденныеСтроки.Количество();
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура УстановитьПредставлениеОтбора()
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОтборДанныхИсточника Тогда
		
		ПредставлениеОтбора = НСтр("ru = 'Закрыть отбор...'");
		Элементы.ГиперссылкаОтборДанныхИсточника.Высота = 0;
		
	Иначе
		
		Строки = Новый Массив;
		
		Строка = ПредставлениеОтбора(КомпоновщикНастроек.Настройки.Отбор);
		Если ЗначениеЗаполнено(Строка) Тогда
			Строки.Добавить(СтрШаблон(НСтр("ru = 'Отбор данных источника: %1'"), Строка));
		КонецЕсли;
		
		Строка = ПредставлениеОтбора(КомпоновщикНастроекОбъекта.Настройки.Отбор);
		Если ЗначениеЗаполнено(Строка) Тогда
			Строки.Добавить(СтрШаблон(НСтр("ru = 'Отбор объектов: %1'"), Строка));
		КонецЕсли;
		
		ПредставлениеОтбора = СтрСоединить(Строки, Символы.ПС);
		Элементы.ГиперссылкаОтборДанныхИсточника.Высота = Строки.Количество();
		
		Если Не ЗначениеЗаполнено(ПредставлениеОтбора) Тогда
			ПредставлениеОтбора = НСтр("ru = 'Показать отбор...'");
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ГиперссылкаОтборДанныхИсточника.Заголовок = ПредставлениеОтбора;
	
КонецПроцедуры

&НаКлиенте
Функция ПредставлениеОтбора(Знач Отбор, Знач КоличествоСимволов = 100)
	
	ПредставлениеОтбора = Строка(Отбор);
	
	Если СтрДлина(ПредставлениеОтбора) > КоличествоСимволов Тогда
		ПредставлениеОтбора = Лев(ПредставлениеОтбора, КоличествоСимволов) + "...";
	КонецЕсли;
	
	Возврат ПредставлениеОтбора;
	
КонецФункции

#КонецОбласти
