
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, Параметры)
	
	ТекстОшибки = "";
	
	Если Не ПроверитьСценарий(ПараметрКоманды, ТекстОшибки) Тогда
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ПоказатьПредупреждение(, ТекстОшибки);
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
	ПараметрыЖурналаРегистрации = ПараметрыЖурналаРегистрации(ПараметрКоманды);
	Если ПараметрыЖурналаРегистрации = Неопределено Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Сценарий еще не выполнялся.'"));
		Возврат;
		
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма", ПараметрыЖурналаРегистрации, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьСценарий(Знач Сценарий, ТекстОшибки)
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "ЭтоГруппа") Тогда
		
		ТекстОшибки = НСтр("ru = 'Команда недоступна для группы.'");
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПараметрыЖурналаРегистрации(Знач Сценарий)
	
	Возврат ТБ_ЗагрузкаОбъектов.ПараметрыЖурналаРегистрации(Сценарий);
	
КонецФункции

#КонецОбласти
