
#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
&После("СписокДокументыЗакупкиПриПолученииДанныхНаСервере")
Процедура ТБ_СписокДокументыЗакупкиПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ТБ_ЗагрузкаОбъектов.ЗаполнитьПризнакЗагружен(Строки);
	
КонецПроцедуры

&НаСервере
&После("НастроитьФормуПоВыбраннымОперациямИДокументам")
Процедура ТБ_НастроитьФормуПоВыбраннымОперациямИДокументам(ТЗХозОперацииИТипыДокументов)
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	ЗаполнитьЗначенияСвойств(СвойстваСписка, СписокДокументыЗакупки);
	
	СвойстваСписка.ТекстЗапроса = СтрЗаменить(СвойстваСписка.ТекстЗапроса,
		"	РеестрДокументов.Ссылка,",
		"	РеестрДокументов.Ссылка,
		|	-1 КАК ТБ_Загружен,");
	
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.СписокДокументыЗакупки, СвойстваСписка);
	
КонецПроцедуры

#КонецОбласти
