
#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура ПослеОтветаНаВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПредопределенныеЗначенияСправочникаНаСервере(); 
	ОповеститьОбИзменении(Тип("СправочникСсылка.ТБ_Объекты"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПредопределенныеЗначенияСправочникаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТБ_Объекты.Наименование КАК Наименование,
		|	ТБ_Объекты.ПолноеИмя КАК ПолноеИмя,
		|	ТБ_Объекты.Ссылка КАК Ссылка,
		|	ТБ_Объекты.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	Справочник.ТБ_Объекты КАК ТБ_Объекты";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Сбросить();
	Если Выборка.НайтиСледующий(Новый Структура("Наименование, ЭтоГруппа", "Документы ERP", Истина)) Тогда
		ГруппаДокументыERP = Выборка.Ссылка; 
	Иначе
		ГруппаДокументыERP = Справочники.ТБ_Объекты.СоздатьГруппу();
		ГруппаДокументыERP.Наименование = "Документы ERP";
		ГруппаДокументыERP.ОбменДанными.Загрузка = Истина;
		ГруппаДокументыERP.Записать();
	КонецЕсли;
	
	Выборка.Сбросить();
	Если Выборка.НайтиСледующий(Новый Структура("Наименование, ЭтоГруппа", "Справочники ERP", Истина)) Тогда
		ГруппаERP = Выборка.Ссылка; 
	Иначе
		ГруппаERP = Справочники.ТБ_Объекты.СоздатьГруппу();
		ГруппаERP.Наименование = "Справочники ERP";
		ГруппаERP.ОбменДанными.Загрузка = Истина;
		ГруппаERP.Записать(); 
	КонецЕсли;
	
	Выборка.Сбросить();
	Если Выборка.НайтиСледующий(Новый Структура("Наименование, ЭтоГруппа", "Справочники УАТ", Истина)) Тогда
		ГруппаУАТ = Выборка.Ссылка; 
	Иначе
		ГруппаУАТ = Справочники.ТБ_Объекты.СоздатьГруппу();
		ГруппаУАТ.Наименование = "Справочники УАТ";
		ГруппаУАТ.ОбменДанными.Загрузка = Истина;
		ГруппаУАТ.Записать(); 
	КонецЕсли;
	
	Выборка.Сбросить();
	Если Выборка.НайтиСледующий(Новый Структура("Наименование, ЭтоГруппа", "Справочники УСО", Истина)) Тогда 
		ГруппаУСО = Выборка.Ссылка; 
	Иначе
		ГруппаУСО = Справочники.ТБ_Объекты.СоздатьГруппу();
		ГруппаУСО.Наименование = "Справочники УСО";
		ГруппаУСО.ОбменДанными.Загрузка = Истина;
		ГруппаУСО.Записать(); 
	КонецЕсли;
	
	Для Каждого Тип Из Метаданные.РегистрыСведений.ТБ_СоответствияОбъектов.Ресурсы.Объект.Тип.Типы() Цикл
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
		Если ОбъектМетаданных = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		
		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(ПолноеИмя, "ПолноеИмя") Тогда 
        	Продолжить;	
		КонецЕсли;    
		
		Группа = Неопределено;
		
		Если СтрНачинаетсяС(ПолноеИмя, "Документ") Тогда
			Группа = ГруппаДокументыERP.Ссылка;
		Иначе
			Если СтрНачинаетсяС(ОбъектМетаданных.Имя, "уат") Тогда
				Группа = ГруппаУАТ.Ссылка;
			ИначеЕсли СтрНачинаетсяС(ОбъектМетаданных.Имя, "УСОERP_") Или СтрНачинаетсяС(ОбъектМетаданных.Имя, "СМ_") Тогда
				Группа = ГруппаУСО.Ссылка;
			Иначе
				Группа = ГруппаERP.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		НовыйЭлемент = Справочники.ТБ_Объекты.СоздатьЭлемент();
		НовыйЭлемент.Родитель = Группа;
		НовыйЭлемент.Наименование = ОбъектМетаданных.Синоним;
		НовыйЭлемент.ПолноеИмя = ПолноеИмя;
		НовыйЭлемент.ОбменДанными.Загрузка = Истина;
		НовыйЭлемент.Записать(); 
	КонецЦикла;
	
	ОбщегоНазначения.СообщитьПользователю("Создание предопределенных элементов завершено!");

КонецПроцедуры

#КонецОбласти

