
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("Реквизиты.СвойствоИсточника");
	МассивНепроверяемыхРеквизитов.Добавить("Реквизиты.Обработчик");
	МассивНепроверяемыхРеквизитов.Добавить("ДополнительныеРеквизиты.СвойствоИсточника");
	МассивНепроверяемыхРеквизитов.Добавить("ДополнительныеРеквизиты.Обработчик");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ВариантыЗаполненияПоИсточнику = Новый Массив;
	ВариантыЗаполненияПоИсточнику.Добавить(Перечисления.ТБ_ВариантыЗаполнения.ЗначениеИсточника);
	ВариантыЗаполненияПоИсточнику.Добавить(Перечисления.ТБ_ВариантыЗаполнения.ПоискПоКоду);
	ВариантыЗаполненияПоИсточнику.Добавить(Перечисления.ТБ_ВариантыЗаполнения.ПоискПоНаименованию);
	ВариантыЗаполненияПоИсточнику.Добавить(Перечисления.ТБ_ВариантыЗаполнения.ПоискПоСоответствию);
	
	Для каждого СтрокаТаблицы Из Реквизиты Цикл
		
		Если СтрокаТаблицы.Пометка Тогда
			
			АдресОшибки = СтрШаблон(НСтр("ru = ' в строке %1 списка ""Реквизиты""'"), СтрокаТаблицы.НомерСтроки);
			
			Если ВариантыЗаполненияПоИсточнику.Найти(СтрокаТаблицы.ВариантЗаполнения) <> Неопределено
				И Не ЗначениеЗаполнено(СтрокаТаблицы.СвойствоИсточника) Тогда
				
				ТекстОшибки = НСтр("ru = 'Не заполнена колонка ""Свойство источника""'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстОшибки + АдресОшибки,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Реквизиты", СтрокаТаблицы.НомерСтроки, "СвойствоИсточника"),
					,
					Отказ);
				
			КонецЕсли;
		
			Если СтрокаТаблицы.ВариантЗаполнения = Перечисления.ТБ_ВариантыЗаполнения.Обработчик
				И Не ЗначениеЗаполнено(СтрокаТаблицы.Обработчик) Тогда
				
				ТекстОшибки = НСтр("ru = 'Не заполнена колонка ""Обработчик""'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстОшибки + АдресОшибки,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Реквизиты", СтрокаТаблицы.НомерСтроки, "Обработчик"),
					,
					Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	//
	
	Для каждого СтрокаТаблицы Из ДополнительныеРеквизиты Цикл
		
		Если СтрокаТаблицы.Пометка Тогда
			
			АдресОшибки = СтрШаблон(НСтр("ru = ' в строке %1 списка ""Дополнительные реквизиты""'"), СтрокаТаблицы.НомерСтроки);
			
			Если ВариантыЗаполненияПоИсточнику.Найти(СтрокаТаблицы.ВариантЗаполнения) <> Неопределено
				И Не ЗначениеЗаполнено(СтрокаТаблицы.СвойствоИсточника) Тогда
				
				ТекстОшибки = НСтр("ru = 'Не заполнена колонка ""Свойство источника""'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстОшибки + АдресОшибки,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДополнительныеРеквизиты", СтрокаТаблицы.НомерСтроки, "СвойствоИсточника"),
					,
					Отказ);
				
			КонецЕсли;
		
			Если СтрокаТаблицы.ВариантЗаполнения = Перечисления.ТБ_ВариантыЗаполнения.Обработчик
				И Не ЗначениеЗаполнено(СтрокаТаблицы.Обработчик) Тогда
				
				ТекстОшибки = НСтр("ru = 'Не заполнена колонка ""Обработчик""'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстОшибки + АдресОшибки,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДополнительныеРеквизиты", СтрокаТаблицы.НомерСтроки, "Обработчик"),
					,
					Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		
		Если ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
			ТипПравила = Перечисления.ТБ_ТипыПравилСопоставления.ЗагрузкаТабличнойЧасти;
		Иначе
			ТипПравила = Перечисления.ТБ_ТипыПравилСопоставления.СопоставлениеОбъектов;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
