#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру параметров заполнения таблицы соответствия.
//
// Возвращаемое значение:
//  Произвольный - структура параметров заполнения таблицы соответствия.
//
Функция ПараметрыЗаполнения() Экспорт
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ИмяОбъекта");
	ПараметрыЗаполнения.Вставить("ИсточникДанных");
	ПараметрыЗаполнения.Вставить("ПравилоСопоставления");
	ПараметрыЗаполнения.Вставить("СвойстваИсточника");
	ПараметрыЗаполнения.Вставить("НастройкиКомпоновки");
	ПараметрыЗаполнения.Вставить("НастройкиКомпоновкиОбъекта");
	ПараметрыЗаполнения.Вставить("ТаблицаСоответствия");
	ПараметрыЗаполнения.Вставить("ТаблицаИсточника");
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

// Заполняет таблицу соответствия по данным внешнего источника.
//
// Параметры:
//  ПараметрыЗаполнения - Структура - параметры заполнения, см. ПараметрыЗаполнения().
//
// Возвращаемое значение:
//  Произвольный - структура с таблицей данных источника и таблицей соответствия.
//
Функция ЗаполнитьТаблицуСоответствия(Знач ПараметрыЗаполнения) Экспорт
	
	ТаблицаИсточника = ТБ_СопоставлениеОбъектов.ТаблицаИсточника(ПараметрыЗаполнения.СвойстваИсточника);
	
	ТБ_СопоставлениеОбъектов.ЗагрузитьИзВнешнегоИсточника(
		ТаблицаИсточника,
		ПараметрыЗаполнения.ИсточникДанных,
		ПараметрыЗаполнения.СвойстваИсточника,
		,
		Истина);
	
	ТаблицаИсточника = ТБ_СопоставлениеОбъектов.ТаблицаИсточникаСОтборами(
		ТаблицаИсточника,
		ПараметрыЗаполнения.СвойстваИсточника,
		ПараметрыЗаполнения.ПравилоСопоставления);
	
	ПараметрыЗаполнения.ТаблицаИсточника = ТаблицаИсточника;
	ТаблицаСоответствия = ОбновитьТаблицуСоответствия(ПараметрыЗаполнения);
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаИсточника",    ТаблицаИсточника);
	Результат.Вставить("ТаблицаСоответствия", ТаблицаСоответствия);
	
	Возврат Результат;
	
КонецФункции

// Обновляет таблицу соответствия по данным источника, сохраненным в параметрах заполнения.
//
// Параметры:
//  ПараметрыЗаполнения - Структура - параметры заполнения, см. ПараметрыЗаполнения().
//
// Возвращаемое значение:
//  ТаблицаЗначений - обновленная таблица соответствия.
//
Функция ОбновитьТаблицуСоответствия(Знач ПараметрыЗаполнения) Экспорт
	
	ТаблицаСоответствия = ПараметрыЗаполнения.ТаблицаСоответствия;
	ТаблицаСоответствия.Очистить();
	
	Если ПараметрыЗаполнения.ТаблицаИсточника.Количество() <> 0 Тогда
		
		ТаблицаИсточника = ТБ_СопоставлениеОбъектов.ТаблицаИсточникаСОтборами(
			ПараметрыЗаполнения.ТаблицаИсточника,
			ПараметрыЗаполнения.СвойстваИсточника,
			ПараметрыЗаполнения.НастройкиКомпоновки);
		
		Для каждого СтрокаТаблицы Из ТаблицаИсточника Цикл
			
			СтрокаСоответствия = ТаблицаСоответствия.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСоответствия, СтрокаТаблицы);
			
			Идентификатор   = ТБ_СопоставлениеОбъектов.ИдентификаторИсточника(СтрокаСоответствия, ПараметрыЗаполнения.СвойстваИсточника);
			Представление   = ТБ_СопоставлениеОбъектов.ПредставлениеИсточника(СтрокаСоответствия, ПараметрыЗаполнения.СвойстваИсточника);
			СтруктураДанных = ТБ_СопоставлениеОбъектов.СтруктураДанныхИсточника(СтрокаСоответствия, ПараметрыЗаполнения.СвойстваИсточника);
			
			СтрокаСоответствия.Идентификатор        = Идентификатор;
			СтрокаСоответствия.ИмяОбъекта           = ПараметрыЗаполнения.ИмяОбъекта;
			СтрокаСоответствия.Объект               = Неопределено;
			СтрокаСоответствия.ИсточникДанных       = ПараметрыЗаполнения.ИсточникДанных;
			СтрокаСоответствия.Представление        = Представление;
			СтрокаСоответствия.ДанныеИсточника      = ТБ_СопоставлениеОбъектов.СтрокаJSON(СтруктураДанных);
			СтрокаСоответствия.ПравилоСопоставления = ПараметрыЗаполнения.ПравилоСопоставления;
			СтрокаСоответствия.Сопоставлено         = Ложь;
			
		КонецЦикла;
		
		ЗаполнитьСлужебныеРеквизиты(ТаблицаСоответствия);
		ОтобратьОбъекты(ТаблицаСоответствия, ПараметрыЗаполнения.ИмяОбъекта, ПараметрыЗаполнения.НастройкиКомпоновкиОбъекта);
		
		ТаблицаСоответствия.Сортировать("Идентификатор");
		
	КонецЕсли;
	
	Возврат ТаблицаСоответствия;
	
КонецФункции

// Загружает объекты по данным источника и записывает соответствия в регистр сведений.
//
// Параметры:
//  Параметры - Структура - параметры загрузки.
//
// Возвращаемое значение:
//  Произвольный - результат загрузки объектов.
//
Функция ЗагрузитьОбъекты(Знач Параметры) Экспорт
	
	ТаблицаСоответствия = Параметры.ТаблицаСоответствия;
	КоличествоЗаписей   = 0;
	
	ПараметрыЗагрузки  = ТБ_ЗагрузкаОбъектов.ПараметрыЗагрузки(Параметры.НастройкаЗагрузки);
	ПараметрыИсточника = ТБ_СопоставлениеОбъектов.ПараметрыИсточника(Параметры.ИсточникДанных);
	
	Если ПараметрыИсточника.ТипИсточника = Перечисления.ТБ_ТипыИсточниковДанных.COM1C Тогда
		
		Соединение = ТБ_СопоставлениеОбъектовПовтИсп.COMСоединение(ПараметрыИсточника.НастройкаПодключения);
		Если Соединение = Неопределено Тогда
			
			ТекстСообщения = НСтр("ru = 'При подключении к источнику возникли ошибки (см. Журнал регистрации).'");
			ВызватьИсключение ТекстСообщения;
			
		КонецЕсли;
		
	Иначе
		Соединение = Неопределено;
	КонецЕсли;
	
	//
	
	ПараметрыСопоставления = ТБ_СопоставлениеОбъектов.ПараметрыСопоставления(ПараметрыЗагрузки.ПравилоСопоставления);
	ПараметрыСопоставления.СоздаватьНовыеЗначенияСвойств = Ложь;
	ПараметрыСопоставления.СоздаватьНовыеОбъекты         = Истина;
	ПараметрыСопоставления.ОбновлятьСуществующиеОбъекты  = Истина;
	ПараметрыСопоставления.РежимРазработчика             = Ложь;
	ПараметрыСопоставления.ВыводитьСообщения             = Параметры.ВыводитьСообщения;
	
	ТаблицаДанных = ТБ_СопоставлениеОбъектов.ТаблицаДанныхСоЗначениямиПолей(
		ТаблицаСоответствия,
		ПараметрыСопоставления,
		Параметры.СвойстваИсточника);
	
	ПараметрыОбъекта = ТБ_СопоставлениеОбъектов.ПараметрыОбъекта(ПараметрыЗагрузки.ПравилоСопоставления, ПараметрыСопоставления);
	
	Если ПараметрыОбъекта.ВсеПоляПоиска.Количество() = 0 Тогда
		
		ТекстСообщения = НСтр("ru = 'Не указаны поля поиска для сопоставляемых объектов'");
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
	КоличествоСтрок = ТаблицаДанных.Количество();
	НомерСтроки = 0;
	
	Для каждого СтрокаДанных Из ТаблицаДанных Цикл
		
		ДлительныеОперации.СообщитьПрогресс(Окр(НомерСтроки / КоличествоСтрок * 100, 0),
			СтрШаблон(НСтр("ru = 'Загружено %1 из %2'"), НомерСтроки, КоличествоСтрок));
		
		НомерСтроки = НомерСтроки + 1;
		
		//
		
		ДанныеОбъекта = ТБ_СопоставлениеОбъектов.НайтиСоздатьОбъект(СтрокаДанных, ПараметрыОбъекта, ПараметрыСопоставления);
		
		Если ДанныеОбъекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		//
		
		СтрокиСоответствия = ТаблицаСоответствия.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаДанных.ИдентификаторСтроки));
		Если СтрокиСоответствия.Количество() <> 1 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСоответствия = СтрокиСоответствия[0];
		
		СоответствияОбъектов = РегистрыСведений.ТБ_СоответствияОбъектов.СоздатьНаборЗаписей();
		СоответствияОбъектов.Отбор.Идентификатор.Установить(СтрокаСоответствия.Идентификатор);
		СоответствияОбъектов.Отбор.ИмяОбъекта.Установить(СтрокаСоответствия.ИмяОбъекта);
		
		НоваяЗапись = СоответствияОбъектов.Добавить();
		НоваяЗапись.Идентификатор        = СтрокаСоответствия.Идентификатор;
		НоваяЗапись.ИмяОбъекта           = СтрокаСоответствия.ИмяОбъекта;
		НоваяЗапись.Объект               = ДанныеОбъекта.Ссылка;
		НоваяЗапись.ИсточникДанных       = СтрокаСоответствия.ИсточникДанных;
		НоваяЗапись.Представление        = СтрокаСоответствия.Представление;
		НоваяЗапись.ДанныеИсточника      = СтрокаСоответствия.ДанныеИсточника;
		НоваяЗапись.ПравилоСопоставления = СтрокаСоответствия.ПравилоСопоставления;
		
		ДанныеОбъекта.СвязанныеОбъекты.Добавить(СоответствияОбъектов);
		
		// Загрузка табличных частей.
		Для каждого СтрокаТаблицы Из ПараметрыЗагрузки.ТабличныеЧасти Цикл
			
			ПараметрыОтбора = ТБ_СопоставлениеОбъектов.ПараметрыОтбораИдентификатора(
				СтрокаТаблицы.ПравилоСопоставления, СтрокаДанных.ДанныеИсточника);
			
			ТБ_СопоставлениеОбъектов.ЗагрузитьДанныеТабличнойЧасти(ДанныеОбъекта, СтрокаТаблицы.ПравилоСопоставления,
				ПараметрыОтбора, ПараметрыСопоставления.ОписаниеОшибок, Соединение);
			
		КонецЦикла;
		
		//
		
		Если Не ТБ_СопоставлениеОбъектов.ЗаписатьОбъект(ДанныеОбъекта, ПараметрыОбъекта, СтрокаДанных.ДанныеИсточника, ПараметрыСопоставления) Тогда
			Продолжить;
		КонецЕсли;
		
		//
		
		Если ПараметрыИсточника.ИспользуетсяПланОбмена Тогда
			
			Соединение.ПланыОбмена.ТБ_ОбменСопоставлениеОбъектов.УдалитьРегистрациюИзмененийПоИдентификатору(
				ПараметрыИсточника.КодУзлаПланаОбмена,
				ПараметрыИсточника.ИмяОбъектаПланаОбмена,
				СтрокаСоответствия.НомерСообщенияИсточника,
				СтрокаСоответствия.ИдентификаторИсточника);
			
		КонецЕсли;
		
		// Статусы после загрузки.
		СтрокаСоответствия.Объект            = ДанныеОбъекта.Ссылка;
		СтрокаСоответствия.Сопоставлено      = Истина;
		СтрокаСоответствия.Пометка           = Ложь;
		СтрокаСоответствия.КартинкаСостояние = 0;
		СтрокаСоответствия.Проведено         = Проведено(СтрокаСоответствия.Объект);
		СтрокаСоответствия.КартинкаОбъекта   = КартинкаОбъекта(СтрокаСоответствия.Объект);
		
		КоличествоЗаписей = КоличествоЗаписей + 1;
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаСоответствия", ТаблицаСоответствия);
	Результат.Вставить("КоличествоЗаписей",   КоличествоЗаписей);
	Результат.Вставить("ОписаниеОшибок",      ПараметрыСопоставления.ОписаниеОшибок);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСлужебныеРеквизиты(ТаблицаСоответствия)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСоответствия.Идентификатор КАК Идентификатор,
	|	ТаблицаСоответствия.ИмяОбъекта КАК ИмяОбъекта
	|ПОМЕСТИТЬ ТаблицаСоответствия
	|ИЗ
	|	&ТаблицаСоответствия КАК ТаблицаСоответствия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Идентификатор,
	|	ИмяОбъекта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСоответствия.Идентификатор КАК Идентификатор,
	|	ТаблицаСоответствия.ИмяОбъекта КАК ИмяОбъекта,
	|	ЕСТЬNULL(СоответствияОбъектов.Объект, НЕОПРЕДЕЛЕНО) КАК Объект,
	|	ЕСТЬNULL(СоответствияОбъектов.Объект, НЕОПРЕДЕЛЕНО) <> НЕОПРЕДЕЛЕНО КАК Сопоставлено,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СоответствияОбъектов.Объект, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КартинкаСостояние
	|ИЗ
	|	ТаблицаСоответствия КАК ТаблицаСоответствия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТБ_СоответствияОбъектов КАК СоответствияОбъектов
	|		ПО ТаблицаСоответствия.Идентификатор = СоответствияОбъектов.Идентификатор
	|			И ТаблицаСоответствия.ИмяОбъекта = СоответствияОбъектов.ИмяОбъекта");
	
	ПоляИдентификатора = "Идентификатор,ИмяОбъекта";
	
	Запрос.УстановитьПараметр("ТаблицаСоответствия", ТаблицаСоответствия.Скопировать(, ПоляИдентификатора));
	
	ДанныеСоответствия = Запрос.Выполнить().Выгрузить();
	ДанныеСоответствия.Индексы.Добавить(ПоляИдентификатора);
	
	ПараметрыОтбора = Новый Структура(ПоляИдентификатора);
	
	Для каждого СтрокаТаблицы Из ТаблицаСоответствия Цикл
		
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаТаблицы);
		
		НайденныеСтроки = ДанныеСоответствия.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, НайденныеСтроки[0]);
		КонецЕсли;
		
		СтрокаТаблицы.Проведено       = Проведено(СтрокаТаблицы.Объект);
		СтрокаТаблицы.КартинкаОбъекта = КартинкаОбъекта(СтрокаТаблицы.Объект);
		
	КонецЦикла;
	
КонецПроцедуры

Функция Проведено(Знач Объект)
	
	Если ЗначениеЗаполнено(Объект)
		И ОбщегоНазначения.ВидОбъектаПоСсылке(Объект) = "Документ" Тогда
		
		ИмяРеквизитаПроведен = "Проведен";
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, ИмяРеквизитаПроведен) = Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция КартинкаОбъекта(Знач Объект)
	
	Если ЗначениеЗаполнено(Объект) Тогда
		
		ВидОбъекта = ОбщегоНазначения.ВидОбъектаПоСсылке(Объект);
		
		Если ВидОбъекта = "Документ" Тогда
			
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект, "Проведен,ПометкаУдаления");
			
			Возврат ?(ЗначенияРеквизитов.Проведен = Истина, 1, ?(ЗначенияРеквизитов.ПометкаУдаления = Истина, 3, 0));
			
		Иначе
			
			ИмяРеквизитаПометкаУдаления = "ПометкаУдаления";
			Возврат ?(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, ИмяРеквизитаПометкаУдаления) = Истина, 3, 0);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат -1;
	
КонецФункции

Процедура ОтобратьОбъекты(ТаблицаСоответствия, Знач ИмяОбъекта, Знач НастройкиКомпоновкиОбъекта)
	
	Если НастройкиКомпоновкиОбъекта = Неопределено
		Или НастройкиКомпоновкиОбъекта.Отбор.Элементы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОбъектов = ТаблицаСоответствия.Скопировать(, "Объект");
	ТаблицаОбъектов.Свернуть("Объект");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаОбъектов.Объект КАК Объект
	|ПОМЕСТИТЬ ТаблицаОбъектов
	|ИЗ
	|	&ТаблицаОбъектов КАК ТаблицаОбъектов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект");
	
	Запрос.УстановитьПараметр("ТаблицаОбъектов", ТаблицаОбъектов);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	//
	
	СхемаКомпоновки = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных = СхемаКомпоновки.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "НаборДанных";
	НаборДанных.ИсточникДанных = "ИсточникДанных";
	НаборДанных.Запрос =
	"ВЫБРАТЬ
	|	ТаблицаОбъектов.Объект КАК Объект,
	|	ТаблицаОбъекта.*
	|ИЗ
	|	" + ИмяОбъекта + " КАК ТаблицаОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектов КАК ТаблицаОбъектов
	|		ПО ТаблицаОбъекта.Ссылка = ТаблицаОбъектов.Объект";
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки));
	
	Если НастройкиКомпоновкиОбъекта = Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиОбъекта);
		КомпоновщикНастроек.Восстановить();
	КонецЕсли;
	
	//
	
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	
	ГруппировкаКомпоновки = НастройкиКомпоновки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаКомпоновки.Использование = Истина;
	
	ПолеГруппировки = ГруппировкаКомпоновки.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Использование = Истина;
	
	ВыбранноеПоле = ГруппировкаКомпоновки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Объект");
	ВыбранноеПоле.Использование = Истина;
	
	//
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, НастройкиКомпоновки, , ,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , , , МенеджерВременныхТаблиц);
	
	ТаблицаОбъектов = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаОбъектов);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	//
	
	ТаблицаОбъектов.Индексы.Добавить("Объект");
	
	УдаляемыеСтроки = Новый Массив;
	
	Для каждого СтрокаТаблицы Из ТаблицаСоответствия Цикл
		
		Если ТаблицаОбъектов.НайтиСтроки(Новый Структура("Объект", СтрокаТаблицы.Объект)).Количество() = 0 Тогда
			УдаляемыеСтроки.Добавить(СтрокаТаблицы);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из УдаляемыеСтроки Цикл
		ТаблицаСоответствия.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли