#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Значение);
	
	Если Параметры.Свойство("ЕстьЗначениеИсточника") И Параметры.ЕстьЗначениеИсточника = Истина Тогда
		ДанныеВыбора.Добавить(ЗначениеИсточника);
	КонецЕсли;
	
	Если Параметры.Свойство("ЕстьПоискПоКоду") И Параметры.ЕстьПоискПоКоду = Истина Тогда
		ДанныеВыбора.Добавить(ПоискПоКоду);
	КонецЕсли;
	
	Если Параметры.Свойство("ЕстьПоискПоНаименованию") И Параметры.ЕстьПоискПоНаименованию = Истина Тогда
		ДанныеВыбора.Добавить(ПоискПоНаименованию);
	КонецЕсли;
	
	Если Параметры.Свойство("ЕстьПоискПоСоответствию") И Параметры.ЕстьПоискПоСоответствию = Истина Тогда
		ДанныеВыбора.Добавить(ПоискПоСоответствию);
	КонецЕсли;
	
	ДанныеВыбора.Добавить(Обработчик);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
