
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Находит дубли в таблице соответствия по полям поиска правила сопоставления.
//
// Параметры:
//  ТаблицаСоответствия - ТаблицаЗначений - таблица соответствия объектов.
//  ПравилоСопоставления - СправочникСсылка.ТБ_ПравилаСопоставления - правило сопоставления.
//  СвойстваИсточника - ТаблицаЗначений - таблица свойств источника данных.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица строк соответствия, имеющих дубли по полям поиска.
//
Функция НайтиДублиПоПолямПоиска(Знач ТаблицаСоответствия, Знач ПравилоСопоставления, Знач СвойстваИсточника) Экспорт
	
	ПараметрыСопоставления = ТБ_СопоставлениеОбъектов.ПараметрыСопоставления(ПравилоСопоставления);
	ПараметрыСопоставления.СоздаватьНовыеЗначенияСвойств = Ложь;
	ПараметрыСопоставления.СоздаватьНовыеОбъекты         = Ложь;
	ПараметрыСопоставления.ОбновлятьСуществующиеОбъекты  = Ложь;
	ПараметрыСопоставления.РежимРазработчика             = Ложь;
	
	//
	
	ТаблицаДублей = Новый ТаблицаЗначений;
	ТаблицаДублей.Колонки.Добавить("ИдентификаторСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
	
	ИменаПолейПоиска = ПараметрыСопоставления.ТаблицаРеквизитов.Скопировать(Новый Структура("Поиск", Истина), "ПолноеИмя").ВыгрузитьКолонку("ПолноеИмя");
	Если ИменаПолейПоиска.Количество() <> 0 Тогда
		
		ПоляПоиска = СтрСоединить(ИменаПолейПоиска, ",");
		
		ТаблицаДанных = ТаблицаДанныхСоЗначениямиПолей(ТаблицаСоответствия, ПараметрыСопоставления, СвойстваИсточника);
		
		ТаблицаДублейДанных = ТаблицаДанных.Скопировать(, ПоляПоиска);
		ТаблицаДублейДанных.Индексы.Добавить(ПоляПоиска);
		
		ТаблицаДублейДанных.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
		ТаблицаДублейДанных.ЗаполнитьЗначения(1, "Количество");
		ТаблицаДублейДанных.Свернуть(ПоляПоиска, "Количество");
		
		ПараметрыОтбора = Новый Структура(ПоляПоиска);
		
		Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
			
			ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаТаблицы);
			
			НайденныеСтроки = ТаблицаДублейДанных.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() <> 0
				И НайденныеСтроки[0].Количество > 1 Тогда
				
				ЗаполнитьЗначенияСвойств(ТаблицаДублей.Добавить(), СтрокаТаблицы);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаДублей;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТаблицаДанныхСоЗначениямиПолей(ТаблицаИсточника, Знач ПараметрыСопоставления, Знач СвойстваИсточника)
	
	ТаблицаДанных = ТБ_СопоставлениеОбъектов.ТаблицаДанныхДляСопоставления(ПараметрыСопоставления);
	
	Для каждого СтрокаИсточника Из ТаблицаИсточника Цикл
		
		СтрокаДанных = ТБ_СопоставлениеОбъектов.ДобавитьСтрокуДанных(
			ТаблицаДанных,
			СтрокаИсточника.ИдентификаторСтроки,
			СтрокаИсточника.Идентификатор,
			ТБ_СопоставлениеОбъектов.СтруктураДанныхИсточника(СтрокаИсточника, СвойстваИсточника),
			ПараметрыСопоставления);
		
		Если Не СтрокаДанных.Отказ Тогда
			
			НезаполненныеПоля = ТБ_СопоставлениеОбъектов.ПроверитьЗаполнениеСтрокиДанных(СтрокаДанных, ПараметрыСопоставления);
			Если НезаполненныеПоля.Количество() <> 0 Тогда
				
				НомерСтроки = СтрокаИсточника.ИдентификаторСтроки + 1;
				
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Не определено значение для обязательных полей %1 в строке %2 списка ""Соответствия объектов""'"),
					СтрСоединить(НезаполненныеПоля, ", "),
					НомерСтроки);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
					,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоответствияОбъектов", НомерСтроки, "Идентификатор"),
					,
					СтрокаДанных.Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаДанных;
	
КонецФункции

#КонецОбласти

#КонецЕсли