
#Область СлужебныеПроцедурыИФункции

&После("ВыполнитьПереопределяемуюКоманду")
Процедура ТБ_ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры)
	
	// Команда "Загрузить объект" в форме объекта.
	ТБ_ЗагрузитьОбъект(Форма, Команда);
	
	// Команда "Загрузить объекты" в форме списка (журнала).
	ТБ_ЗагрузитьОбъекты(Форма, Команда);
	
КонецПроцедуры

Процедура ТБ_ЗагрузитьОбъект(Форма, Команда)
	
	Если Команда.Имя = "ТБ_ЗагрузитьОбъект" Тогда
		
		ОчиститьСообщения();
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", Форма);
		
		Оповещение = Новый ОписаниеОповещения("ТБ_ЗагрузитьОбъектЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = НСтр("ru = 'Данные объекта будут загружены из источника. Продолжить?'");
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ТБ_ЗагрузитьОбъектЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Форма = ДополнительныеПараметры.Форма;
		
		ОписаниеОшибок = ТБ_СопоставлениеОбъектовВызовСервера.ЗагрузитьОбъект(Форма.Объект.Ссылка);
		
		Если ОписаниеОшибок.Количество() <> 0 Тогда
			
			Для каждого ОписаниеОшибки Из ОписаниеОшибок Цикл
				ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки.ТекстОшибки);
			КонецЦикла;
			
		Иначе
			
			Форма.Прочитать();
			
			ОповеститьОбИзменении(Форма.Объект.Ссылка);
			
			ТекстСообщения = НСтр("ru = 'Данные объекта загружены из источника'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ТБ_ЗагрузитьОбъекты(Форма, Команда)
	
	Если Команда.Имя = "ТБ_ЗагрузитьОбъекты" Тогда
		
		НастройкиЗагрузки = ТБ_СопоставлениеОбъектовВызовСервера.НастройкиЗагрузки(Форма.ИмяФормы);
		
		ПараметрыФормы = Новый Структура("НастройкиЗагрузки", НастройкиЗагрузки);
		
		ОткрытьФорму("Обработка.ТБ_ЗагрузкаОбъектов.Форма.Форма",
			ПараметрыФормы, Форма, Форма.УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
